{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability exists in certain Cisco IOS  ® software release trains running on the Cisco  IAD2400 series, 1900 Series Mobile Wireless Edge Routers and Cisco VG224 Analog  Phone Gateways. Vulnerable versions may contain a default hard-coded Simple  Network Management Protocol (SNMP) community string when SNMP is enabled on the  device. The default community string is a result of inadvertently identifying  these devices as supporting Data Over Cable Service Interface Specification  (DOCSIS) compliant interfaces. The consequence of this error is that an  additional read-write community string may be enabled if the device is  configured for SNMP management, allowing a knowledgeable attacker the potential  to gain privileged access to the device.\r\n\r\nCisco is making free software available to address this vulnerability  for affected customers. There are workarounds available to mitigate the effects  of the vulnerability.\r\n\r\nThis advisory is posted at  http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20060920-docsis [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20060920-docsis\"].",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "The following products are affected if they run a vulnerable release  of Cisco IOS software with the SNMP server enabled. Any version of Cisco IOS  software prior to the versions listed in the Fixed Software section below may  be vulnerable.\r\n\r\n To determine if the SNMP server is running on your device and the  default community string is present, issue the show snmp  community command while in enable mode at the prompt and look for  output similar to:\r\n\r\n\r\nRouter#show snmp community\n Community name: cable-docsis Community Index: cisco0 Community SecurityName: cable-docsis storage-type: read-only  active\r\n\r\n If the SNMP server is disabled on your device, output similar to the  following will be returned:\r\n\r\n\r\nRouter#show snmp community\n%SNMP agent not enabled\r\n\r\n To determine the software running on a Cisco product, log in to the  device and issue the show version command to display  the system banner. Cisco IOS software will identify itself as \"Internetwork  Operating System Software\" or simply \"IOS\". On the next line of output, the  image name will be displayed between parentheses, followed by \"Version\" and the  IOS release name. Other Cisco devices will not have the show  version command or will give different output.\r\n\r\n The following example identifies a Cisco product running IOS release  12.2(15)MC2 with an installed image name of MWR1900-I-M:\r\n\r\n\r\nCisco Internetwork Operating System Software\nIOS (tm) 1900 Software (MWR1900-I-M), Version 12.2(15)MC2, EARLY DEPLOYMENT RELEASE SOFTWARE (fc1)\r\n\r\n Additional information about Cisco IOS release naming can be found at  http://www.cisco.com/warp/public/620/1.html [\"http://www.cisco.com/warp/public/620/1.html\"].",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "Cisco devices that may be running with affected Cisco IOS software  releases include:\r\n\r\n   Cisco IAD2430 Integrated Access Device\r\n\r\n   Cisco IAD2431 Integrated Access Device\r\n\r\n   Cisco IAD2432 Integrated Access Device\r\n\r\n   Cisco VG224 Analog Phone Gateway\r\n\r\n   Cisco MWR 1900 Mobile Wireless Edge Router\r\n\r\n   Cisco MWR 1941 Mobile Wireless Edge Router",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "These products are not vulnerable:\r\n\r\n   Cisco IAD2420 Integrated Access Device\r\n\r\n   Cisco IAD2421 Integrated Access Device\r\n\r\n   Cisco IAD2423 Integrated Access Device\r\n\r\n   Cisco IAD2424 Integrated Access Device\r\n\r\n\r\nNo other Cisco products are currently known to be affected by this  vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Implementation of the Data Over Cable Service Interface Specification  (DOCSIS) standards allow for data transmission over physical media used by  cable television providers. Accordingly,  RFC 2669 [\"http://www.ietf.org/rfc/rfc2669.txt\"]   defines the DOCSIS Cable Device MIB, better known as the DOCS-CABLE-DEVICE-MIB,  for which support is required in order to be considered DOCSIS compliant. That  MIB defines the table, docsDevNmAccessTable, as:\r\n\r\n\r\n\"This table controls access to SNMP objects by network\nmanagement stations. If the table is empty, access to SNMP objects is unrestricted.  This table exists only on SNMPv1 or v2c agents and does not exist on SNMPv3 agents. See the conformance section for details. Specifically, for v3 agents, the appropriate MIBs and security models apply in lieu of this table.\"\r\n\r\n In order to comply with the DOCSIS standard and to avoid unrestricted  access to SNMP objects, Cisco devices which support DOCSIS contain a read-write  community string, \"cable-docsis\".\r\n\r\n Inclusion of this SNMP community string is intended only for  DOCSIS-compliant cable-capable devices. A vulnerability exists in the  inadvertent enabling of this community string in Cisco IOS release trains  running on the affected platforms.\r\n\r\n Customers running vulnerable versions of Cisco IOS software on those  platforms may be unaware of the additional read-write community string.\r\n\r\n This vulnerability is documented in Cisco Bug ID  CSCsb04965 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsb04965\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)          on the Cisco IAD2400 series and Cisco  VG224 Analog Phone Gateways and as  CSCsb06658 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsb06658\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)          on the 1900 Series Mobile Wireless Edge  Routers.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "The effectiveness of any workarounds is dependent on specific customer  situations such as product mix, network topology, traffic behavior and  organizational mission. Due to the variety of affected products and releases,  customers should consult with their service provider or support organization to  ensure any applied workaround is the most appropriate for use in the intended  network before it is deployed.\r\n\r\n The following workarounds should only be considered as a long term  solution if anti-spoofing methods consistently prevent spoofed source attacks  from entering the network and access-lists provided below are configured on  every potentially affected device.\r\n    Disable the SNMP Server\r\n If the SNMP server is not used for any legitimate purposes on the  device, it is a best practice to disable it by issuing the following commands  in configure mode:\r\n\r\n\r\nno snmp-server\r\n\n\r\n Removing the public community string with the configure command  no snmp-server community <string> ro is not  sufficient as the SNMP server will still be running and the device will be  vulnerable. The command no snmp-server must be used  instead. The SNMP server status may be verified by using the enable command  show snmp. You should see a response of \"%SNMP agent  not enabled\".\r\n\r\n Note that this workaround may only be viable if SNMP is not used in  any way for managing the device.\r\n    Restrict Access via a Community-map\r\n The ability to create a community-map was introduced in Cisco IOS  versions 12.0(23)S, 12.2(25)S and 12.3(2)T. This feature adds the ability to  create a mapping between an SNMP community and an SNMP context, Engine ID, or  security name that is different from the default settings.\r\n\r\n When an SNMP community is associated with an SNMP context, whenever a  request is made from this community, it is applied to the context specified.  This feature can also be used to specify the source address validation for an  SNMP community.\r\n\r\n Consider the following example:\r\n\r\n\r\nRouter(config)#access-list 65 remark Deny access to community string\nRouter(config)#access-list 65 deny   any Router(config)#snmp-server community no-access RO 65 Router(config)#snmp mib community-map  cable-docsis security-name no-access\r\n\r\n The above creates a new community named \"no-access\". The authorization  to use the community \"no-access\" is controlled by an access-list, which in this  case denies all hosts from using it. With the addition of the snmp  mib community-map command, the current community string of  \"cable-docsis\" is then under the access restrictions of the new community  string \"no-access\" preventing any use of the \"cable-docsis\" community string.\r\n    Control Plane Policing\r\n Cisco IOS release trains 12.0S, 12.2SX, 12.2S, 12.3T, 12.4, and 12.4T  support Control Plane Policing (CoPP) which may be configured to protect the  device from attacks that target the management and control planes. The  following example can be adapted to your network. This example assumes that all  SNMP access is to be restricted to a management station with the IP address of  10.1.1.1, and that the management station need only communicate with router's  IP address 192.168.10.1:\r\n\r\n\r\naccess-list 111 deny udp host 10.1.1.1 host 192.168.10.1 eq snmp\naccess-list 111 permit udp any any eq snmp access-list 111 deny ip any any ! class-map match-all drop-snmp-class  match access-group 111 ! ! policy-map drop-snmp-policy  class drop-snmp-class    drop ! control-plane  service-policy input drop-snmp-policy\r\n\r\n Please note that in the 12.0S, 12.2S, and 12.2SX Cisco IOS trains the  policy-map syntax is different:\r\n\r\n\r\npolicy-map drop-snmp-policy\n class drop-snmp-class   police 32000 1500 1500 conform-action drop exceed-action drop\r\n\r\n In the above CoPP examples the ACL entries that match the exploit  packets with the \"permit\" action result in these packets being discarded by the  policy-map \"drop\" function, while packets that match the \"deny\" action are not  affected by the policy-map drop function.\r\n\r\n Additional information on the configuration and use of the CoPP  feature can be found at the following URL:\r\n\r\n  http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html [\"http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html\"]\r\n    Restrict Access to Trusted Hosts Only\r\n Access Control Lists (ACLs) can be used to deny traffic to the device.  Although Cisco IOS devices have community-string access lists which check the  source address of SNMP requests per community string, they will not work in  this case as the cable-docsis community string is not able to be modified or  deleted via configuration options.\r\n\r\n It is possible to permit UDP traffic to the router from trusted IP  addresses with interface ACLs.\r\n\r\n Note:  Because SNMP is based on UDP, it is possible to spoof the sender's IP address, which may defeat ACLs that permit communication to these ports from trusted IP addresses.\r\n\r\n The following extended access-list can be adapted to your network.  This example assumes that the router has IP addresses 192.168.10.1 and  172.16.1.1 configured on its interfaces, that all SNMP access is to be  restricted to a management station with the IP address of 10.1.1.1, and that  the management station need only communicate with IP address 192.168.10.1:\r\n\r\n\r\naccess-list 101 permit udp host 10.1.1.1 host 192.168.10.1 eq snmp\naccess-list 101 deny udp any host 192.168.10.1 eq snmp access-list 101 deny udp any host 172.16.1.1 eq snmp access-list 101 permit ip any any\r\n\r\n The access-list must then be applied to all interfaces using the  following configuration commands:\r\n\r\n\r\ninterface FastEthernet 0/0\nip access-group 101 in\r\n\r\n Note that UDP traffic to port 161 (SNMP) must be explicitly blocked to  each IP address on the router to prevent the router from accepting and  processing the SNMP packets. Blocking traffic to port 161 from unknown hosts is  considered a best practice. All devices that need to communicate directly with  the router on port 161 will need to be specifically listed in the above access  list.\r\n\r\n For devices that have many IP addresses configured, or many hosts that  need to communicate with the router, this may not be a scalable solution.\r\n    Infrastructure ACLs (iACL)\r\n Although it is often difficult to block traffic transiting your  network, it is possible to identify traffic which should never be allowed to  target your infrastructure devices and block that traffic at the border of your  network. Infrastructure ACLs are considered a network security best practice  and should be considered as a long-term addition to good network security as  well as a workaround for this specific vulnerability. The white paper entitled  \"Protecting Your Core: Infrastructure Protection Access Control Lists\" presents  guidelines and recommended deployment techniques for iACLs:\r\n\r\n    http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml\"]",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, also consult  http://www.cisco.com/go/psirt [\"http://www.cisco.com/go/psirt\"]  and any subsequent advisories to determine exposure and a complete upgrade  solution.\r\n\r\nIn all cases, customers should exercise caution to be certain the  devices to be upgraded contain sufficient memory and that current hardware and  software configurations will continue to be supported properly by the new  release. If the information is not clear, contact the Cisco Technical  Assistance Center (\"TAC\") or your contracted maintenance provider for  assistance.\r\n\r\nEach row of the Cisco IOS software table (below) describes a release  train and the platforms or products for which it is intended. If a given  release train is vulnerable, then the earliest possible releases that contain  the fix (the \"First Fixed Release\") and the anticipated date of availability  for each are listed in the \"Rebuild\" and \"Maintenance\" columns. A device  running a release in the given train that is earlier than the release in a  specific column (less than the First Fixed Release) is known to be vulnerable.  The release should be upgraded at least to the indicated release or a later  version (greater than or equal to the First Fixed Release label).\r\n\r\nFor more information on the terms \"Rebuild\" and \"Maintenance,\" consult  the following URL: http://www.cisco.com/warp/public/620/1.html [\"http://www.cisco.com/warp/public/620/1.html\"].\r\n\r\n Major Release\r\n\r\n Availability of Repaired Releases\r\n\r\n Affected 12.2-Based Release\r\n\r\n Rebuild\r\n\r\n Maintenance\r\n\r\n 12.2MC\r\n\r\n 12.2(15)MC2c\r\n\r\n\r\n\r\n12.2ZJ\r\n\r\nVulnerable; migrate to 12.3(4)T13 or later\r\n\r\n Affected 12.3-Based Release\r\n\r\n Rebuild\r\n\r\n Maintenance\r\n\r\n12.3T\r\n\r\n12.3(4)T13\r\n\r\n12.3(7)T11\r\n\r\n12.3(8)T10\r\n\r\n12.3(11)T6\r\n\r\nVulnerable; for 12.3(14), migrate to 12.4(1b) or  later\r\n\r\n12.3XD\r\n\r\nVulnerable; migrate to 12.3(7)T11 or later\r\n\r\n12.3XX\r\n\r\nVulnerable; migrate to 12.4(1b) or later\r\n\r\n12.3XY\r\n\r\nVulnerable; migrate to 12.4(1b) or later\r\n\r\n12.3YA\r\n\r\nVulnerable; contact TAC\r\n\r\n12.3YD\r\n\r\nVulnerable; migrate to 12.4(2)T5 or later\r\n\r\n12.3YF\r\n\r\nVulnerable; migrate to 12.3(14)YX or later\r\n\r\n12.3YG\r\n\r\n12.3(14)YG5\r\n\r\n12.3YH\r\n\r\nVulnerable; migrate to 12.4(2)T5 or later\r\n\r\n12.3YI\r\n\r\nVulnerable; migrate to 12.4(2)T5 or later\r\n\r\n12.3YJ\r\n\r\nVulnerable; migrate to 12.3(14)YQ8 or later\r\n\r\n12.3YK\r\n\r\nVulnerable; migrate to 12.4(4)T or later\r\n\r\n12.3YM\r\n\r\n12.3(14)YM8\r\n\r\n12.3YQ\r\n\r\n12.3(14)YQ8\r\n\r\n12.3YS\r\n\r\nVulnerable; migrate to 12.4(4)T or later\r\n\r\n12.3YT\r\n\r\nVulnerable; migrate to 12.4(4)T or later\r\n\r\n12.3YU\r\n\r\nVulnerable; migrate to 12.4(2)XB or later\r\n\r\n Affected 12.4-Based Release\r\n\r\n Rebuild\r\n\r\n Maintenance\r\n\r\n12.4\r\n\r\n12.4(1b)\r\n\r\n12.4(3)\r\n\r\n12.4MR\r\n\r\n12.4(4)MR\r\n\r\n12.4T\r\n\r\n12.4(2)T5\r\n\r\n12.4(4)T",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious  use of the vulnerability described in this advisory.\r\n\r\nThis vulnerability was reported to Cisco by a customer.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "external",
				"summary": "Identifying and Mitigating Exploitation of the DOCSIS RW Community String Enabled Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20060923-docsis"
			},
			{
				"category": "self",
				"summary": "DOCSIS Read-Write Community String Enabled in Non-DOCSIS Platforms",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20060920-docsis"
			}
		],
		"title": "DOCSIS Read-Write Community String Enabled in Non-DOCSIS Platforms",
		"tracking": {
			"current_release_date": "2006-09-20T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:05:32+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20060920-docsis",
			"initial_release_date": "2006-09-20T16:00:00+00:00",
			"revision_history": [],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"cve": "CVE-2006-4950",
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "DOCSIS Read-Write Community String Enabled in Non-DOCSIS Platforms",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20060920-docsis"
				}
			],
			"remediations": [
				{
					"category": "workaround",
					"details": "The effectiveness of any workarounds is dependent on specific customer  situations such as product mix, network topology, traffic behavior and  organizational mission. Due to the variety of affected products and releases,  customers should consult with their service provider or support organization to  ensure any applied workaround is the most appropriate for use in the intended  network before it is deployed.\r\n\r\n The following workarounds should only be considered as a long term  solution if anti-spoofing methods consistently prevent spoofed source attacks  from entering the network and access-lists provided below are configured on  every potentially affected device.\r\n    Disable the SNMP Server\r\n If the SNMP server is not used for any legitimate purposes on the  device, it is a best practice to disable it by issuing the following commands  in configure mode:\r\n\r\n\r\nno snmp-server\r\n\n\r\n Removing the public community string with the configure command  no snmp-server community <string> ro is not  sufficient as the SNMP server will still be running and the device will be  vulnerable. The command no snmp-server must be used  instead. The SNMP server status may be verified by using the enable command  show snmp. You should see a response of \"%SNMP agent  not enabled\".\r\n\r\n Note that this workaround may only be viable if SNMP is not used in  any way for managing the device.\r\n    Restrict Access via a Community-map\r\n The ability to create a community-map was introduced in Cisco IOS  versions 12.0(23)S, 12.2(25)S and 12.3(2)T. This feature adds the ability to  create a mapping between an SNMP community and an SNMP context, Engine ID, or  security name that is different from the default settings.\r\n\r\n When an SNMP community is associated with an SNMP context, whenever a  request is made from this community, it is applied to the context specified.  This feature can also be used to specify the source address validation for an  SNMP community.\r\n\r\n Consider the following example:\r\n\r\n\r\nRouter(config)#access-list 65 remark Deny access to community string\nRouter(config)#access-list 65 deny   any Router(config)#snmp-server community no-access RO 65 Router(config)#snmp mib community-map  cable-docsis security-name no-access\r\n\r\n The above creates a new community named \"no-access\". The authorization  to use the community \"no-access\" is controlled by an access-list, which in this  case denies all hosts from using it. With the addition of the snmp  mib community-map command, the current community string of  \"cable-docsis\" is then under the access restrictions of the new community  string \"no-access\" preventing any use of the \"cable-docsis\" community string.\r\n    Control Plane Policing\r\n Cisco IOS release trains 12.0S, 12.2SX, 12.2S, 12.3T, 12.4, and 12.4T  support Control Plane Policing (CoPP) which may be configured to protect the  device from attacks that target the management and control planes. The  following example can be adapted to your network. This example assumes that all  SNMP access is to be restricted to a management station with the IP address of  10.1.1.1, and that the management station need only communicate with router's  IP address 192.168.10.1:\r\n\r\n\r\naccess-list 111 deny udp host 10.1.1.1 host 192.168.10.1 eq snmp\naccess-list 111 permit udp any any eq snmp access-list 111 deny ip any any ! class-map match-all drop-snmp-class  match access-group 111 ! ! policy-map drop-snmp-policy  class drop-snmp-class    drop ! control-plane  service-policy input drop-snmp-policy\r\n\r\n Please note that in the 12.0S, 12.2S, and 12.2SX Cisco IOS trains the  policy-map syntax is different:\r\n\r\n\r\npolicy-map drop-snmp-policy\n class drop-snmp-class   police 32000 1500 1500 conform-action drop exceed-action drop\r\n\r\n In the above CoPP examples the ACL entries that match the exploit  packets with the \"permit\" action result in these packets being discarded by the  policy-map \"drop\" function, while packets that match the \"deny\" action are not  affected by the policy-map drop function.\r\n\r\n Additional information on the configuration and use of the CoPP  feature can be found at the following URL:\r\n\r\n  http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html [\"http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html\"]\r\n    Restrict Access to Trusted Hosts Only\r\n Access Control Lists (ACLs) can be used to deny traffic to the device.  Although Cisco IOS devices have community-string access lists which check the  source address of SNMP requests per community string, they will not work in  this case as the cable-docsis community string is not able to be modified or  deleted via configuration options.\r\n\r\n It is possible to permit UDP traffic to the router from trusted IP  addresses with interface ACLs.\r\n\r\n Note:  Because SNMP is based on UDP, it is possible to spoof the sender's IP address, which may defeat ACLs that permit communication to these ports from trusted IP addresses.\r\n\r\n The following extended access-list can be adapted to your network.  This example assumes that the router has IP addresses 192.168.10.1 and  172.16.1.1 configured on its interfaces, that all SNMP access is to be  restricted to a management station with the IP address of 10.1.1.1, and that  the management station need only communicate with IP address 192.168.10.1:\r\n\r\n\r\naccess-list 101 permit udp host 10.1.1.1 host 192.168.10.1 eq snmp\naccess-list 101 deny udp any host 192.168.10.1 eq snmp access-list 101 deny udp any host 172.16.1.1 eq snmp access-list 101 permit ip any any\r\n\r\n The access-list must then be applied to all interfaces using the  following configuration commands:\r\n\r\n\r\ninterface FastEthernet 0/0\nip access-group 101 in\r\n\r\n Note that UDP traffic to port 161 (SNMP) must be explicitly blocked to  each IP address on the router to prevent the router from accepting and  processing the SNMP packets. Blocking traffic to port 161 from unknown hosts is  considered a best practice. All devices that need to communicate directly with  the router on port 161 will need to be specifically listed in the above access  list.\r\n\r\n For devices that have many IP addresses configured, or many hosts that  need to communicate with the router, this may not be a scalable solution.\r\n    Infrastructure ACLs (iACL)\r\n Although it is often difficult to block traffic transiting your  network, it is possible to identify traffic which should never be allowed to  target your infrastructure devices and block that traffic at the border of your  network. Infrastructure ACLs are considered a network security best practice  and should be considered as a long-term addition to good network security as  well as a workaround for this specific vulnerability. The white paper entitled  \"Protecting Your Core: Infrastructure Protection Access Control Lists\" presents  guidelines and recommended deployment techniques for iACLs:\r\n\r\n    http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml\"]"
				}
			],
			"title": "Do not publish yet: Cisco IOS DOCSIS Community String Privilege Escalation Vulnerability"
		}
	]
}
