{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during the resolution of a Cisco TAC support case."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the access control list (ACL) processing in the egress direction of Cisco IOS XR Software could allow an unauthenticated, remote attacker to bypass a configured ACL.\r\n\r\nThis vulnerability exists because certain packets are handled incorrectly when they are received on an ingress interface on one line card and destined out of an egress interface on another line card where the egress ACL is configured. An attacker could exploit this vulnerability by attempting to send traffic through an affected device. A successful exploit could allow the attacker to bypass an egress ACL on the affected device.\r\n\r\nFor more information about this vulnerability, see the Details [\"#details\"] section of this advisory.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\n\r\n\r\nThis advisory is part of the March 2025 release of the Cisco IOS XR Software Security Advisory Bundled Publication. For a complete list of the advisories and links to them, see Cisco Event Response: March 2025 Semiannual Cisco IOS XR Software Security Advisory Bundled Publication [\"https://sec.cloudapps.cisco.com/security/center/viewErp.x?alertId=ERP-75548\"].",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "At the time of publication, this vulnerability affected the following Cisco products if they were running a vulnerable release of Cisco IOS XR Software and had egress IPv4 or IPv6 packet filtering enabled:\r\n\r\n8000 Series Modular Platforms – the following models only:\r\n8608 Routers\r\n8804 Routers\r\n8808 Routers\r\n8812 Routers\r\n8818 Routers\r\n\r\nIOSXRWBD modular variant (distributed disaggregated chassis)\r\nNetwork Convergence System (NCS) 5500 Modular Platforms – the following models only:\r\nNCS S5504\r\nNCS S5508\r\nNCS S5516\r\n\r\n\r\nFor information about which Cisco software releases were vulnerable at the time of publication, see the Fixed Software [\"#fs\"] section of this advisory. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.\r\n\r\nDetermine Whether IP Packet Filtering on the Egress Direction Is Enabled\r\n\r\nTo determine whether an egress IPv4 or IPv6 ACL is configured, use the show running-config | include ipv4 access-group .* egress or the show running-config | include ipv6 access-group .* egress CLI command. If the command returns output, the feature is configured, as shown in the following examples:\r\n\r\n\r\nRP/0/RP0/CPU0:NCS-5508-A#show running-config | include ipv4 access-group .* egress\r\nWed Mar  12 16:00:00.000 UTC\r\nBuilding configuration...\r\n ipv4 access-group EgressACL egress\r\nRP/0/RP0/CPU0:NCS-5508-A#\r\n\r\n\r\nRP/0/RP0/CPU0:NCS-5508-A#show running-config | include ipv6 access-group .* egress\r\nWed Mar  12 16:00:00.000 UTC\r\nBuilding configuration...\r\n ipv6 access-group EgressACL egress\r\nRP/0/RP0/CPU0:NCS-5508-A#\r\n\r\nNote: All interface egress types are affected except a bridged virtual interface (BVI).",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect the following Cisco products:\r\n\r\nIOS Software\r\nIOS XE Software\r\nNX-OS Software",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Exploitation of this vulnerability could allow an attacker to bypass protections that are provided by an ACL that is applied on an affected device. The overall impact of exploitation is organization specific because it depends on the importance of the assets that the ACL was supposed to protect. Customers should evaluate how exploitation of this vulnerability would impact their network and proceed according to their own vulnerability-handling and remediation processes.\r\n\r\nIn affected products, for traffic that is received on an ingress interface and is destined for an egress interface on a different line card (where the ACL is applied), certain packets that are received on the ingress interface and directed out of the egress interface are not being subjected to the configured egress ACL.\r\n\r\nTraffic that is received on an ingress interface and destined to an egress interface on the same line card is not impacted by this vulnerability. The egress ACL is handled appropriately when the ingress and egress interfaces are on the same line card.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n      Fixed Releases\r\nAt the time of publication, the release information in the following table(s) was accurate. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.\r\n\r\nIn the following table, the left column lists Cisco software releases or trains. The right column indicates whether a release (train) is affected by the vulnerability that is described in this advisory and the first release that includes the fix for this vulnerability.\r\n\r\n8000 Series Modular Platforms\r\n        Cisco IOS XR Software Release  First Fixed Release          24.4 and earlier  Migrate to a fixed release.      25.1.1 and later  Not affected.\r\nNCS 5500 Modular Platforms\r\n        Cisco IOS XR Software Release  First Fixed Release          7.10 and earlier  Migrate to a fixed release.      7.11  7.11.21      24.1  Migrate to a fixed release.      24.2  24.2.2      24.3 and later  Not affected.\r\nSMUs are also available to address this vulnerability. Customers who require SMUs for platforms or releases that are not available are advised to contact their support organization. For more information on finding which SMUs may have been published for this vulnerability, see the Download section of Understand Cisco IOS XR Software Maintenance Updates (SMUs) [\"https://www.cisco.com/c/en/us/support/docs/ios-nx-os-software/ios-xr-software/116332-maintain-ios-xr-smu-00.html#toc-hId-972485609\"].\r\n\r\nThe Cisco Product Security Incident Response Team (PSIRT) validates only the affected and fixed release information that is documented in this advisory.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during the resolution of a Cisco TAC support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS XR Software Access Control List Bypass Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-modular-ACL-u5MEPXMm"
			},
			{
				"category": "external",
				"summary": "Cisco Event Response: March 2025 Semiannual Cisco IOS XR Software Security Advisory Bundled Publication",
				"url": "https://sec.cloudapps.cisco.com/security/center/viewErp.x?alertId=ERP-75548"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "Understand Cisco IOS XR Software Maintenance Updates (SMUs)",
				"url": "https://www.cisco.com/c/en/us/support/docs/ios-nx-os-software/ios-xr-software/116332-maintain-ios-xr-smu-00.html#toc-hId-972485609"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco IOS XR Software Access Control List Bypass Vulnerability",
		"tracking": {
			"current_release_date": "2025-03-12T16:00:00+00:00",
			"generator": {
				"date": "2025-03-12T15:55:29+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-modular-ACL-u5MEPXMm",
			"initial_release_date": "2025-03-12T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2025-03-12T15:54:44+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco IOS XR Software",
						"product": {
							"name": "Cisco IOS XR Software ",
							"product_id": "CSAFPID-5834"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2025-20145",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCwk94942"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCwk63613"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-5834"
				]
			},
			"release_date": "2025-03-12T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-5834"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 5.8,
						"baseSeverity": "MEDIUM",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:L/A:N",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-5834"
					]
				}
			],
			"title": "Cisco IOS XR Software Access Control List Bypass Vulnerability"
		}
	]
}
