{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "The Cisco IOS Firewall Authentication Proxy for FTP and/or Telnet  Sessions feature in specific versions of Cisco IOS software is vulnerable to a  remotely-exploitable buffer overflow condition.\r\n\r\nDevices that do not support, or are not configured for Firewall  Authentication Proxy for FTP and/or Telnet Services are not affected.\r\n\r\nDevices configured with only Authentication Proxy for HTTP and/or HTTPS  are not affected.\r\n\r\nOnly devices running certain versions of Cisco  IOS® are affected.\r\n\r\nCisco has made free software available to address this vulnerability.  There are workarounds available to mitigate the effects of the vulnerability.\r\n\r\nThis advisory will be posted at  http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20050907-auth_proxy [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20050907-auth_proxy\"].",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This section provides details on affected products.",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "Devices that are running the following release trains of Cisco IOS are  affected if Firewall Authentication Proxy for FTP and/or Telnet Sessions is  configured and applied to an active interface.\r\n\r\n   12.2SG, 12.2SEC, 12.2SXF, 12.2SH, 12.2ZF and 12.2ZL based trains\r\n\r\n   12.3 based trains\r\n\r\n   12.3T based trains\r\n\r\n   12.4 based trains\r\n\r\n   12.4T based trains\r\n\r\n\r\nTo determine the software running on a Cisco product, log in to the  device and issue the show version command to display  the system banner. Cisco IOS software will identify itself as \"Internetwork  Operating System Software\" or simply \"IOS.\" On the next line of output, the  image name will be displayed between parentheses, followed by \"Version\" and the  Cisco IOS release name. Other Cisco devices will not have the show version  command, or will give different output.\r\n\r\nThe following example identifies a Cisco 7200 router running Cisco IOS  release 12.3(10a) with an installed image name of C7200-JK8O3S-M.\r\n\r\n\r\nRouter# show version\nCisco Internetwork Operating System Software  IOS (tm) 7200 Software (C7200-JK8O3S-M), Version 12.3(10a), RELEASE SOFTWARE (fc2) Copyright (c) 1986-2004 by cisco Systems, Inc.\r\n\r\nAdditional information about Cisco IOS release naming can be found at  http://www.cisco.com/warp/public/620/1.html [\"http://www.cisco.com/warp/public/620/1.html\"].\r\n\r\nRefer to the Details [\"#details\"] section for more  information about affected and unaffected configurations.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "These products are not vulnerable:\r\n\r\n   Products that are not running Cisco IOS are not affected.\r\n\r\n   Products that are running Cisco IOS versions 12.2 and earlier (including 12.0S) are not affected. (excluding those listed).\r\n\r\n   Products that are running Cisco IOS are not affected unless they are configured for Firewall Authentication Proxy for FTP and/or Telnet Sessions.\r\n\r\n   Products that are running Cisco IOS XR are not affected.\r\n\r\n\r\nNo other Cisco products are currently known to be affected by this  vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The Cisco IOS Firewall Authentication Proxy feature allows network  administrators to apply specific security policies on a per-user basis. With  the Firewall Authentication Proxy for FTP and/or Telnet Sessions feature, users  can log into the network services via FTP and/or Telnet, and their specific  access profiles are automatically retrieved and applied from a Remote  Authentication Dial In User Service (RADIUS), or Terminal Access Controller  Access Control System Plus (TACACS+) authentication server.\r\n\r\nCisco IOS Software is vulnerable to a Denial of Service (DoS) and  potentially an arbitrary code execution attack when processing the user  authentication credentials from an Authentication Proxy Telnet/FTP session. To  exploit this vulnerability an attacker must first complete a TCP connection to  the IOS device running affected software and receive an auth-proxy  authentication prompt.\r\n\r\n\r\n\r\nThis vulnerability is documented in the Cisco Bug Toolkit as Bug ID  CSCsa54608 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsa54608\"]             ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)         .\r\n\r\nTo determine if your device is running the Firewall Authentication  Proxy for FTP and/or Telnet Sessions feature, log into the device and issue the  show ip auth-proxy configuration command to display  the configuration of Firewall Authentication Proxy services. The following  example identifies Firewall Authentication Proxy services running for Telnet  and FTP under the proxy rule name proxy_example.\r\n\r\n\r\nRouter# show ip auth-proxy configuration \nAuthentication global cache time is 60 minutes Authentication global absolute time is 0 minutes Authentication Proxy Watch-list is disabled  Authentication Proxy Rule Configuration Auth-proxy name proxy_example ftp list not specified auth-cache-time 60 minutes telnet list not specified auth-cache-time 60 minutes\r\n\r\nThe following will be seen if Firewall Authentication Proxy services  are not enabled but supported in your IOS version:\r\n\r\n\r\nRouter# show ip auth-proxy configuration \nAuthentication global cache time is 60 minutes Authentication global absolute time is 0 minutes Authentication Proxy Watch-list is disabled  Router#\r\n\r\nThe following will be seen if running a version of IOS that does not  support Firewall Authentication Proxy services:\r\n\r\n\r\n\nRouter# show ip auth-proxy configuration                  ^ % Invalid input detected at '^' marker.  Router#\r\n\r\nA router that has Firewall Authentication Proxy services assigned to an  interface will have ip auth-proxy list  name  command under an interface in the  show running-config output.\r\n\r\nThe following example identifies Firewall Authentication Proxy services  running under the proxy rule name \"proxy_example\" applied to the interface  Ethernet 2/1:\r\n\r\n\r\nRouter# show ip auth-proxy configuration \nAuthentication global cache time is 60 minutes Authentication global absolute time is 0 minutes Authentication Proxy Watch-list is disabled  Authentication Proxy Rule Configuration Auth-proxy name proxy_example     ftp list not specified auth-cache-time 60 minutes telnet list not specified auth-cache-time 60 minutes  Router# show running-config . . ! interface Ethernet2/1  ip address 10.1.1.1 255.255.255.0  ip auth-proxy proxy_example ! . .\r\n\r\nAdditional information about Cisco IOS Firewall Authentication Proxy  services refer to:  http://www.cisco.com/univercd/cc/td/doc/product/software/ios120/120newft/120t/120t5/iosfw2/iosfw2_1.htm [\"/en/US/docs/ios/12_0t/12_0t5/feature/guide/iosfw2_1.html\"].\r\n\r\nAdditional information about Cisco IOS Firewall Authentication Proxy  for FTP and/or Telnet Sessions refer to:  http://www.cisco.com/univercd/cc/td/doc/product/software/ios123/123newft/123_1/ftp_tel.htm [\"/en/US/docs/ios/12_3/feature/guide/ftp_tel.html\"]",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "The effectiveness of any workaround is dependent on specific customer  situations such as product mix, network topology, traffic behavior, and  organizational mission. Due to the variety of affected products and releases,  customers should consult with their service provider or support organization to  ensure any applied workaround is the most appropriate for use in the intended  network before it is deployed.\r\n\r\n   Disable Cisco IOS Firewall Authentication Proxy feature for Telnet/FTP sessions.\r\nIn networks where Cisco IOS Firewall Authentication Proxy feature for Telnet/FTP sessions is not required but enabled, disabling the feature on an IOS device will eliminate exposure to this vulnerability. On a router which is configured for Cisco IOS Firewall Authentication Proxy feature for Telnet/FTP sessions, this must be done by issuing the command:\r\nno ip auth-proxy name 'auth-proxy-name' {ftp | telnet}\r\n\r\n   Deploy Cisco IOS Firewall Authentication Proxy feature for HTTP/HTTPS sessions.\r\nConfigure the device with Cisco IOS Firewall Authentication Proxy feature for HTTP and/or HTTPS sessions and allow the Telnet and FTP services within the per-user TACACS+/RADIUS profile. Disable Authentication proxy for Telnet/FTP sessions to eliminate exposure. An example of the configuration statements for HTTP session Auth-proxy is:\r\n! Configure auth-proxy for http session authentication\nip auth-proxy name http-proxy http ! Configure the router's web server to service auth-proxy authentication attempts ip http server ! Set the HTTP server authentication method to AAA ip http authentication aaa\r\n    Additional auth-proxy and web server configuration settings are available. For details see http://www.cisco.com/univercd/cc/td/doc/product/software/ios120/120newft/120t/120t5/iosfw2/iosfw2_1.htm [\"/en/US/docs/ios/12_0t/12_0t5/feature/guide/iosfw2_1.html\"]\r\nAfter successful authentication via HTTP/HTTPS, the user can initiate required FTP or Telnet sessions. The example shown below for Cisco Secure Windows (TACACS+) server profile Group setting allows FTP and Telnet as part of access-list entry proxyacl#2=permit tcp any any\r\npriv-lvl=15\nproxyacl#1=permit icmp any any proxyacl#2=permit tcp any any proxyacl#3=permit udp any any\r\n\r\n    Mitigations\r\n Not all of the mitigation strategies listed will work for all  customers. Some of the workarounds listed are dependent on which versions and  feature-sets of IOS you have in your network. These mitigation strategies, may  help reduce exposure to this vulnerability. To eliminate exposure to this  vulnerability, customers should apply one of the workarounds listed above, or  upgrade to a fixed release of Cisco IOS.\r\n\r\n   Access Control Lists (ACLs)\r\nDeploying IP access-lists can mitigate the effects of this vulnerability by allowing Firewall Authentication Proxy access only from trusted subnets. This feature must be used in conjunction with interface access-lists to ensure that IP traffic from un-trusted subnets is dropped by the router and not forwarded around the auth-proxy feature. Once the IP access-list is created, it is applied to the Authentication proxy by adding the keyword list followed by the IP access-list name or number. In the example below the trusted network is 169.160.160.0/24 and the auth-proxy router interface is 10.66.65.47. Example:\r\n! Permit trusted network 169.160.160.0/24 to access auth-proxy\naccess-list 105 permit tcp 169.160.160.0 0.0.0.255 any eq telnet ! ! Deny all IP traffic that is not authenticated by auth-proxy ! Note: Management and Control traffic to the router itself would  !       need to be allowed in this access-list access-list 106 deny ip any any ! ! Modify the telnet auth-proxy config to use access-list 105 ip auth-proxy name tel-proxy telnet inactivity-time 60 list 105 ! ! Apply interface access-list 106 and auth-proxy test interface FastEthernet1/0 ip address 10.66.65.47 255.255.255.0 ip access-group 106 in ip auth-proxy tel-proxy\r\n    For further information on creating IP access lists, refer to Protecting Your Core: Infrastructure Protection Access Control Lists, at http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml\"], and Transit Access Control Lists: Filtering at Your Edge, at http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml\"].\r\n\r\n   Control Plane Policing\r\nThe Control Plane Policy (CoPP) feature can be used to mitigate the effects of this vulnerability by only allowing trusted hosts to attempt connections through the auth-proxy router.\r\nCare must be taken to ensure that legitimate management connections to the auth-proxy router itself are not dropped by the CoPP policy.\r\nIn the following example trusted management host 169.160.160.1 is allowed to establish Telnet connections to the auth-proxy router itself.\r\nTrusted network 169.160.160.0/24 is allowed to attempt FTP and Telnet auth-proxy connections to IP networks and addresses other than the auth-proxy router itself. All other inbound FTP and Telnet connections attempts are denied.\r\nThe auth-proxy router's IP addresses are 172.16.1.1 (Internet Side), 1.1.1.1/24 and 10.66.65.47 (Internal).\r\nTelnet/FTP server is 172.168.1.1.\r\n! Do not police Telnet from trusted management host 169.160.160.1 to the auth-proxy router\naccess-list 105 remark ** Do not police telnet from Trusted Hosts to Auth-Proxy Router ** access-list 105 deny tcp host 169.160.160.1 host 172.16.1.1 eq telnet access-list 105 deny tcp host 172.168.1.1 host 1.1.1.1 eq telnet access-list 105 deny tcp host 172.168.1.1 host 10.66.65.47 eq telnet ! ! Police all other telnet and ftp connections to the auth-proxy router access-list 105 remark ** Police all other telnet/ftp attempts to Auth-Proxy Router ** access-list 105 permit tcp any host 172.16.1.1 eq telnet access-list 105 permit tcp any host 1.1.1.1 eq telnet access-list 105 permit tcp any host 10.66.65.47 eq telnet access-list 105 permit tcp any host 172.16.1.1 eq ftp access-list 105 permit tcp any host 1.1.1.1 eq ftp access-list 105 permit tcp any host 10.66.65.47 eq ftp ! ! Allow telnet and ftp auth-proxy for trusted network 169.160.160.0/24 access-list 105 remark ** Allow Auth-Proxy sessions from trusted networks ** access-list 105 deny tcp 169.160.160.0 0.0.0.255 any eq telnet access-list 105 deny tcp 169.160.160.0 0.0.0.255 any eq ftp ! ! Allow telnet and ftp auth-proxy for trusted network back to 169.160.160.0/24 access-list 105 remark ** Allow Auth-Proxy sessions to trusted networks ** access-list 105 deny tcp host 172.168.1.1 169.160.160.0 0.0.0.255  ! ! Allow TACACS+ from ACS server 10.66.79.229 access-list 105 remark ** Ensure we can still communicate with TACACS+ Server ** access-list 105 deny tcp host 10.66.79.229 gt 1023 host 10.66.65.47 eq 49 access-list 105 deny tcp host 10.66.79.229 eq 49 host 10.66.65.47 gt 1023 ! ! Police all TCP based management traffic from un-trusted hosts ! Note: If BGP is configured it would need to be allowed before this access-list entry  access-list 105 remark ** Drop any other TCP connections ** access-list 105 permit tcp any any ! ! Do not police any other type of traffic going to the router access-list 105 remark ** Rest do not police ** access-list 105 deny ip any any ! class-map match-all only-allow-trusted-hosts match access-group 105 ! policy-map control-plane-policy ! Drop all traffic that matches the class \"only-allow-trusted-hosts\"  class only-allow-trusted-hosts   drop ! control-plane  service-policy input control-plane-policy\r\n\r\n Note: CoPP is available only in IOS release trains 12.0S, 12.2S and   12.3T. Additional information on the configuration and use of the CoPP feature   can be found at the following URL:   http://www.cisco.com/en/US/products/sw/iosswrel/ps5207/prod_white_papers_list.html [\"http://www.cisco.com/en/US/products/sw/iosswrel/ps5207/prod_white_papers_list.html\"]\r\n\r\n   Transit Access Control Lists\r\nAdditional mitigation can be added by Transit Access Control Lists that filter transit and edge traffic at network ingress points should be configured so that IP traffic is only allowed from legitimate, trusted IP addresses. For more information on tACLs, refer to:\r\nhttp://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml\"]",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, please also consult  http://www.cisco.com/en/US/products/products_security_advisories_listing.html [\"http://www.cisco.com/en/US/products/products_security_advisories_listing.html\"]  and any subsequent advisories to determine exposure and a complete upgrade  solution.\r\n\r\nIn all cases, customers should exercise caution to be certain the  devices to be upgraded contain sufficient memory and that current hardware and  software configurations will continue to be supported properly by the new  release. If the information is not clear, contact the Cisco Technical  Assistance Center (\"TAC\") for assistance.\r\n\r\nEach row of the Cisco IOS software table (below) describes a release  train and the platforms or products for which it is intended. If a given  release train is vulnerable, then the earliest possible releases that contain  the fix (the \"First Fixed Release\") and the anticipated date of availability  for each are listed in the \"Rebuild\" and \"Maintenance\" columns. A device  running a release in the given train that is earlier than the release in a  specific column (less than the First Fixed Release) is known to be vulnerable.  The release should be upgraded at least to the indicated release or a later  version (greater than or equal to the First Fixed Release label).\r\n\r\nFor further information on the terms \"Rebuild\" and \"Maintenance\",  please consult the following URL:  http://www.cisco.com/warp/public/620/1.html [\"http://www.cisco.com/warp/public/620/1.html\"].\r\n\r\nMajor Release\r\n\r\nAvailability of Repaired Releases\r\n\r\n Affected 12.2-Based Release\r\n\r\n Rebuild\r\n\r\n Maintenance\r\n\r\n12.2SG\r\n\r\nVulnerable; contact TAC\r\n\r\n12.2SEC\r\n\r\nVulnerable; contact TAC\r\n\r\n12.2SXF\r\n\r\nVulnerable; contact TAC\r\n\r\n12.2SH\r\n\r\nVulnerable; 12.2(13)ZH8, available 25-Oct-05\r\n\r\n12.2ZF\r\n\r\nVulnerable; migrate to 12.3T or later\r\n\r\n12.2ZL\r\n\r\nVulnerable; migrate to 12.3(4)XK4 or later for Cisco 17xx;  migrate to 12.4(1) or later for Cisco 3200; migrate to 12.3(7)XR4 or later for  ICS7750.\r\n\r\n Affected 12.3-Based Release\r\n\r\n Rebuild\r\n\r\n Maintenance\r\n\r\n12.3\r\n\r\n12.3(3h)\r\n\r\n12.3(5e)\r\n\r\n12.3(6e)\r\n\r\n12.3(9d)\r\n\r\n12.3(10d)\r\n\r\n12.3(12b)\r\n\r\n12.3(13a)\r\n\r\n12.3(15)\r\n\r\n12.3B\r\n\r\nVulnerable; migrate to 12.3(14)T2 or later\r\n\r\n12.3BC\r\n\r\n12.3(9a)BC7; available 19-Sept-05\r\n\r\n12.3BW\r\n\r\nVulnerable; migrate to 12.3(14)T2 or later\r\n\r\n12.3JA\r\n\r\n12.3(7)JA\r\n\r\n12.3JK\r\n\r\n12.3(2)JK\r\n\r\n12.3T\r\n\r\n12.3(7)T10\r\n\r\n12.3(8)T9\r\n\r\n12.3(11)T6\r\n\r\n12.3(14)T2\r\n\r\n12.3XA\r\n\r\n12.3(2)XA5; available TBD\r\n\r\n12.3XB\r\n\r\n Vulnerable; migrate to 12.3(14)T2 or later\r\n\r\n12.3XC\r\n\r\n12.3(2)XC3\r\n\r\n12.3XD\r\n\r\n Vulnerable; migrate to 12.3(14)T2 or later\r\n\r\n12.3XE\r\n\r\n12.3(2)XE4; available TBD\r\n\r\n12.3XF\r\n\r\n Vulnerable; migrate to 12.3(14)T2 or later\r\n\r\n12.3XG\r\n\r\n12.3(4)XG5; available TBD\r\n\r\n12.3XH\r\n\r\n Vulnerable; migrate to 12.3(14)T2 or later\r\n\r\n12.3XI\r\n\r\n12.3(7)XI4\r\n\r\n12.3XJ\r\n\r\n Vulnerable; migrate to 12.3(11)YF2 or later\r\n\r\n12.3XK\r\n\r\n 12.3(4)XK4; available TBD\r\n\r\n12.3XL\r\n\r\n12.3(11)XL3\r\n\r\n12.3XM\r\n\r\n Vulnerable; migrate to 12.3(14)T2 or later\r\n\r\n12.3XQ\r\n\r\n Vulnerable; migrate to 12.4(1) or later\r\n\r\n12.3XR\r\n\r\n12.3(7)XR4\r\n\r\n12.3XS\r\n\r\n Vulnerable; migrate to 12.4(1) or later\r\n\r\n12.3XU\r\n\r\nVulnerable; contact TAC\r\n\r\n12.3XW\r\n\r\n Vulnerable; migrate to 12.3(11)YF2 or later\r\n\r\n12.3XY\r\n\r\nVulnerable; contact TAC\r\n\r\n12.3YA\r\n\r\nVulnerable; migrate to 12.4(1) or later for Cisco 828; migrate to  12.3(8)YG2 or later for SOHO 9x, Cisco 83x\r\n\r\n12.3YD\r\n\r\n Vulnerable; migrate to 12.3(14)T2 or later\r\n\r\n12.3YF\r\n\r\n12.3(11)YF2\r\n\r\n12.3YG\r\n\r\n12.3(8)YG2\r\n\r\n12.3YI\r\n\r\n12.3(8)YI1\r\n\r\n12.3YJ\r\n\r\nVulnerable; contact TAC\r\n\r\n12.3YK\r\n\r\n12.3(11)YK1\r\n\r\n12.3YQ\r\n\r\n12.3(14)YQ\r\n\r\n12.3YS\r\n\r\n12.3(11)YS\r\n\r\n12.3YT\r\n\r\n12.3(14)YT\r\n\r\n12.3YU\r\n\r\n12.3(14)YU\r\n\r\n12.3YW\r\n\r\n12.3(11)YW\r\n\r\n Affected 12.4-Based Release\r\n\r\n Rebuild\r\n\r\n Maintenance\r\n\r\n12.4\r\n\r\n12.4(1)\r\n\r\n12.4MR\r\n\r\n12.4(2)MR\r\n\r\n12.4T\r\n\r\n12.4(2)T",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "Since the initial posting of this document, the Cisco PSIRT has been  made aware of public announcements of the vulnerabilities described in this  advisory. Cisco PSIRT is aware that the exploit for this vulnerability has been  published on a public mailing list.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS Firewall Authentication Proxy for FTP and Telnet Sessions Buffer Overflow",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20050907-auth_proxy"
			}
		],
		"title": "Cisco IOS Firewall Authentication Proxy for FTP and Telnet Sessions Buffer Overflow",
		"tracking": {
			"current_release_date": "2005-09-07T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:05:31+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20050907-auth_proxy",
			"initial_release_date": "2005-09-07T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2005-09-07T16:00:00+00:00",
					"number": "1.3.0",
					"summary": "Updated Exploitation and Public\n\t\t\t Announcements section and all 12.2 references in\n\t\t\t Affected Products."
				}
			],
			"status": "final",
			"version": "1.3.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"cve": "CVE-2005-2841",
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Cisco IOS Firewall Authentication Proxy for FTP and Telnet Sessions Buffer Overflow",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20050907-auth_proxy"
				}
			],
			"remediations": [
				{
					"category": "workaround",
					"details": "The effectiveness of any workaround is dependent on specific customer  situations such as product mix, network topology, traffic behavior, and  organizational mission. Due to the variety of affected products and releases,  customers should consult with their service provider or support organization to  ensure any applied workaround is the most appropriate for use in the intended  network before it is deployed.\r\n\r\n   Disable Cisco IOS Firewall Authentication Proxy feature for Telnet/FTP sessions.\r\nIn networks where Cisco IOS Firewall Authentication Proxy feature for Telnet/FTP sessions is not required but enabled, disabling the feature on an IOS device will eliminate exposure to this vulnerability. On a router which is configured for Cisco IOS Firewall Authentication Proxy feature for Telnet/FTP sessions, this must be done by issuing the command:\r\nno ip auth-proxy name 'auth-proxy-name' {ftp | telnet}\r\n\r\n   Deploy Cisco IOS Firewall Authentication Proxy feature for HTTP/HTTPS sessions.\r\nConfigure the device with Cisco IOS Firewall Authentication Proxy feature for HTTP and/or HTTPS sessions and allow the Telnet and FTP services within the per-user TACACS+/RADIUS profile. Disable Authentication proxy for Telnet/FTP sessions to eliminate exposure. An example of the configuration statements for HTTP session Auth-proxy is:\r\n! Configure auth-proxy for http session authentication\nip auth-proxy name http-proxy http ! Configure the router's web server to service auth-proxy authentication attempts ip http server ! Set the HTTP server authentication method to AAA ip http authentication aaa\r\n    Additional auth-proxy and web server configuration settings are available. For details see http://www.cisco.com/univercd/cc/td/doc/product/software/ios120/120newft/120t/120t5/iosfw2/iosfw2_1.htm [\"/en/US/docs/ios/12_0t/12_0t5/feature/guide/iosfw2_1.html\"]\r\nAfter successful authentication via HTTP/HTTPS, the user can initiate required FTP or Telnet sessions. The example shown below for Cisco Secure Windows (TACACS+) server profile Group setting allows FTP and Telnet as part of access-list entry proxyacl#2=permit tcp any any\r\npriv-lvl=15\nproxyacl#1=permit icmp any any proxyacl#2=permit tcp any any proxyacl#3=permit udp any any\r\n\r\n    Mitigations\r\n Not all of the mitigation strategies listed will work for all  customers. Some of the workarounds listed are dependent on which versions and  feature-sets of IOS you have in your network. These mitigation strategies, may  help reduce exposure to this vulnerability. To eliminate exposure to this  vulnerability, customers should apply one of the workarounds listed above, or  upgrade to a fixed release of Cisco IOS.\r\n\r\n   Access Control Lists (ACLs)\r\nDeploying IP access-lists can mitigate the effects of this vulnerability by allowing Firewall Authentication Proxy access only from trusted subnets. This feature must be used in conjunction with interface access-lists to ensure that IP traffic from un-trusted subnets is dropped by the router and not forwarded around the auth-proxy feature. Once the IP access-list is created, it is applied to the Authentication proxy by adding the keyword list followed by the IP access-list name or number. In the example below the trusted network is 169.160.160.0/24 and the auth-proxy router interface is 10.66.65.47. Example:\r\n! Permit trusted network 169.160.160.0/24 to access auth-proxy\naccess-list 105 permit tcp 169.160.160.0 0.0.0.255 any eq telnet ! ! Deny all IP traffic that is not authenticated by auth-proxy ! Note: Management and Control traffic to the router itself would  !       need to be allowed in this access-list access-list 106 deny ip any any ! ! Modify the telnet auth-proxy config to use access-list 105 ip auth-proxy name tel-proxy telnet inactivity-time 60 list 105 ! ! Apply interface access-list 106 and auth-proxy test interface FastEthernet1/0 ip address 10.66.65.47 255.255.255.0 ip access-group 106 in ip auth-proxy tel-proxy\r\n    For further information on creating IP access lists, refer to Protecting Your Core: Infrastructure Protection Access Control Lists, at http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml\"], and Transit Access Control Lists: Filtering at Your Edge, at http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml\"].\r\n\r\n   Control Plane Policing\r\nThe Control Plane Policy (CoPP) feature can be used to mitigate the effects of this vulnerability by only allowing trusted hosts to attempt connections through the auth-proxy router.\r\nCare must be taken to ensure that legitimate management connections to the auth-proxy router itself are not dropped by the CoPP policy.\r\nIn the following example trusted management host 169.160.160.1 is allowed to establish Telnet connections to the auth-proxy router itself.\r\nTrusted network 169.160.160.0/24 is allowed to attempt FTP and Telnet auth-proxy connections to IP networks and addresses other than the auth-proxy router itself. All other inbound FTP and Telnet connections attempts are denied.\r\nThe auth-proxy router's IP addresses are 172.16.1.1 (Internet Side), 1.1.1.1/24 and 10.66.65.47 (Internal).\r\nTelnet/FTP server is 172.168.1.1.\r\n! Do not police Telnet from trusted management host 169.160.160.1 to the auth-proxy router\naccess-list 105 remark ** Do not police telnet from Trusted Hosts to Auth-Proxy Router ** access-list 105 deny tcp host 169.160.160.1 host 172.16.1.1 eq telnet access-list 105 deny tcp host 172.168.1.1 host 1.1.1.1 eq telnet access-list 105 deny tcp host 172.168.1.1 host 10.66.65.47 eq telnet ! ! Police all other telnet and ftp connections to the auth-proxy router access-list 105 remark ** Police all other telnet/ftp attempts to Auth-Proxy Router ** access-list 105 permit tcp any host 172.16.1.1 eq telnet access-list 105 permit tcp any host 1.1.1.1 eq telnet access-list 105 permit tcp any host 10.66.65.47 eq telnet access-list 105 permit tcp any host 172.16.1.1 eq ftp access-list 105 permit tcp any host 1.1.1.1 eq ftp access-list 105 permit tcp any host 10.66.65.47 eq ftp ! ! Allow telnet and ftp auth-proxy for trusted network 169.160.160.0/24 access-list 105 remark ** Allow Auth-Proxy sessions from trusted networks ** access-list 105 deny tcp 169.160.160.0 0.0.0.255 any eq telnet access-list 105 deny tcp 169.160.160.0 0.0.0.255 any eq ftp ! ! Allow telnet and ftp auth-proxy for trusted network back to 169.160.160.0/24 access-list 105 remark ** Allow Auth-Proxy sessions to trusted networks ** access-list 105 deny tcp host 172.168.1.1 169.160.160.0 0.0.0.255  ! ! Allow TACACS+ from ACS server 10.66.79.229 access-list 105 remark ** Ensure we can still communicate with TACACS+ Server ** access-list 105 deny tcp host 10.66.79.229 gt 1023 host 10.66.65.47 eq 49 access-list 105 deny tcp host 10.66.79.229 eq 49 host 10.66.65.47 gt 1023 ! ! Police all TCP based management traffic from un-trusted hosts ! Note: If BGP is configured it would need to be allowed before this access-list entry  access-list 105 remark ** Drop any other TCP connections ** access-list 105 permit tcp any any ! ! Do not police any other type of traffic going to the router access-list 105 remark ** Rest do not police ** access-list 105 deny ip any any ! class-map match-all only-allow-trusted-hosts match access-group 105 ! policy-map control-plane-policy ! Drop all traffic that matches the class \"only-allow-trusted-hosts\"  class only-allow-trusted-hosts   drop ! control-plane  service-policy input control-plane-policy\r\n\r\n Note: CoPP is available only in IOS release trains 12.0S, 12.2S and   12.3T. Additional information on the configuration and use of the CoPP feature   can be found at the following URL:   http://www.cisco.com/en/US/products/sw/iosswrel/ps5207/prod_white_papers_list.html [\"http://www.cisco.com/en/US/products/sw/iosswrel/ps5207/prod_white_papers_list.html\"]\r\n\r\n   Transit Access Control Lists\r\nAdditional mitigation can be added by Transit Access Control Lists that filter transit and edge traffic at network ingress points should be configured so that IP traffic is only allowed from legitimate, trusted IP addresses. For more information on tACLs, refer to:\r\nhttp://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml\"]"
				}
			],
			"title": "Cisco IOS Firewall Authentication Proxy for FTP and Telnet Sessions Buffer Overflow"
		}
	]
}
