{
	"document": {
		"category": "csaf_informational_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "On September 27, 2023, the U.S. National Security Agency (NSA), the U.S. Federal Bureau of Investigation (FBI), the U.S. Cybersecurity and Infrastructure Security Agency (CISA), the Japan National Police Agency (NPA), and the Japan National Center of Incident Readiness and Strategy for Cybersecurity (NISC) released a joint cybersecurity advisory (CSA) detailing activities of the cyber actors known as BlackTech.\r\n\r\nFor a description of this report, see People's Republic of China-Linked Cyber Actors Hide in Router Firmware [\"https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-270a\"].\r\n\r\nCisco has reviewed the report. Cisco would like to highlight the following key facts:\r\n    The most prevalent initial access vector in these attacks involves stolen or weak administrative credentials. As outlined in the report, certain configuration changes, such as disabling logging and downloading firmware, require administrative credentials.  There is no indication that any Cisco vulnerabilities were exploited. Attackers used compromised credentials to perform administrative-level configuration and software changes.  Modern Cisco devices include secure boot capabilities, which do not allow the loading and executing of modified software images. For more information on secure boot, see the Cisco Trustworthy Technologies Data Sheet [\"https://www.cisco.com/c/dam/en_us/about/doing_business/trust-center/docs/trustworthy-technologies-datasheet.pdf\"].\r\nThe stolen code-signing certificates mentioned in the report are not from Cisco. Cisco does not have any knowledge of code-signing certificates being stolen to perform any attack against Cisco infrastructure devices.\r\n\r\nThese key points align with the Cisco consistent stance and messaging that advises customers to follow best practices as described in the Cisco blog post: Attackers Continue to Target Legacy Devices [\"https://community.cisco.com/t5/security-blogs/attackers-continue-to-target-legacy-devices/ba-p/4169954\"].\r\n\r\nModern network infrastructure devices now contain numerous security features and capabilities that mitigate the aforementioned attacks. The Cisco Secure Development Lifecycle (SDL) applies industry-leading practices and technology to build trustworthy solutions that have fewer field-discovered product security incidents. As part of our ongoing commitment to network reliability, Cisco has recently launched an effort focused on network resiliency. For more information on this effort, see the Cisco Network Resilience [\"https://www.cisco.com/c/en/us/about/trust-center/network-resilience.html\"] portal.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Reports about Cyber Actors Hiding in Router Firmware",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-csa-cyber-report-sept-2023"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "People's Republic of China-Linked Cyber Actors Hide in Router Firmware",
				"url": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-270a"
			},
			{
				"category": "external",
				"summary": "Cisco Trustworthy Technologies Data Sheet",
				"url": "https://www.cisco.com/c/dam/en_us/about/doing_business/trust-center/docs/trustworthy-technologies-datasheet.pdf"
			},
			{
				"category": "external",
				"summary": "Attackers Continue to Target Legacy Devices",
				"url": "https://community.cisco.com/t5/security-blogs/attackers-continue-to-target-legacy-devices/ba-p/4169954"
			},
			{
				"category": "external",
				"summary": "Cisco Network Resilience",
				"url": "https://www.cisco.com/c/en/us/about/trust-center/network-resilience.html"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html"
			}
		],
		"title": "Reports about Cyber Actors Hiding in Router Firmware",
		"tracking": {
			"current_release_date": "2023-09-27T18:19:37+00:00",
			"generator": {
				"date": "2023-09-27T18:19:37+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-csa-cyber-report-sept-2023",
			"initial_release_date": "2023-09-27T13:50:00+00:00",
			"revision_history": [
				{
					"date": "2023-09-27T13:25:32+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2023-09-27T14:06:49+00:00",
					"number": "1.1.0",
					"summary": "Adjusted formatting."
				},
				{
					"date": "2023-09-27T18:19:37+00:00",
					"number": "1.2.0",
					"summary": "Added clarifications."
				}
			],
			"status": "final",
			"version": "1.2.0"
		}
	},
	"product_tree": {}
}
