{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found by Logan Sanderson of Cisco during internal security testing."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the Connectivity Fault Management (CFM) feature of Cisco IOS XR Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r\nThis vulnerability is due to incorrect processing of invalid continuity check messages (CCMs). An attacker could exploit this vulnerability by sending crafted CCMs to an affected device. A successful exploit could allow the attacker to cause the CFM service to crash when a user displays information about maintenance end points (MEPs) for peer MEPs on an affected device.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\n\r\n\r\nThis advisory is part of the September 2023 release of the Cisco IOS XR Software Security Advisory Bundled Publication. For a complete list of the advisories and links to them, see Cisco Event Response: September 2023 Semiannual Cisco IOS XR Software Security Advisory Bundled Publication [\"https://sec.cloudapps.cisco.com/security/center/viewErp.x?alertId=ERP-75241\"].",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "At the time of publication, this vulnerability affected Cisco products if they were running a vulnerable release of Cisco IOS-XR Software and had the CFM feature enabled. CFM is not enabled by default in Cisco IOS XR Software.\r\n\r\nFor information about which Cisco software releases were vulnerable at the time of publication, see the Fixed Software [\"#fs\"] section of this advisory. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.\r\n\r\nDetermine the Device Configuration\r\n\r\nTo exploit the vulnerability in CFM, the ethernet cfm command must be configured globally and an interface on the device must have the mep command.\r\n\r\nTo determine whether the CFM service is enabled, log in to the device and run the show running-config ethernet cfm command in the CLI. If the ethernet cfm command is present in the global configuration, the CFM service is enabled on the device.\r\n\r\nThe following example shows the output of the show running-config ethernet cfm command for a device that has the CFM service enabled:\r\n\r\n\r\nRP/0/RSP0/CPU0:ios#show running-config ethernet cfm\r\n\r\nethernet cfm\r\ndomain TestDomain level 7 id string TestDomain\r\nservice TestService down-meps\r\ncontinuity-check interval 1s\r\nmep crosscheck\r\nmep-id 702 mac-address 1070.fdf8.5555\r\n\r\nTo determine if the mep command is configured on any interface of the device, use the show running-config | begin mep domain command. The following example shows the output of the show running-config | begin mep domain command for a device that has the mep command configured on an interface:\r\n\r\n\r\nRP/0/RSP0/CPU0:ios#show running-config | begin mep domain\r\n       mep domain TestDomain service TestService mep-id 701",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect the following Cisco products:\r\n\r\nIOS Software\r\nIOS XE Software\r\nNX-OS Software",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "A successful exploit could allow the attacker to cause the CFM service to crash when a user displays information. This crash would cause the CFM service to restart. Causing the CFM service to crash multiple times may delay restart by up to five minutes. Some CFM packets may be lost while the service is down.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n      Fixed Releases\r\nAt the time of publication, the release information in the following table was accurate. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.\r\n\r\nThe left column lists Cisco software releases, and the right column indicates whether a release was affected by the vulnerability described in this advisory and which release included the fix for the vulnerability.\r\n          Cisco IOS XR Software Release  First Fixed Release          7.4 and earlier  Migrate to a fixed release.      7.5  7.5.4      7.6  7.6.3      7.7  7.7.21      7.8  7.8.2      7.9  7.9.1\r\nThe Cisco Product Security Incident Response Team (PSIRT) validates only the affected and fixed release information that is documented in this advisory.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found by Logan Sanderson of Cisco during internal security testing.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS XR Software Connectivity Fault Management Denial of Service Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ios-xr-cfm-3pWN8MKt"
			},
			{
				"category": "external",
				"summary": "Cisco Event Response: September 2023 Semiannual Cisco IOS XR Software Security Advisory Bundled Publication",
				"url": "https://sec.cloudapps.cisco.com/security/center/viewErp.x?alertId=ERP-75241"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco IOS XR Software Connectivity Fault Management Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2023-09-13T16:00:00+00:00",
			"generator": {
				"date": "2024-05-10T23:26:27+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-ios-xr-cfm-3pWN8MKt",
			"initial_release_date": "2023-09-13T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2023-09-13T15:47:29+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco IOS XR Software",
						"product": {
							"name": "Cisco IOS XR Software ",
							"product_id": "CSAFPID-5834"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2023-20233",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCwd75868"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-5834"
				]
			},
			"release_date": "2023-09-13T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-5834"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 4.3,
						"baseSeverity": "MEDIUM",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-5834"
					]
				}
			],
			"title": "Cisco IOS XR for ASR 9000 Series Routers Software CFM Denial of Service Vulnerability"
		}
	]
}
