{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Cisco Unified Communications Domain Manager (Cisco Unified CDM) is affected by the following vulnerabilities:\n\r\n\r\n    Cisco Unified Communications Domain Manager Privilege Escalation Vulnerability\r\n    Cisco Unified Communications Domain Manager Default SSH Key Vulnerability \r\n    Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability \r\n\r\nSuccessful exploitation of the Cisco Unified Communications Domain Manager Privilege Escalation Vulnerability or of the Cisco Unified Communications Domain Manager Default SSH Key Vulnerability may allow an attacker\r\nto execute arbitrary commands or obtain privileged access to the affected system.\r\n\r\nSuccessful exploitation of the Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability may allow an attacker to access and modify BVSMWeb portal user information\r\nsuch settings in the personal phone directory, speed dials, Single Number Reach, and\r\ncall forward settings.\n\r\n\n\r\nCisco has released free software updates that address the Cisco Unified Communications Domain Manager Privilege Escalation Vulnerability and the\r\nCisco Unified Communications Domain Manager Default SSH Key Vulnerability. \n\r\nCisco will provide a free software update for the Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability as soon as the fix is available.\n\r\n\n\r\nWorkarounds that mitigate these vulnerabilities are not available. Customers that are concerned about the Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability may apply the\r\nmitigation detailed in the \"Workarounds\" section of this advisory. \n\r\n\n\r\nNote: Due to an error in the fix of the Cisco Unified Communications Domain Manager Default SSH Key Vulnerability, all Cisco Unified CDM Platform Software releases are\r\nvulnerable regardless if a previous patch has been applied due to this security advisory. This advisory has been updated to provide additional information about the fix for the Cisco Unified Communications Domain Manager Default SSH Key Vulnerability.\n\r\n\n\r\n\n\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20140702-cucdm[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20140702-cucdm\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco Unified Communications Domain Manager Privilege Escalation Vulnerability\n\r\n\n\r\nThis vulnerability affects all Cisco Unified CDM Application Software versions prior to 8.1.4.\n\r\n\n\r\nCisco Unified Communications Domain Manager Default SSH Key Vulnerability\n\r\n\n\r\nThis vulnerability affects all Cisco Unified CDM Platform Software that do not have the \"ssh_keys_cleanup\" hotfix patch installed.\n\r\n\n\r\nNote: Due to an error in the fix, all Cisco Unified CDM Platform Software releases are\r\nvulnerable regardless if a previous patch has been applied due to this security advisory. Customers\r\nrunning any Cisco Unified CDM Platform Software release should\r\nrequest the hotfix patch called \"ssh_keys_cleanup\" through the normal support\r\nchannel. The hotfix addresses only the Cisco Unified Communications Domain Manager Default SSH Key Vulnerability.\n\r\n\n\r\n\n\r\nCisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability\n\r\n\n\r\nThis vulnerability affects all Cisco Unified CDM Application Software versions prior to 10\n\r\nDetermining the Running Software Version\r\nThe software version for both Cisco Unified CDM Application Software and Platform Software can be determined by accessing the Administration GUI and navigating the About menu options on the top left corner of the page.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco Unified Communications Manager (Cisco Unified CM) is not affected by these vulnerabilities.\n\r\n\n\r\nNo other Cisco products are currently known to be affected by these vulnerabilities.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco Unified Communications Domain Manager (Cisco Unified CDM) is a service delivery and management platform that\r\nprovides automation and administrative functions over the Cisco Unified\r\nCommunications Manager, Cisco Unity Connection, and Cisco Jabber\r\napplications, as well as the associated phones and soft clients. \n\r\n\n\r\nCUCDM is part of Cisco Hosted Collaboration System (HCS). The Cisco Unified CDM solution includes an Application Software and a Platform Software.\n\r\n\n\r\nCisco Unified Communications Domain Manager Privilege Escalation Vulnerability\n\r\n\n\r\nA vulnerability in the web framework of the\r\nCisco Unified Communications Domain Manager Application Software could allow an\r\nauthenticated, remote attacker to elevate privileges and gain\r\nadministrative access to the affected system.\n\r\n\n\r\nThe vulnerability\r\nis due to improper implementation of authentication and authorization\r\ncontrols of the Administration GUI. An attacker could exploit this\r\nvulnerability by submitting a crafted URL to change the administrative credentials of a user.\r\nThe attacker needs to be authenticated to the system or convince a valid user of the Administration GUI to click a\r\nmalicious link.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCun49862[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCun49862\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned Common Vulnerabilities and Exposures (CVE) identifier CVE-2014-2197.\n\r\n\n\r\nCisco Unified Communications Domain Manager Default SSH Key Vulnerability\n\r\n\n\r\nA vulnerability in the implementation of the framework that allows access to\r\nsupport representatives of the Cisco\r\nUnified Communications Domain Manager Platform Software could allow an unauthenticated,\r\nremote attacker to connect to the affected system with the privileges of\r\nthe root user.\n\r\n\n\r\nThe vulnerability is due to the presence of\r\na default SSH private key, which is stored in an insecure way on the system. An attacker could exploit this vulnerability by obtaining the SSH\r\nprivate key. For example, the attacker might reverse engineer the binary file of the operating system.\r\nThis will allow the attacker to connect by using the support account to the\r\nsystem without requiring any form of authentication. An exploit could allow the attacker to gain access to the system with the privileges of the root user.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCud41130[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCud41130\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned CVE ID CVE-2014-2198.\n\r\n\n\r\nNote: Due to an error in the fix, all Cisco Unified CDM Platform Software releases are\r\nvulnerable regardless if a previous patch has been applied due to this security advisory. Customers\r\nrunning any Cisco Unified CDM Platform Software release should\r\nrequest the hotfix patch called \"ssh_keys_cleanup\" through the normal support\r\nchannel. The hotfix addresses only the Cisco Unified Communications Domain Manager Default SSH Key Vulnerability.\n\r\nThe error in the fix is documented in Cisco bug ID CSCuq99452[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuq99452\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only).\n\r\n\n\r\n\n\r\nCisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability\n\r\n\n\r\nA vulnerability in the web framework of Cisco Unified Communications Domain Manager Application Software could allow an unauthenticated, remote attacker to access and modify BVSMWeb portal user information such as settings in the personal phone directory, speed dials, Single Number Reach, and call forward settings.\n\r\n\n\r\nThe vulnerability is due to improper implementation of authentication and authorization controls when accessing some web pages of the BVSMWeb portal. An attacker could exploit this vulnerability by submitting a crafted URL to the affected system.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCum77041[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCum77041\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned CVE ID CVE-2014-3300",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that mitigate the vulnerabilities in this security advisory.\n\r\n\n\r\nCustomers that are affected by the Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability should use the functionality offered by the Cisco Unified Communication Manager and the Cisco Unified CDM Self-Care portal instead of the Cisco Unified CDM BVSMWeb portal to provide services.\n\r\n\n\r\nAdditional mitigations that can be deployed on Cisco devices within the network are available in the Cisco Applied Intelligence companion document for this advisory: \n\r\nhttp://tools.cisco.com/security/center/viewAMBAlert.x?alertId=34689[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=34689\"]\n",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Notices archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCisco Unified Communications Domain Manager Privilege Escalation Vulnerability\n\r\n\n\r\nThe Cisco Unified Communications Domain Manager Privilege Escalation Vulnerability is resolved in Cisco Unified CDM Application Software usm-8.1.4-ubuntu10_04.tar.gz and later.\n\r\n\n\r\n\n\r\nCisco Unified Communications Domain Manager Default SSH Key Vulnerability\n\r\n\n\r\nThe Cisco Unified Communications Domain Manager Default SSH Key Vulnerability is resolved in Cisco Unified CDM Platform Software  hotfix patch called \"ssh_keys_cleanup\" .\n\r\n\n\r\nNote: Due to an error in the fix, all Cisco Unified CDM Platform Software releases are\r\nvulnerable regardless if a previous patch has been applied due to this security advisory. Customers\r\nrunning any Cisco Unified CDM Platform Software release should\r\nrequest the hotfix patch called \"ssh_keys_cleanup\" through the normal support\r\nchannel. The hotfix addresses only the Cisco Unified Communications Domain Manager Default SSH Key Vulnerability.\n\r\n\n\r\n\n\r\nCisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability\n\r\n\n\r\nCurrently, there is no Cisco Unified CDM version that addresses the Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability. Cisco Unified CDM Application Software version 10 and later does not implement the BVSMWeb service interface and it is not affected by this vulnerability. Cisco Unified CDM version 10 is expected to be available in September 2014. Customers that are concerned about this vulnerability should apply the mitigation detailed in the \"Workarounds\" section of this advisory until a fixed software release is available.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerabilities that are described in this advisory. \r\n\r\nThe Cisco Unified Communications Domain Manager Privilege Escalation Vulnerability and Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability were reported to Cisco by Fatih Ozavci from Sense of Security.\n\r\n\n\r\nThe Cisco Unified Communications Domain Manager Default SSH Key Vulnerability was found during the resolution of support cases.\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "external",
				"summary": "Identifying and Mitigating Exploitation of the Multiple Vulnerabilities in Cisco Unified Communications Domain Manager",
				"url": "http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=34689"
			},
			{
				"category": "self",
				"summary": "Multiple Vulnerabilities in Cisco Unified Communications Domain Manager",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20140702-cucdm"
			}
		],
		"title": "Multiple Vulnerabilities in Cisco Unified Communications Domain Manager",
		"tracking": {
			"current_release_date": "2014-10-13T15:55:00+00:00",
			"generator": {
				"date": "2022-07-15T00:24:34+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20140702-cucdm",
			"initial_release_date": "2014-07-02T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2014-07-02T15:35:37+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2014-07-08T21:14:32+00:00",
					"number": "2.0.0",
					"summary": "Added information regarding fixed versions of the Cisco Unified Communications Domain Manager Default SSH Key Vulnerability."
				},
				{
					"date": "2014-10-13T15:55:13+00:00",
					"number": "3.0.0",
					"summary": "Added important information regarding fixed versions of the Cisco Unified Communications Domain Manager Default SSH Key Vulnerability."
				}
			],
			"status": "final",
			"version": "3.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Unified Communications Domain Manager",
						"product": {
							"name": "Cisco Unified Communications Domain Manager ",
							"product_id": "CSAFPID-188989"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco Unified Communications Domain Manager Platform",
						"product": {
							"name": "Cisco Unified Communications Domain Manager Platform ",
							"product_id": "CSAFPID-201010"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2014-2197",
			"notes": [
				{
					"category": "other",
					"text": "CSCun49862",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-188989"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified Communications Domain Manager",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20140702-cucdm"
				}
			],
			"release_date": "2014-04-03T13:17:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that mitigate the vulnerabilities in this security advisory.\n\r\n\n\r\nCustomers that are affected by the Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability should use the functionality offered by the Cisco Unified Communication Manager and the Cisco Unified CDM Self-Care portal instead of the Cisco Unified CDM BVSMWeb portal to provide services.\n\r\n\n\r\nAdditional mitigations that can be deployed on Cisco devices within the network are available in the Cisco Applied Intelligence companion document for this advisory: \n\r\nhttp://tools.cisco.com/security/center/viewAMBAlert.x?alertId=34689[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=34689\"]\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 9,
						"vectorString": "AV:N/AC:L/Au:S/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-188989"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 9,
						"vectorString": "AV:N/AC:L/Au:S/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-188989"
					]
				}
			],
			"title": "Cisco Unified Communications Domain Manager Privilege Escalation Vulnerability"
		},
		{
			"cve": "CVE-2014-2198",
			"notes": [
				{
					"category": "other",
					"text": "CSCud41130",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-201010"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified Communications Domain Manager",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20140702-cucdm"
				}
			],
			"release_date": "2014-04-03T13:44:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that mitigate the vulnerabilities in this security advisory.\n\r\n\n\r\nCustomers that are affected by the Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability should use the functionality offered by the Cisco Unified Communication Manager and the Cisco Unified CDM Self-Care portal instead of the Cisco Unified CDM BVSMWeb portal to provide services.\n\r\n\n\r\nAdditional mitigations that can be deployed on Cisco devices within the network are available in the Cisco Applied Intelligence companion document for this advisory: \n\r\nhttp://tools.cisco.com/security/center/viewAMBAlert.x?alertId=34689[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=34689\"]\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 10,
						"vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C/E:H/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-201010"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 10,
						"vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C/E:H/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-201010"
					]
				}
			],
			"title": "Cisco Unified Communications Domain Manager Default SSH Key Vulnerability"
		},
		{
			"cve": "CVE-2014-3300",
			"notes": [
				{
					"category": "other",
					"text": "CSCum77041",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-188989"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified Communications Domain Manager",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20140702-cucdm"
				}
			],
			"release_date": "2014-07-02T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that mitigate the vulnerabilities in this security advisory.\n\r\n\n\r\nCustomers that are affected by the Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability should use the functionality offered by the Cisco Unified Communication Manager and the Cisco Unified CDM Self-Care portal instead of the Cisco Unified CDM BVSMWeb portal to provide services.\n\r\n\n\r\nAdditional mitigations that can be deployed on Cisco devices within the network are available in the Cisco Applied Intelligence companion document for this advisory: \n\r\nhttp://tools.cisco.com/security/center/viewAMBAlert.x?alertId=34689[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=34689\"]\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.5,
						"vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P/E:F/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-188989"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.5,
						"vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P/E:F/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-188989"
					]
				}
			],
			"title": "Cisco Unified Communications Domain Manager BVSMWeb Unauthorized Data Manipulation Vulnerability"
		}
	]
}
