{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the Session Initiation Protocol (SIP) implementation in Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause a reload of an affected device. To exploit this vulnerability, affected devices must be configured to process SIP messages. Limited Cisco IOS Software and Cisco IOS XE Software releases are affected.\n\r\n\n\r\nCisco has released software updates that address this vulnerability. \n\r\n\n\r\nThere are no workarounds for devices that must run SIP; however, mitigations are available to limit exposure to this vulnerability.\n\r\n\n\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20140326-sip[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20140326-sip\"]\n\r\n\n\r\nNote: The March 26, 2014, Cisco IOS Software Security Advisory bundled publication includes six Cisco Security Advisories. All advisories address vulnerabilities in Cisco IOS Software. Each Cisco IOS Software Security Advisory lists the Cisco IOS Software releases that correct the vulnerability or vulnerabilities detailed in the advisory as well as the Cisco IOS Software releases that correct all Cisco IOS Software vulnerabilities in the March 2014 bundled publication. \r\n\r\nIndividual publication links are in Cisco Event Response: Semiannual Cisco IOS Software Security Advisory Bundled Publication at the following link: \r\n\r\nhttp://www.cisco.com/web/about/security/intelligence/Cisco_ERP_mar14.html[\"http://www.cisco.com/web/about/security/intelligence/Cisco_ERP_mar14.html\"]\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco devices are affected when they are running affected Cisco IOS Software or Cisco IOS XE Software that are configured to process SIP messages. The following Cisco IOS Software and Cisco IOS XE Software releases are affected by this vulnerability:\r\n\r\n    Cisco IOS Software release 15.3(3)M and 15.3(3)M1\r\n    Cisco IOS XE Software release 3.10.0S, 3.10.0aS and 3.10.1S1\r\n\r\nRecent releases of Cisco IOS Software and Cisco IOS XE Software do not process SIP messages by default. Creating a dial peer by issuing the dial-peer voice configuration command will start the SIP processes, causing the Cisco IOS device to process SIP messages. In addition, several features within Cisco Unified Communications Manager Express, such as ePhones, will also automatically start the SIP process when they are configured, causing the device to start processing SIP messages. An example of an affected configuration follows:\r\n\r\n!\n\r\n dial-peer voice  voip\n\r\n …\n\r\n!\r\n\r\n\r\nIn addition to inspecting the Cisco IOS device configuration for a dial-peer command that causes the device to process SIP messages, administrators can also use the show processes | include SIP command to determine whether Cisco IOS Software is running the processes that handle SIP messages. In the following example, the presence of the process CCSIP_UDP_SOCKET or CCSIP_TCP_SOCKET indicates that the Cisco IOS device will process SIP messages:\r\n\r\nRouter# show processes | include SIP\r\n 149 Mwe 40F48254            4          1    400023108/24000  0 CCSIP_UDP_SOCKET\r\n 150 Mwe 40F48034            4          1    400023388/24000  0 CCSIP_TCP_SOCKET\r\n\r\nNote: Because there are several ways that a device running Cisco IOS Software or Cisco IOS XE Software can start processing SIP messages, it is recommended that the show processes | include SIP command be used to determine whether the device is processing SIP messages instead of relying on the presence of specific configuration commands.\n\r\n\n\r\nTo determine the Cisco IOS Software release that is running on a Cisco product, administrators can log in to the device and issue the show version command to display the system banner. The system banner confirms that the device is running Cisco IOS Software by displaying text similar to \"Cisco Internetwork Operating System Software\" or \"Cisco IOS Software.\" The image name displays in parentheses, followed by \"Version\" and the Cisco IOS Software release name. Other Cisco devices do not have the show version command or may provide different output.\r\n\r\nThe following example identifies a Cisco product that is running Cisco IOS Software Release 15.2(4)M5 with an installed image name of C3900-UNIVERSALK9-M:\r\n\r\n\r\nRouter> show version \nCisco IOS Software, C3900 Software (C3900-UNIVERSALK9-M), 15.2(4)M5, RELEASE SOFTWARE (fc2)\nTechnical Support: http://www.cisco.com/techsupport\nCopyright (c) 1986-2013 by Cisco Systems, Inc.\nCompiled Fri 13-Sep-13 16:44 by prod_rel_team\r\n!--- output truncated \r\n\r\nAdditional information about Cisco IOS Software release naming conventions is available in White Paper: Cisco IOS and NX-OS Software Reference Guide[\"http://www.cisco.com/web/about/security/intelligence/ios-ref.html\"]. \r\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco Unified Communications Manager is not affected by this vulnerability. No other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "SIP is a popular signaling protocol that is used to manage voice and video calls across IP networks such as the Internet. SIP is responsible for handling all aspects of call setup and termination. Voice and video are the most popular types of sessions that SIP handles, but the protocol has the flexibility to accommodate other applications that require call setup and termination. SIP call signaling can use UDP port 5060, TCP port 5060, or Transport Layer Security (TLS) on TCP port 5061 as the underlying transport protocol.\n\r\n\n\r\nA vulnerability in the SIP functionality of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to trigger a device reload.\n\r\n\n\r\nThe vulnerability is due to incorrect processing of specific SIP messages. An attacker could exploit this vulnerability by sending specific SIP messages, which may be considered well formed or crafted to the SIP gateway. An exploit could allow the attacker to trigger a device reload.\n\r\n\n\r\nThis vulnerability is triggered when a device that is running an affected version of Cisco IOS Software or Cisco IOS XE Software processes the specific type of SIP messages. Only traffic destined to the device can trigger the vulnerability; transit SIP traffic is not an exploit vector. This vulnerability can be exploited with SIP over IP version 4 (IPv4) or IP version 6 (IPv6) communications protocol.\n\r\n\n\r\nNote: In cases where SIP is running over TCP transport, a TCP three-way handshake is necessary to exploit this vulnerability.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCug45898[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCug45898\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only). This vulnerability has been assigned Common Vulnerabilities and Exposures (CVE) ID CVE-2014-2106",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "If the affected Cisco IOS device requires SIP for VoIP services, SIP cannot be disabled, and no workarounds are available. Users are advised to apply mitigation techniques to help limit exposure to the vulnerability. Mitigation consists of allowing only legitimate devices to connect to affected devices. To increase effectiveness, the mitigation must be coupled with anti-spoofing measures on the network edge. This action is required because SIP can use UDP as the transport protocol.\n\r\n\n\r\nAdditional mitigations that can be deployed on Cisco devices within the network are available in the companion document Identifying and Mitigating Exploitation of the Cisco IOS Software Session Initiation Protocol Denial of Service Vulnerability, which is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/viewAMBAlert.x?alertId=32537[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=32537\"]\r\nDisabling SIP Listening Ports\r\nFor devices that do not require SIP to be enabled, the simplest and most effective workaround is to disable SIP processing on the device. Some releases of Cisco IOS Software allow administrators to disable SIP with the following commands:\r\n\r\nsip-ua\n no transport udp\n no transport tcp\n no transport tcp tls\r\n\r\nWarning: When applying this workaround to devices that are processing Media Gateway Control Protocol (MGCP) or H.323 calls, the device will not stop SIP processing while active calls are being processed. Under these circumstances, this workaround should be implemented during a maintenance window when active calls can be stopped briefly.\n\r\n\n\r\nThe show udp connections, show tcp brief all, and show control-plane host open-ports commands can be used to confirm that the SIP UDP and TCP ports are closed after applying this workaround.\n\r\n\n\r\nDepending on the Cisco IOS Software release in use, when SIP is disabled the output from the show ip sockets command may still show the SIP ports open, but sending traffic to them will cause the SIP process to display the following message:\r\n\r\n*Nov 2 11:36:47.691: sip_udp_sock_process_read: SIP UDP Listener is DISABLED\r\n\r\nControl Plane Policing\r\nFor devices that need to offer SIP services, it is possible to use Control Plane Policing (CoPP) to block SIP traffic to the device from untrusted sources. Cisco IOS Releases 12.0S, 12.2SX, 12.2S, 12.3T, 12.4, and 12.4T support the CoPP feature. CoPP may be configured on a device to protect the management and control planes to minimize the risk and effectiveness of direct infrastructure attacks by explicitly permitting only authorized traffic sent to infrastructure devices in accordance with existing security policies and configurations. The following example can be adapted to specific network configurations:\r\n\r\n!– The 192.168.1.0/24 network and the 172.16.1.1 host are trusted.\r\n!– Everything else is not trusted. The following access list is used\r\n!– to determine what traffic needs to be dropped by a control plane\r\n!– policy (the CoPP feature): if the access list matches (permit)\r\n!– then traffic will be dropped and if the access list does not\r\n!– match (deny) then traffic will be processed by the router.\n\r\naccess-list 100 deny udp 192.168.1.0 0.0.0.255 any eq 5060\r\naccess-list 100 deny tcp 192.168.1.0 0.0.0.255 any eq 5060\r\naccess-list 100 deny tcp 192.168.1.0 0.0.0.255 any eq 5061\r\naccess-list 100 deny udp host 172.16.1.1 any eq 5060\r\naccess-list 100 deny tcp host 172.16.1.1 any eq 5060\r\naccess-list 100 deny tcp host 172.16.1.1 any eq 5061\r\naccess-list 100 permit udp any any eq 5060\r\naccess-list 100 permit tcp any any eq 5060\r\naccess-list 100 permit tcp any any eq 5061\n\r\n!– Permit (police or drop)/deny (allow) all other Layer3 and Layer4\r\n!– traffic in accordance with existing security policies and\r\n!– configurations for traffic that is authorized to be sent\r\n!– to infrastructure devices.\r\n!– Create a class map for traffic to be policed by\r\n!– the CoPP feature.\n\r\nclass-map match-all drop-sip-class\r\n  match access-group 100\n\r\n!– Create a policy map that will be applied to the\r\n!– control plane of the device.\n\r\npolicy-map control-plane-policy\r\n class drop-sip-class\r\n  drop\n\r\n!– Apply the policy map to the control plane of the\r\n!– device.\r\n\r\ncontrol-plane\r\n service-policy input control-plane-policy\r\n\r\nNote: Because SIP can use UDP as a transport protocol, it is possible to spoof the source address of an IP packet, which may bypass access control lists that permit communication to these ports from trusted IP addresses. Additional information about Unicast Reverse Path Forwarding is at http://www.cisco.com/web/about/security/intelligence/unicast-rpf.html[\"http://www.cisco.com/web/about/security/intelligence/unicast-rpf.html\"]\n\r\n\n\r\nIn the preceding CoPP example, the access control entries that match the potential exploit packets with the permit action cause these packets to be discarded by the policy map drop function, while packets that match the deny action (not shown) are not affected by the policy map drop function. Additional information about the configuration and use of the CoPP feature is at http://www.cisco.com/web/about/security/intelligence/coppwp_gs.html[\"http://www.cisco.com/web/about/security/intelligence/coppwp_gs.html\"] and http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html[\"http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html\"].",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Notices archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution.\n\r\n\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers. \n\r\n\n\r\n\r\nIn February 2014, Cisco announced details of an industry-wide issue with memory components manufactured by a single supplier between 2005 and 2010. Although the majority of Cisco products that use these components are experiencing field failure rates below expected levels, a device reload or power cycle could expose component failures. While there are no known security implications associated with this issue, a subset of the affected products may experience a memory component failure during the software upgrade process. Cisco recommends customers review the related information and product-specific field notices at www.cisco.com/go/memory[\"http://www.cisco.com/go/memory\"] before making upgrade decisions. Each Field Notice indicates whether the product could experience the memory component failure during a software upgrade.\r\n\r\nCisco IOS Software\r\nThe Cisco IOS Software Checker[\"http://tools.cisco.com/security/center/selectIOSVersion.x\"] is the quickest method to determine exposure to vulnerabilities in Cisco IOS Software. The tool allows customers to quickly identify Cisco Security Advisories that impact specific Cisco IOS Software releases. Users can initiate a search by selecting releases from the drop-down menu or uploading a file from their local system. The tool is also capable of parsing show version command output. Results can be customized by searching against all previously published Cisco Security Advisories, a specific publication, or all the advisories in the March 2014 Bundled Publication. \n\r\n\n\r\nCustomers can also use the Cisco IOS Software tables below to determine their exposure. Each row corresponds to a Cisco IOS Software release; if a particular release is vulnerable, the earliest releases that contain the fix are listed in the second column. The third column lists the earliest possible releases that correct all vulnerabilities in this Cisco IOS Software Security Advisory bundled publication.\r\n\r\n\n\r\n\n\r\n[\"javascript:Toggle(']Expand to View Detailed Fixed Software Information\r\n\r\n    \r\n        \r\n            Major Release\r\n                 Availability of Repaired Releases\r\n        \r\n        \r\n            Affected 12.X-Based Releases\r\n            First Fixed Release\r\n            First Fixed Release for All Advisories in the March 2014 Bundled Publication\r\n        \r\n        \r\n            There are no affected 12.X based releases\r\n        \r\n        \r\n            Affected 15.0-Based Releases\r\n            First Fixed Release\r\n            First Fixed Release for All Advisories in the March 2014 Bundled Publication\r\n        \r\n        \r\n            There are no affected 15.0 based releases\r\n        \r\n        \r\n            Affected 15.1-Based Releases\r\n            First Fixed Release\r\n            First Fixed Release for All Advisories in the March 2014 Bundled Publication\r\n        \r\n        \r\n            There are no affected 15.1 based releases\r\n        \r\n        \r\n            Affected 15.2-Based Releases\r\n            First Fixed Release\r\n            First Fixed Release for All Advisories in the March 2014 Bundled Publication\r\n        \r\n        \r\n            There are no affected 15.2 based releases\r\n        \r\n        \r\n            Affected 15.3-Based Releases\r\n            First Fixed Release\r\n            First Fixed Release for All Advisories in the March 2014 Bundled Publication\r\n        \r\n        \r\n            15.3M\r\n            15.3(3)M2\n\r\n            Vulnerable; migrate to any release in 15.4T\n\r\n            \r\n            15.3(3)M2\n\r\n            \r\n        \r\n        \r\n            15.3S\r\n            Not vulnerable\n\r\n            Cisco IOS XE devices: Please see Cisco IOS XE Software Availability[\"#iosxe\"]\n\r\n            \r\n            15.3(3)S2\n\r\n            Cisco IOS XE devices: Please see Cisco IOS XE Software Availability[\"#iosxe\"]\n\r\n            \r\n        \r\n        \r\n            15.3T\r\n            Not vulnerable\n\r\n            \r\n            15.3(2)T3\n\r\n            \r\n        \r\n        \r\n            Affected 15.4-Based Releases\r\n            First Fixed Release\r\n            First Fixed Release for All Advisories in the March 2014 Bundled Publication\r\n        \r\n        \r\n            There are no affected 15.4 based releases\r\n        \r\n    \r\n\r\nCisco IOS XE Software\r\nOnly Cisco IOS XE Software release 3.10.0S, 3.10.0aS and 3.10.1S are affected by this vulnerability. \n\r\n\n\r\nFirst fixed in Cisco IOS XE Software release 3.10.2S.\r\nCisco IOS XR Software\r\nCisco IOS XR Software is not affected by any of the vulnerabilities that are disclosed in the March 2014 Cisco IOS Software Security Advisory bundled publications.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.\n\r\n\n\r\nThis vulnerability was discovered during internal security testing.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "external",
				"summary": "Identifying and Mitigating Exploitation of the Cisco IOS Software Session Initiation Protocol Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=32537"
			},
			{
				"category": "self",
				"summary": "Cisco IOS Software Session Initiation Protocol Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20140326-sip"
			},
			{
				"category": "external",
				"summary": "Cisco IOS Software and Cisco IOS XE Software Session Initiation Protocol Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAlert.x?alertId=33344"
			}
		],
		"title": "Cisco IOS Software Session Initiation Protocol Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2014-03-31T13:46:00+00:00",
			"generator": {
				"date": "2022-07-15T00:23:54+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20140326-sip",
			"initial_release_date": "2014-03-26T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2014-03-26T15:24:33+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2014-03-31T13:46:38+00:00",
					"number": "1.1.0",
					"summary": "Added Cisco IOS XE Release 3.10.0aS as an affected release."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"branches": [
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "15.3(3)M",
										"product": {
											"name": "15.3(3)M",
											"product_id": "CSAFPID-187412"
										}
									},
									{
										"category": "service_pack",
										"name": "15.3(3)M1",
										"product": {
											"name": "15.3(3)M1",
											"product_id": "CSAFPID-193284"
										}
									}
								],
								"category": "product_version",
								"name": "15.3M"
							},
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "15.3(3)XB12",
										"product": {
											"name": "15.3(3)XB12",
											"product_id": "CSAFPID-195876"
										}
									}
								],
								"category": "product_version",
								"name": "15.3XB"
							},
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "15.3(3)JAA1",
										"product": {
											"name": "15.3(3)JAA1",
											"product_id": "CSAFPID-230594"
										}
									}
								],
								"category": "product_version",
								"name": "15.3JAA"
							},
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "15.3(3)JPI",
										"product": {
											"name": "15.3(3)JPI",
											"product_id": "CSAFPID-274202"
										}
									}
								],
								"category": "product_version",
								"name": "15.3JPI"
							}
						],
						"category": "product_family",
						"name": "IOS"
					},
					{
						"branches": [
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "3.10.0S",
										"product": {
											"name": "3.10.0S",
											"product_id": "CSAFPID-198123"
										}
									},
									{
										"category": "service_pack",
										"name": "3.10.1S",
										"product": {
											"name": "3.10.1S",
											"product_id": "CSAFPID-198124"
										}
									},
									{
										"category": "service_pack",
										"name": "3.10.1xbS",
										"product": {
											"name": "3.10.1xbS",
											"product_id": "CSAFPID-213642"
										}
									}
								],
								"category": "product_version",
								"name": "3.10S"
							},
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "17.9.1",
										"product": {
											"name": "17.9.1",
											"product_id": "CSAFPID-278025"
										}
									}
								],
								"category": "product_version",
								"name": "17.9"
							}
						],
						"category": "product_family",
						"name": "Cisco IOS XE Software"
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2014-2106",
			"notes": [
				{
					"category": "other",
					"text": "CSCug45898",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-187412",
					"CSAFPID-193284",
					"CSAFPID-195876",
					"CSAFPID-230594",
					"CSAFPID-274202",
					"CSAFPID-198123",
					"CSAFPID-198124",
					"CSAFPID-213642",
					"CSAFPID-278025"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco IOS Software Session Initiation Protocol Denial of Service Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20140326-sip"
				}
			],
			"release_date": "2014-03-26T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "If the affected Cisco IOS device requires SIP for VoIP services, SIP cannot be disabled, and no workarounds are available. Users are advised to apply mitigation techniques to help limit exposure to the vulnerability. Mitigation consists of allowing only legitimate devices to connect to affected devices. To increase effectiveness, the mitigation must be coupled with anti-spoofing measures on the network edge. This action is required because SIP can use UDP as the transport protocol.\n\r\n\n\r\nAdditional mitigations that can be deployed on Cisco devices within the network are available in the companion document Identifying and Mitigating Exploitation of the Cisco IOS Software Session Initiation Protocol Denial of Service Vulnerability, which is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/viewAMBAlert.x?alertId=32537[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=32537\"]\r\nDisabling SIP Listening Ports\r\nFor devices that do not require SIP to be enabled, the simplest and most effective workaround is to disable SIP processing on the device. Some releases of Cisco IOS Software allow administrators to disable SIP with the following commands:\r\n\r\nsip-ua\n no transport udp\n no transport tcp\n no transport tcp tls\r\n\r\nWarning: When applying this workaround to devices that are processing Media Gateway Control Protocol (MGCP) or H.323 calls, the device will not stop SIP processing while active calls are being processed. Under these circumstances, this workaround should be implemented during a maintenance window when active calls can be stopped briefly.\n\r\n\n\r\nThe show udp connections, show tcp brief all, and show control-plane host open-ports commands can be used to confirm that the SIP UDP and TCP ports are closed after applying this workaround.\n\r\n\n\r\nDepending on the Cisco IOS Software release in use, when SIP is disabled the output from the show ip sockets command may still show the SIP ports open, but sending traffic to them will cause the SIP process to display the following message:\r\n\r\n*Nov 2 11:36:47.691: sip_udp_sock_process_read: SIP UDP Listener is DISABLED\r\n\r\nControl Plane Policing\r\nFor devices that need to offer SIP services, it is possible to use Control Plane Policing (CoPP) to block SIP traffic to the device from untrusted sources. Cisco IOS Releases 12.0S, 12.2SX, 12.2S, 12.3T, 12.4, and 12.4T support the CoPP feature. CoPP may be configured on a device to protect the management and control planes to minimize the risk and effectiveness of direct infrastructure attacks by explicitly permitting only authorized traffic sent to infrastructure devices in accordance with existing security policies and configurations. The following example can be adapted to specific network configurations:\r\n\r\n!– The 192.168.1.0/24 network and the 172.16.1.1 host are trusted.\r\n!– Everything else is not trusted. The following access list is used\r\n!– to determine what traffic needs to be dropped by a control plane\r\n!– policy (the CoPP feature): if the access list matches (permit)\r\n!– then traffic will be dropped and if the access list does not\r\n!– match (deny) then traffic will be processed by the router.\n\r\naccess-list 100 deny udp 192.168.1.0 0.0.0.255 any eq 5060\r\naccess-list 100 deny tcp 192.168.1.0 0.0.0.255 any eq 5060\r\naccess-list 100 deny tcp 192.168.1.0 0.0.0.255 any eq 5061\r\naccess-list 100 deny udp host 172.16.1.1 any eq 5060\r\naccess-list 100 deny tcp host 172.16.1.1 any eq 5060\r\naccess-list 100 deny tcp host 172.16.1.1 any eq 5061\r\naccess-list 100 permit udp any any eq 5060\r\naccess-list 100 permit tcp any any eq 5060\r\naccess-list 100 permit tcp any any eq 5061\n\r\n!– Permit (police or drop)/deny (allow) all other Layer3 and Layer4\r\n!– traffic in accordance with existing security policies and\r\n!– configurations for traffic that is authorized to be sent\r\n!– to infrastructure devices.\r\n!– Create a class map for traffic to be policed by\r\n!– the CoPP feature.\n\r\nclass-map match-all drop-sip-class\r\n  match access-group 100\n\r\n!– Create a policy map that will be applied to the\r\n!– control plane of the device.\n\r\npolicy-map control-plane-policy\r\n class drop-sip-class\r\n  drop\n\r\n!– Apply the policy map to the control plane of the\r\n!– device.\r\n\r\ncontrol-plane\r\n service-policy input control-plane-policy\r\n\r\nNote: Because SIP can use UDP as a transport protocol, it is possible to spoof the source address of an IP packet, which may bypass access control lists that permit communication to these ports from trusted IP addresses. Additional information about Unicast Reverse Path Forwarding is at http://www.cisco.com/web/about/security/intelligence/unicast-rpf.html[\"http://www.cisco.com/web/about/security/intelligence/unicast-rpf.html\"]\n\r\n\n\r\nIn the preceding CoPP example, the access control entries that match the potential exploit packets with the permit action cause these packets to be discarded by the policy map drop function, while packets that match the deny action (not shown) are not affected by the policy map drop function. Additional information about the configuration and use of the CoPP feature is at http://www.cisco.com/web/about/security/intelligence/coppwp_gs.html[\"http://www.cisco.com/web/about/security/intelligence/coppwp_gs.html\"] and http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html[\"http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html\"]."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-187412",
						"CSAFPID-193284",
						"CSAFPID-195876",
						"CSAFPID-230594",
						"CSAFPID-274202",
						"CSAFPID-198123",
						"CSAFPID-198124",
						"CSAFPID-213642",
						"CSAFPID-278025"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-187412",
						"CSAFPID-193284",
						"CSAFPID-195876",
						"CSAFPID-230594",
						"CSAFPID-274202",
						"CSAFPID-198123",
						"CSAFPID-198124",
						"CSAFPID-213642",
						"CSAFPID-278025"
					]
				}
			],
			"title": "Cisco IOS Software and Cisco IOS XE Software Session Initiation Protocol Denial of Service Vulnerability"
		}
	]
}
