{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Cisco IOS® Software with support for Network  Time Protocol (NTP) version (v4) contains a vulnerability processing specific  NTP packets that will result in a reload of the device. This results in a  remote denial of service (DoS) condition on the affected device.\r\n\r\nCisco has released software updates that address this vulnerability.\r\n\r\nWorkarounds that mitigate this vulnerability are available.\r\n\r\nThis advisory is posted at  http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20090923-ntp [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20090923-ntp\"].\r\n\r\n Note: The September 23, 2009, Cisco IOS Security Advisory bundled publication includes eleven Security Advisories. Ten of the advisories address vulnerabilities in Cisco IOS Software, and one advisory addresses a vulnerability in Cisco Unified Communications Manager. Each advisory lists the releases that correct the vulnerability or vulnerabilities detailed in the advisory.\r\n\r\n Individual publication links are in \"Cisco Event Response:  Semiannual Cisco IOS Software Advisory Bundled Publication\" at the following  link:\r\n\r\n  http://www.cisco.com/web/about/security/intelligence/Cisco_ERP_sep09.html   [\"http://www.cisco.com/web/about/security/intelligence/Cisco_ERP_sep09.html\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco IOS Software devices are vulnerable if they support NTPv4 and are  configured for NTP operations. NTP is not enabled in Cisco IOS Software by  default.\r\n\r\nTo see if a device supports NTPv4, log into the device and via  configuration mode of the command line interface (CLI), enter the command  ntp peer 127.0.0.1 version ?. If the output has the number  4 as an option, then the device supports NTPv4. The following  example identifies a Cisco device that is running a Cisco IOS Software release  that does support NTPv4:\r\n\r\n\r\nRouter#configure terminal\nRouter(config)#ntp peer 127.0.0.1 version ?   <2-4>  NTP version number\r\n\r\nThe following example identifies a Cisco device that is running a Cisco  IOS Software release that does not support NTPv4:\r\n\r\n\r\nRouter(config)#ntp peer 127.0.0.1 version ?\n  <1-3>  NTP version number\r\n\r\nTo see if a device is configured with NTP, log into the device and  issue the CLI command show running-config | include ntp. If  the output returns either of the following commands listed then the device is  vulnerable:\r\n\r\n\r\nntp master <any following commands>\nntp peer <any following commands> ntp server <any following commands> ntp broadcast client ntp multicast client\r\n\r\nThe following example identifies a Cisco device that is configured with  NTP:\r\n\r\n\r\nrouter#show running-config | include ntp\nntp peer 192.168.0.12\r\n\r\nThe following example identifies a Cisco device that is not configured  with NTP:\r\n\r\n\r\nrouter#show running-config | include ntp\nrouter#\r\n\r\nTo determine the Cisco IOS Software release that is running on a Cisco  product, administrators can log in to the device and issue the show  version command to display the system banner. The system banner  confirms that the device is running Cisco IOS Software by displaying text  similar to \"Cisco Internetwork Operating System Software\" or \"Cisco IOS  Software.\" The image name displays in parentheses, followed by \"Version\" and  the Cisco IOS Software release name. Other Cisco devices do not have the  show version command or may provide different output.\r\n\r\nThe following example identifies a Cisco product that is running Cisco  IOS Software Release 12.3(26) with an installed image name of  C2500-IS-L:\r\n\r\n\r\nRouter#show version\n Cisco Internetwork Operating System Software  IOS (tm) 2500 Software (C2500-IS-L), Version 12.3(26), RELEASE SOFTWARE (fc2)  Technical Support: http://www.cisco.com/techsupport  Copyright ©) 1986-2008 by cisco Systems, Inc.  Compiled Mon 17-Mar-08 14:39 by dchih   <output truncated>\r\n\r\nThe following example shows a product that is running Cisco IOS  Software release 12.4(20)T with an image name of  C1841-ADVENTERPRISEK9-M:\r\n\r\n\r\nRouter#show version\nCisco IOS Software, 1841 Software (C1841-ADVENTERPRISEK9-M), Version 12.4(20)T, RELEASE SOFTWARE (fc3) Technical Support: http://www.cisco.com/techsupport Copyright ©) 1986-2008 by Cisco Systems, Inc. Compiled Thu 10-Jul-08 20:25 by prod_rel_team  <output truncated>\r\n\r\nAdditional information about Cisco IOS Software release naming  conventions is available in \"White Paper: Cisco IOS Reference Guide\" at the  following link: http://www.cisco.com/warp/public/620/1.html [\"http://www.cisco.com/warp/public/620/1.html\"].",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "The following products and features are not affected by this  vulnerability:\r\n\r\n   Cisco IOS Software devices without support for NTPv4\r\n\r\n   Cisco IOS Software devices configured with only Simple NTP (SNTP) feature\r\n\r\n   Cisco IOS XE Software\r\n\r\n   Cisco IOS XR Software\r\n\r\n\r\nNo other Cisco products are currently known to be affected by this  vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The Network Time Protocol (NTP) is a protocol designed to  time-synchronize a network of machines. NTP runs over UDP, which in turn runs  over IP. NTPv3 is documented in  RFC1305 [\"http://www.faqs.org/rfcs/rfc1305.html\"] .  NTPv4 is a significant revision of the NTP standard, and is the current  development version, but has not been formalized into an RFC at the time of  publication of this advisory. NTPv4 is currently documented in  draft-ietf-ntp-ntpv4-proto-11 [\"http://tools.ietf.org/html/draft-ietf-ntp-ntpv4-proto-11\"]\r\n\r\nWhen a Cisco IOS Software device supporting NTPv4 receives a specific  NTP packet it will crash while creating the NTP reply packet. The NTP packet  can be sent from any remote device, and does not require authentication. Cisco  IOS devices supporting NTPv4 and configured with NTP peer authentication are  still vulnerable. The device does not have to be explicitly configured for  NTPv4 peers. For example a device configured with all NTP peers being  explicitly labeled as version 2 would still be vulnerable, as shown in the  following example:\r\n\r\n\r\nRouter#show running-config | include ntp\nntp peer 192.168.0.254 version 2 ntp peer 192.168.0.1 version 2 Router#\r\n\r\nFor further information on the Cisco implementation of NTP, consult the  configuration guide \"Cisco IOS and NX-OS Software - Performing Basic System  Management\" at the following link:  http://www.cisco.com/en/US/docs/ios/netmgmt/configuration/guide/nm_basic_sys_manage.html#wp1001170 [\"http://www.cisco.com/en/US/docs/ios/netmgmt/configuration/guide/nm_basic_sys_manage.html#wp1001170\"]\r\n\r\nThis vulnerability is documented in the following Cisco Bug IDs:   CSCsu24505  [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsu24505\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)          and   CSCsv75948  [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsv75948\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)          and has been assigned  the Common Vulnerabilities and Exposures (CVE) identifier CVE-2009-2869. Both  Cisco bug IDs are required for a full fix to this vulnerability.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds other than disabling NTP on the device. The  following mitigations have been identified for this vulnerability; only packets  destined for any configured IP address on the device can exploit this  vulnerability. Transit traffic will not exploit this vulnerability.\r\n\r\n Note: NTP peer authentication is not a workaround and is still a vulnerable configuration.\r\n       NTP Access Group\r\n  Warning: Because the feature in this vulnerability utilizes UDP as a transport, it is possible to spoof the sender's IP address, which may defeat access control lists (ACLs) that permit communication to these ports from trusted IP addresses. Unicast Reverse Path Forwarding (Unicast RPF) should be considered to be used in conjunction to offer a better mitigation solution.\r\n\r\n\r\n\n !--- Configure trusted peers for allowed access   access-list 1 permit 171.70.173.55   !--- Apply ACE to the NTP configuration   ntp access-group peer 1\r\n\r\n  Warning: Depending on your NTP ACL configuration, be aware of Cisco Bug ID: CSCsw79186 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsw79186\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)          - NTPv4 server treats NTPv3 client as a 'peer'.\r\n\r\nFor additional information on NTP access control groups, consult the  document titled \"Performing Basic System Management\" at the following link:  http://www.cisco.com/en/US/docs/ios/netmgmt/configuration/guide/nm_basic_sys_manage.html#wp1034942 [\"http://www.cisco.com/en/US/docs/ios/netmgmt/configuration/guide/nm_basic_sys_manage.html#wp1034942\"]\r\n     Infrastructure Access Control Lists\r\n  Warning: Because the feature in this vulnerability utilizes UDP as a transport, it is possible to spoof the sender's IP address, which may defeat ACLs that permit communication to these ports from trusted IP addresses. Unicast RPF should be considered to be used in conjunction to offer a better mitigation solution.\r\n\r\nAlthough it is often difficult to block traffic that transits a  network, it is possible to identify traffic that should never be allowed to  target infrastructure devices and block that traffic at the border of networks.  Infrastructure ACLs (iACLs) are a network security best practice and should be  considered as a long-term addition to good network security as well as a  workaround for this specific vulnerability. The iACL example below should be  included as part of the deployed infrastructure access-list, which will help  protect all devices with IP addresses in the infrastructure IP address  range:\r\n\r\n\r\n\n !--- !--- Feature: Network Time Protocol (NTP) !---   access-list 150 permit udp TRUSTED_SOURCE_ADDRESSES WILDCARD      INFRASTRUCTURE_ADDRESSES WILDCARD eq 123   !--- Note: If the router is acting as a NTP broadcast client !---   via the interface command \"ntp broadcast client\" !---   then broadcast and directed broadcasts must be  !---   filtered as well.  The following example covers !---   an infrastructure address space of 192.168.0.X   access-list 150 permit udp TRUSTED_SOURCE_ADDRESSES WILDCARD      host 192.168.0.255 eq ntp access-list 150 permit udp TRUSTED_SOURCE_ADDRESSES WILDCARD      host 255.255.255.255 eq ntp   !--- Note: If the router is acting as a NTP multicast client !---   via the interface command \"ntp multicast client\" !---   then multicast IP packets to the mutlicast group must !---   be filtered as well.  The following example covers !---   a NTP multicast group of 239.0.0.1 (Default is !---   224.0.1.1)   access-list 150 permit udp TRUSTED_SOURCE_ADDRESSES WILDCARD      host 239.0.0.1 eq ntp   !--- Deny NTP traffic from all other sources destined !--- to infrastructure addresses.   access-list 150 deny udp any      INFRASTRUCTURE_ADDRESSES WILDCARD eq 123   !--- Permit/deny all other Layer 3 and Layer 4 traffic in !--- accordance with existing security policies and !--- configurations.  Permit all other traffic to transit the !--- device.   access-list 150 permit ip any any   !--- Apply access-list to all interfaces (only one example !--- shown)    interface fastEthernet 2/0  ip access-group 150 in\r\n\r\nThe white paper entitled \"Protecting Your Core: Infrastructure  Protection Access Control Lists\" presents guidelines and recommended deployment  techniques for infrastructure protection access lists and is available at the  following link  http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml\"]\r\n     Control Plane Policing\r\n Warning: Because the feature in this vulnerability  utilizes UDP as a transport, it is possible to spoof the sender's IP address,  which may defeat ACLs that permit communication to these ports from trusted IP  addresses. Unicast RPF should be considered to be used in conjunction to offer  a better mitigation solution.\r\n\r\nControl Plane Policing (CoPP) can be used to block untrusted UDP  traffic to the device. Cisco IOS software releases 12.0S, 12.2SX, 12.2S, 12.3T,  12.4, and 12.4T support the CoPP feature. CoPP can be configured on a device to  help protect the management and control planes and minimize the risk and  effectiveness of direct infrastructure attacks by explicitly permitting only  authorized traffic that is sent to infrastructure devices in accordance with  existing security policies and configurations. The CoPP example below should be  included as part of the deployed CoPP, which will help protect all devices with  IP addresses in the infrastructure IP address range.\r\n\r\n\r\n\n !--- Feature: Network Time Protocol (NTP)   access-list 150 deny udp TRUSTED_SOURCE_ADDRESSES WILDCARD      any eq 123   !--- Deny NTP traffic from all other sources destined !--- to the device control plane.   access-list 150 permit udp any any eq 123   !--- Permit (Police or Drop)/Deny (Allow) all other Layer3 and  !--- Layer4 traffic in accordance with existing security policies !--- and configurations for traffic that is authorized to be sent !--- to infrastructure devices !--- Create a Class-Map for traffic to be policed by !--- the CoPP feature   class-map match-all drop-udp-class  match access-group 150   !--- Create a Policy-Map that will be applied to the !--- Control-Plane of the device.   policy-map drop-udp-traffic  class drop-udp-class   drop   !--- Apply the Policy-Map to the  !--- Control-Plane of the device   control-plane  service-policy input drop-udp-traffic\r\n\r\nIn the above CoPP example, the access control list entries (ACEs) that  match the potential exploit packets with the \"permit\" action result in these  packets being discarded by the policy-map \"drop\" function, while packets that  match the \"deny\" action (not shown) are not affected by the policy-map drop  function. Please note that the policy-map syntax is different in the 12.2S and  12.0S Cisco IOS Software trains:\r\n\r\n\r\npolicy-map drop-udp-traffic\nclass drop-udp-class police 32000 1500 1500 conform-action drop exceed-action drop\r\n\r\nAdditional information on the configuration and use of the CoPP feature  can be found in the documents, \"Control Plane Policing Implementation Best  Practices\" and \"Cisco IOS Software Releases 12.2 S - Control Plane Policing\" at  the following links:  http://www.cisco.com/web/about/security/intelligence/coppwp_gs.html [\"http://www.cisco.com/web/about/security/intelligence/coppwp_gs.html\"]  and  http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html [\"http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html\"]",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, also consult  http://www.cisco.com/go/psirt [\"http://www.cisco.com/go/psirt\"]  and any subsequent advisories to determine exposure and a complete upgrade  solution.\r\n\r\nIn all cases, customers should exercise caution to be  certain the devices to be upgraded contain sufficient memory and that current  hardware and software configurations will continue to be supported properly by  the new release. If the information is not clear, contact the Cisco Technical  Assistance Center (TAC) or your contracted maintenance provider for assistance.\r\n\r\nEach row of the Cisco IOS software table (below) names a  Cisco IOS release train. If a given release train is vulnerable, then the  earliest possible releases that contain the fix (along with the anticipated  date of availability for each, if applicable) are listed in the \"First Fixed  Release\" column of the table. The \"Recommended Release\" column indicates the  releases which have fixes for all the published vulnerabilities at the time of  this Advisory. A device running a release in the given train that is earlier  than the release in a specific column (less than the First Fixed Release) is  known to be vulnerable. Cisco recommends upgrading to a release equal to or  later than the release in the \"Recommended Releases\" column of the table.\r\n\r\n  Major Release\r\n\r\n Availability of Repaired Releases\r\n\r\n Affected 12.0-Based Releases\r\n\r\n First Fixed Release\r\n\r\n Recommended Release\r\n\r\nThere are no affected 12.0 based releases\r\n\r\n Affected 12.1-Based Releases\r\n\r\n First Fixed Release\r\n\r\n Recommended Release\r\n\r\nThere are no affected 12.1 based releases\r\n\r\n Affected 12.2-Based Releases\r\n\r\n First Fixed Release\r\n\r\n Recommended Release\r\n\r\nThere are no affected 12.2 based releases\r\n\r\n Affected 12.3-Based Releases\r\n\r\n First Fixed Release\r\n\r\n Recommended Release\r\n\r\nThere are no affected 12.3 based releases\r\n\r\n Affected 12.4-Based Releases\r\n\r\n First Fixed Release\r\n\r\n Recommended Release\r\n\r\n 12.4\r\n\r\nNot Vulnerable\r\n\r\n 12.4GC\r\n\r\nNot Vulnerable\r\n\r\n 12.4JA\r\n\r\nNot Vulnerable\r\n\r\n 12.4JDA\r\n\r\nNot Vulnerable\r\n\r\n 12.4JDC\r\n\r\nNot Vulnerable\r\n\r\n 12.4JDD\r\n\r\nNot Vulnerable\r\n\r\n 12.4JK\r\n\r\nNot Vulnerable\r\n\r\n 12.4JL\r\n\r\nNot Vulnerable\r\n\r\n 12.4JMA\r\n\r\nNot Vulnerable\r\n\r\n 12.4JMB\r\n\r\nNot Vulnerable\r\n\r\n 12.4JX\r\n\r\nNot Vulnerable\r\n\r\n 12.4MD\r\n\r\nReleases prior to 12.4(22)MD are not vulnerable, vulnerability  was first introduced in 12.4(22)MD, first fixed in 12.4(22)MD1.\r\n\r\n12.4(22)MD1\r\n\r\n 12.4MDA\r\n\r\nNot Vulnerable\r\n\r\n 12.4MR\r\n\r\nNot Vulnerable\r\n\r\n 12.4SW\r\n\r\nNot Vulnerable\r\n\r\n 12.4T\r\n\r\nReleases prior to 12.4(20)T are not vulnerable.\r\n\r\n12.4(20)T and 12.4(20)T1 are vulnerable, vulnerability is first  fixed in 12.4(20)T2.\r\n\r\n12.4(22)T is vulnerable, vulnerability is first fixed in  12.4(22)T1\r\n\r\n12.4(24)T is not vulnerable.\r\n\r\n12.4(20)T4\r\n\r\n12.4(22)T3\r\n\r\n12.4(24)T2; Available on 23-OCT-2009\r\n\r\n 12.4XA\r\n\r\nNot Vulnerable\r\n\r\n 12.4XB\r\n\r\nNot Vulnerable\r\n\r\n 12.4XC\r\n\r\nNot Vulnerable\r\n\r\n 12.4XD\r\n\r\nNot Vulnerable\r\n\r\n 12.4XE\r\n\r\nNot Vulnerable\r\n\r\n 12.4XF\r\n\r\nNot Vulnerable\r\n\r\n 12.4XG\r\n\r\nNot Vulnerable\r\n\r\n 12.4XJ\r\n\r\nNot Vulnerable\r\n\r\n 12.4XK\r\n\r\nNot Vulnerable\r\n\r\n 12.4XL\r\n\r\nNot Vulnerable\r\n\r\n 12.4XM\r\n\r\nNot Vulnerable\r\n\r\n 12.4XN\r\n\r\nNot Vulnerable\r\n\r\n 12.4XP\r\n\r\nNot Vulnerable\r\n\r\n 12.4XQ\r\n\r\nNot Vulnerable\r\n\r\n 12.4XR\r\n\r\nNot Vulnerable\r\n\r\n 12.4XT\r\n\r\nNot Vulnerable\r\n\r\n 12.4XV\r\n\r\nNot Vulnerable\r\n\r\n 12.4XW\r\n\r\nNot Vulnerable\r\n\r\n 12.4XY\r\n\r\nNot Vulnerable\r\n\r\n 12.4XZ\r\n\r\nVulnerable; first fixed in 12.4T [\"#12_4T\"]\r\n\r\n12.4(20)T4\r\n\r\n12.4(22)T3\r\n\r\n12.4(24)T2; Available on 23-OCT-2009\r\n\r\n 12.4YA\r\n\r\nVulnerable; first fixed in 12.4T [\"#12_4T\"]\r\n\r\n12.4(20)T4\r\n\r\n12.4(22)T3\r\n\r\n12.4(24)T2; Available on 23-OCT-2009\r\n\r\n 12.4YB\r\n\r\nNot Vulnerable\r\n\r\n 12.4YD\r\n\r\n12.4(22)YD1\r\n\r\n12.4(22)YD1\r\n\r\n 12.4YE\r\n\r\n12.4(22)YE1\r\n\r\n12.4(22)YE1",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious  use of the vulnerability described in this advisory.\r\n\r\nThis vulnerability was discovered by Cisco when handling  customer support calls.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS Software Network Time Protocol Packet Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20090923-ntp"
			}
		],
		"title": "Cisco IOS Software Network Time Protocol Packet Vulnerability",
		"tracking": {
			"current_release_date": "2009-09-23T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:08:19+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20090923-ntp",
			"initial_release_date": "2009-09-23T16:00:00+00:00",
			"revision_history": [],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"cve": "CVE-2009-2869",
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Cisco IOS Software Network Time Protocol Packet Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20090923-ntp"
				}
			],
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds other than disabling NTP on the device. The  following mitigations have been identified for this vulnerability; only packets  destined for any configured IP address on the device can exploit this  vulnerability. Transit traffic will not exploit this vulnerability.\r\n\r\n Note: NTP peer authentication is not a workaround and is still a vulnerable configuration.\r\n       NTP Access Group\r\n  Warning: Because the feature in this vulnerability utilizes UDP as a transport, it is possible to spoof the sender's IP address, which may defeat access control lists (ACLs) that permit communication to these ports from trusted IP addresses. Unicast Reverse Path Forwarding (Unicast RPF) should be considered to be used in conjunction to offer a better mitigation solution.\r\n\r\n\r\n\n !--- Configure trusted peers for allowed access   access-list 1 permit 171.70.173.55   !--- Apply ACE to the NTP configuration   ntp access-group peer 1\r\n\r\n  Warning: Depending on your NTP ACL configuration, be aware of Cisco Bug ID: CSCsw79186 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsw79186\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)          - NTPv4 server treats NTPv3 client as a 'peer'.\r\n\r\nFor additional information on NTP access control groups, consult the  document titled \"Performing Basic System Management\" at the following link:  http://www.cisco.com/en/US/docs/ios/netmgmt/configuration/guide/nm_basic_sys_manage.html#wp1034942 [\"http://www.cisco.com/en/US/docs/ios/netmgmt/configuration/guide/nm_basic_sys_manage.html#wp1034942\"]\r\n     Infrastructure Access Control Lists\r\n  Warning: Because the feature in this vulnerability utilizes UDP as a transport, it is possible to spoof the sender's IP address, which may defeat ACLs that permit communication to these ports from trusted IP addresses. Unicast RPF should be considered to be used in conjunction to offer a better mitigation solution.\r\n\r\nAlthough it is often difficult to block traffic that transits a  network, it is possible to identify traffic that should never be allowed to  target infrastructure devices and block that traffic at the border of networks.  Infrastructure ACLs (iACLs) are a network security best practice and should be  considered as a long-term addition to good network security as well as a  workaround for this specific vulnerability. The iACL example below should be  included as part of the deployed infrastructure access-list, which will help  protect all devices with IP addresses in the infrastructure IP address  range:\r\n\r\n\r\n\n !--- !--- Feature: Network Time Protocol (NTP) !---   access-list 150 permit udp TRUSTED_SOURCE_ADDRESSES WILDCARD      INFRASTRUCTURE_ADDRESSES WILDCARD eq 123   !--- Note: If the router is acting as a NTP broadcast client !---   via the interface command \"ntp broadcast client\" !---   then broadcast and directed broadcasts must be  !---   filtered as well.  The following example covers !---   an infrastructure address space of 192.168.0.X   access-list 150 permit udp TRUSTED_SOURCE_ADDRESSES WILDCARD      host 192.168.0.255 eq ntp access-list 150 permit udp TRUSTED_SOURCE_ADDRESSES WILDCARD      host 255.255.255.255 eq ntp   !--- Note: If the router is acting as a NTP multicast client !---   via the interface command \"ntp multicast client\" !---   then multicast IP packets to the mutlicast group must !---   be filtered as well.  The following example covers !---   a NTP multicast group of 239.0.0.1 (Default is !---   224.0.1.1)   access-list 150 permit udp TRUSTED_SOURCE_ADDRESSES WILDCARD      host 239.0.0.1 eq ntp   !--- Deny NTP traffic from all other sources destined !--- to infrastructure addresses.   access-list 150 deny udp any      INFRASTRUCTURE_ADDRESSES WILDCARD eq 123   !--- Permit/deny all other Layer 3 and Layer 4 traffic in !--- accordance with existing security policies and !--- configurations.  Permit all other traffic to transit the !--- device.   access-list 150 permit ip any any   !--- Apply access-list to all interfaces (only one example !--- shown)    interface fastEthernet 2/0  ip access-group 150 in\r\n\r\nThe white paper entitled \"Protecting Your Core: Infrastructure  Protection Access Control Lists\" presents guidelines and recommended deployment  techniques for infrastructure protection access lists and is available at the  following link  http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml\"]\r\n     Control Plane Policing\r\n Warning: Because the feature in this vulnerability  utilizes UDP as a transport, it is possible to spoof the sender's IP address,  which may defeat ACLs that permit communication to these ports from trusted IP  addresses. Unicast RPF should be considered to be used in conjunction to offer  a better mitigation solution.\r\n\r\nControl Plane Policing (CoPP) can be used to block untrusted UDP  traffic to the device. Cisco IOS software releases 12.0S, 12.2SX, 12.2S, 12.3T,  12.4, and 12.4T support the CoPP feature. CoPP can be configured on a device to  help protect the management and control planes and minimize the risk and  effectiveness of direct infrastructure attacks by explicitly permitting only  authorized traffic that is sent to infrastructure devices in accordance with  existing security policies and configurations. The CoPP example below should be  included as part of the deployed CoPP, which will help protect all devices with  IP addresses in the infrastructure IP address range.\r\n\r\n\r\n\n !--- Feature: Network Time Protocol (NTP)   access-list 150 deny udp TRUSTED_SOURCE_ADDRESSES WILDCARD      any eq 123   !--- Deny NTP traffic from all other sources destined !--- to the device control plane.   access-list 150 permit udp any any eq 123   !--- Permit (Police or Drop)/Deny (Allow) all other Layer3 and  !--- Layer4 traffic in accordance with existing security policies !--- and configurations for traffic that is authorized to be sent !--- to infrastructure devices !--- Create a Class-Map for traffic to be policed by !--- the CoPP feature   class-map match-all drop-udp-class  match access-group 150   !--- Create a Policy-Map that will be applied to the !--- Control-Plane of the device.   policy-map drop-udp-traffic  class drop-udp-class   drop   !--- Apply the Policy-Map to the  !--- Control-Plane of the device   control-plane  service-policy input drop-udp-traffic\r\n\r\nIn the above CoPP example, the access control list entries (ACEs) that  match the potential exploit packets with the \"permit\" action result in these  packets being discarded by the policy-map \"drop\" function, while packets that  match the \"deny\" action (not shown) are not affected by the policy-map drop  function. Please note that the policy-map syntax is different in the 12.2S and  12.0S Cisco IOS Software trains:\r\n\r\n\r\npolicy-map drop-udp-traffic\nclass drop-udp-class police 32000 1500 1500 conform-action drop exceed-action drop\r\n\r\nAdditional information on the configuration and use of the CoPP feature  can be found in the documents, \"Control Plane Policing Implementation Best  Practices\" and \"Cisco IOS Software Releases 12.2 S - Control Plane Policing\" at  the following links:  http://www.cisco.com/web/about/security/intelligence/coppwp_gs.html [\"http://www.cisco.com/web/about/security/intelligence/coppwp_gs.html\"]  and  http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html [\"http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gtrtlimt.html\"]"
				}
			],
			"title": "Cisco IOS Network Time Protocol Version 4 Remote Denial of Service Vulnerability"
		}
	]
}
