{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A specifically crafted Transmission Control Protocol (TCP) connection  to a telnet or reverse telnet port of a Cisco device running Internetwork  Operating System (IOS)® may block further telnet,  reverse telnet, Remote Shell (RSH), Secure Shell (SSH), and in some cases  Hypertext Transport Protocol (HTTP) access to the Cisco device. Data Link  Switching (DLSw) and protocol translation connections may also be affected.  Telnet, reverse telnet, RSH, SSH, DLSw and protocol translation sessions  established prior to exploitation are not affected.\r\n\r\nAll other device services will operate normally. Services such as  packet forwarding (excluding DLSw and protocol translation per above), routing  protocols and all other communication to and through the device are not  affected.\r\n\r\nCisco has made free software available to address this vulnerability.  Workarounds, identified below, are available that protect against this  vulnerability.\r\n\r\nThis vulnerability is documented in Cisco bug ID  CSCef46191 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCef46191\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)         .\r\n\r\nThis Advisory is available at  http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20040827-telnet [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20040827-telnet\"].",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This section provides details on affected products.",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "This vulnerability affects all Cisco devices that permit access via  telnet or reverse telnet. Any IOS train without specific fixed releases listed  in the Software Versions and Fixes [\"#software\"] section  should be considered vulnerable.\r\n\r\nIOS Release trains confirmed to be affected are 9.x, 10.x, 11.x and  12.x .",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco products that do not run IOS are not affected.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Telnet, RSH and SSH are used for remote management of Cisco IOS  devices. The SSH protocol is also used for Secure Copy (SCP), which allows an  encryption-protected transfer of files to and from Cisco devices.\r\n\r\nData-link switching (DLSw) provides a means of transporting IBM Systems  Network Architecture (SNA) and network basic input/output system (NetBIOS)  traffic over an IP network. It serves as an alternative to source-route  bridging (SRB), a protocol for transporting SNA and NetBIOS traffic in Token  Ring environments that was widely deployed before the introduction of DLSw.\r\n\r\nFor more information on DLSw, refer to the following URL:\r\n\r\n http://www.cisco.com/en/US/docs/internetworking/technology/handbook/DLSw.html [\"http://www.cisco.com/en/US/docs/internetworking/technology/handbook/DLSw.html\"]\r\n\r\nProtocol translation is a method to connect a host running one protocol  (such as Telnet with TCP/IP) to a host running another protocol (such as LAT).  This process allows devices running dissimilar protocols—such as X.25 and  TCP/IP—to communicate.\r\n\r\nFor more information on protocol translation, refer to the following  URL:\r\n\r\n   http://www.cisco.com/en/US/docs/ios/11_0/access/connection/guide/xptservs.html [\" http://www.cisco.com/en/US/docs/ios/11_0/access/connection/guide/xptservs.html\"]\r\n\r\nServices operating over IPv4 and IPv6 are similarly affected.\r\n\r\nHTTP is also used for management of certain Cisco devices. IOS versions  prior to12.2(15)T include HTTP server version 1.0, which, if configured, will  be unresponsive on a device that is under exploitation. IOS versions after and  including 12.2(15)T include HTTP server version 1.1, which is  unaffected.\r\n\r\nTo determine the version of the IOS HTTP server included with the IOS  image, the command show subsys name http can be used  (the show subsys command requires enable access to  execute):\r\n\r\n\r\nRouter# show subsys name http\n                     Class         Version http                Protocol    1.001.001\r\n\r\nThe above output shows that HTTP server version 1.1 is included.\r\n\r\n\r\nRouter# show subsys name http\n                     Class         Version http                Protocol    1.000.001\r\n\r\nThe above output shows that HTTP server version 1.0 is included.\r\n\r\nReverse telnet is a feature that allows you to telnet to a Cisco device  and then connect to a third device through an asynchronous serial connection;  this configuration is often referred to as providing 'console server'  functionality for connected devices such as hosts and router/switches as a form  of out-of-band (OOB) management. For more information on reverse telnet,  consult the following documents:\r\n\r\n   http://www.cisco.com/en/US/docs/ios/12_0/dial/configuration/guide/dcrtelnt.html [\" http://www.cisco.com/en/US/docs/ios/12_0/dial/configuration/guide/dcrtelnt.html\"]\r\n\r\n http://www.cisco.com/en/US/docs/ios/11_3/dial/configuration/guide/dcrtelnt.html [\"http://www.cisco.com/en/US/docs/ios/11_3/dial/configuration/guide/dcrtelnt.html\"]\r\n\r\nCisco devices that are operating as a reverse telnet server may have  ports open in the ranges of:\r\n\r\n   2001 to 2999\r\n\r\n   3001 to 3099\r\n\r\n   6001 to 6999\r\n\r\n   7001 to 7099\r\n\r\n\r\nAfter a specially crafted TCP connection to an IOS device on TCP port  23 or the reverse telnet ports listed above, all subsequent telnet, reverse  telnet, RSH (TCP port 514), SSH, SCP (SSH and SCP use TCP port 22), DLSw (TCP  ports 2065 through 2067), protocol translation, and in some cases HTTP (TCP  port 80) connections to the device experiencing exploitation will be  unsuccessful. Any telnet, reverse telnet, RSH, SSH, SCP, DLSw, protocol  translation, and HTTP sessions that are already established with the device  will continue to function properly.\r\n\r\nIn Cisco IOS, telnet, reverse telnet, RSH, SSH, SCP, DLSw, protocol  translation and some HTTP sessions are handled by a virtual terminal (VTY).  Each telnet, reverse telnet, RSH, SSH and SCP, DLSw and protocol translation  session session consumes a VTY. After successful exploitation, the Cisco device  can no longer accept any subsequent VTY connections.\r\n\r\nThough it is not possible to establish new telnet, reverse telnet, RSH,  SSH, SCP, DLSw, protocol translation or HTTP connections to the device after a  successful exploitation, the device is only vulnerable on TCP port 23 and the  reverse telnet ports listed above.\r\n\r\nA successful exploitation of this vulnerability requires a complete  3-way TCP handshake, which makes it very difficult to spoof the source IP  address.\r\n\r\nOnly remote access services that use VTYs are affected. This includes  telnet, reverse telnet, RSH, SSH, SCP, DLSw, protocol translation and version  1.0 of the HTTP server. Other device services including, but not limited to,  routing protocols, TACACS/RADIUS, Voice over IP (VoIP) and packet forwarding  (excluding DLSw and protocol translation) are not affected.\r\n\r\nThis vulnerability is addressed by Cisco bug ID:\r\n\r\n    CSCef46191 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCef46191\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "The effectiveness of any workaround is dependent on specific customer  situations such as product mix, network topology, traffic behavior, and  organizational mission. Customers should consult with their service provider or  support organization to ensure any applied workaround is the most appropriate  for use in the intended network before it is deployed.\r\n\r\n Mitigation Strategies\r\n\r\nNot all of the mitigation strategies listed will work for all  customers. Some of the workarounds listed are dependent on which versions and  feature-sets of IOS you have in your network.\r\n\r\n Enabling SSH and disabling telnet\r\n\r\n Note: SSH support is only available in certain IOS feature sets and platforms\r\n\r\nCisco devices that support SSH can enable it by following the steps  listed here:\r\n\r\n http://cisco.com/en/US/docs/ios/12_2/security/configuration/guide/scfssh.html#wp1001167 [\"http://cisco.com/en/US/docs/ios/12_2/security/configuration/guide/scfssh.html#wp1001167\"]\r\n\r\nTo disable telnet access to the device, configure the following on all  your VTY lines:\r\n\r\n\r\n\nRouter(config)# line vty 0 4 Router(config-line)# transport input ssh\r\n\r\n Note: Even if SSH is enabled, the IOS device is not protected until telnet access is disabled.\r\n\r\n Configuring a VTY Access Class\r\n\r\n Note: Cisco Catalyst switch platforms that contain any version of the Route Switch Module (RSM), Route Switch Feature Card (RSFC), Multilayer Switch Module (MSM) or Multilayer Switch Feature Card (MSFC) are able to connect to these modules from the switch Supervisor module using the 'session' command. Although the 'session' command uses telnet internally to connect to the MSM/MSFC, it is not restricted by VTY ACLs.\r\n\r\nIt is possible to limit the exposure of the Cisco device by applying a  VTY access class to permit only known, trusted devices to connect to the device  via telnet, reverse telnet and SSH.\r\n\r\nFor more information on restricting traffic to VTYs, please  consult:\r\n\r\n http://www.cisco.com/en/US/products/sw/iosswrel/ps1818/products_configuration_example09186a0080204528.shtml [\"http://www.cisco.com/en/US/products/sw/iosswrel/ps1818/products_configuration_example09186a0080204528.shtml\"]\r\n\r\nThe following example permits access to VTYs from the 192.168.1.0/24  netblock and the single IP address 172.16.1.2 while denying access from  everywhere else:\r\n\r\n\r\n\nRouter(config)# access-list 1 permit 192.168.1.0 0.0.0.255 Router(config)# access-list 1 permit host 172.16.1.2 Router(config)# line vty 0 4 Router(config-line)# access-class 1 in\r\n\r\nFor devices acting as a terminal server, to apply the access class to  reverse telnet ports, the access-list must be configured for the aux port and  terminal lines as well:\r\n\r\n\r\nRouter(config)# line 1 <x>\nRouter(config-line)# access-class 1 in\r\n\r\nDifferent Cisco platforms support different numbers of terminal lines.  Check your device's configuration to determine the correct number of terminal  lines for your platform.\r\n\r\n Configuring Access Lists (ACLs)\r\n\r\nIn addition to configuring a VTY Access Class, it may be desirable to  block all telnet and reverse telnet traffic destined to your network  infrastructure.\r\n\r\nTelnet and reverse telnet should be blocked as part of a Transit ACL  controlling all access to the trusted network. Transit ACLs are considered a  network security best practice and should be considered as a long-term addition  to good network security, as well as a workaround for this specific  vulnerability. The white paper entitled \"Transit Access Control Lists:  Filtering at Your Edge\" presents guidelines and recommended deployment  techniques for transit ACLs:\r\n\r\n http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml\"]\r\n\r\n Configuring Infrastructure Access Lists (iACLs)\r\n\r\nAlthough it is often difficult to block traffic transiting your  network, it is possible to identify traffic which should never be allowed to  target your infrastructure devices and block that traffic at the border of your  network. Infrastructure ACLs are considered a network security best practice  and should be considered as a long-term addition to good network security as  well as a workaround for this specific vulnerability. The white paper entitled  \"Protecting Your Core: Infrastructure Protection Access Control Lists\" presents  guidelines and recommended deployment techniques for infrastructure protection  ACLs:\r\n\r\n http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml\"]\r\n\r\n Configuring Receive Access Lists (rACLs)\r\n\r\nFor distributed platforms, rACLs may be an option starting in Cisco IOS  Software Versions 12.0(21)S2 for the 12000 series GSR and 12.0(24)S for the  7500 series. The receive access lists protect the device from harmful traffic  before the traffic can impact the route processor. Receive path ACLs are  considered a network security best practice, and should be considered as a  long-term addition to good network security, as well as a workaround for this  specific vulnerability. The CPU load is distributed to the line card processors  and helps mitigate load on the main route processor. The white paper entitled  \"GSR: Receive Access Control Lists\" will help identify and allow legitimate  traffic to your device and deny all unwanted packets:\r\n\r\n http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a0a5e.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a0a5e.shtml\"]\r\n\r\n Clearing Hung TCP Connections Using the IOS CLI\r\n\r\nThe who command will show VTY connections to  the device:\r\n\r\n\r\nRouter# who\n    Line       User       Host(s)              Idle       Location    0 con 0                192.168.10.72        00:00:00 *  2 vty 0                idle                 00:00:00 192.168.10.72    3 vty 1                idle                 00:00:04 192.168.10.10\r\n\r\nThe above shows two connections on VTYs, one from 192.168.10.72, and  one from 192.168.10.10. The * indicates which VTY belongs to the current  session. In the above example, the user issuing the who command was connecting  from 192.168.10.72. To clear the session from 192.168.10.10, which is on VTY 1,  the following command is used:\r\n\r\n\r\nRouter# clear tcp line vty 1\n[confirm]  [OK]\r\n\r\n Note: If you are using telnet to connect to the device, accidentally clearing your TCP connection will disconnect your telnet session. If the IOS device has been exploited, it will not be possible to reconnect via telnet. Console access or a device reload will be required to restore service.\r\n\r\n Clearing Hung TCP Connections Using SNMP\r\n\r\nIt is also possible to detect and clear hung TCP connections using  SNMP. To detect a hung connection, an SNMP read-only community string must be  configured on the device. To reset a connection, an SNMP read-write community  string must be configured on the device.\r\n\r\nThe following document describes, in detail, the process of detecting  and clearing hung TCP connections with SNMP:\r\n\r\n http://www.cisco.com/en/US/tech/tk648/tk362/technologies_problem_troubleshooting09186a00802b93ef.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk362/technologies_problem_troubleshooting09186a00802b93ef.shtml\"]",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco is providing fixes for this vulnerability in all currently  maintained IOS releases. No software upgrade is required in order to mitigate  this vulnerability. See the information below regarding the available  configuration workarounds. The software fixes are appearing in regularly  scheduled maintenance releases of IOS software.\r\n\r\nAs more fixed software becomes available, Cisco will update this  section of the advisory.\r\n\r\n To determine the software running on a Cisco product, log in to the  device and issue the show version command to display  the system banner. Cisco IOS software will identify itself as \"Internetwork  Operating System Software\" or simply \"IOS®\". On the next line of output, the  image name will be displayed between parentheses, followed by \"Version\" and the  IOS release name. Other Cisco devices will not have the show  version command or will give different output.\r\n\r\n The following example identifies a Cisco product running IOS release  12.0(3) with an installed image name of C2500-IS-L:\r\n\r\n\r\n\nCisco Internetwork Operating System Software IOS (TM)      2500 Software (C2500-IS-L), Version 12.0(3), RELEASE SOFTWARE\r\n\r\nThe release train label is \"12.0\".\r\n\r\nThe next example shows a product running IOS release 12.0(2a)T1 with an  image name of C2600-JS-MZ:\r\n\r\n\r\n\nCisco Internetwork Operating System Software IOS (tm)  C2600 Software (C2600-JS-MZ), Version 12.0(2a)T1, RELEASE SOFTWARE (fc1)\r\n\r\nAdditional information about Cisco IOS Banners is available at  http://www.cisco.com/warp/public/620/1.html#3 [\"http://www.cisco.com/warp/public/620/1.html#3\"].\r\n\r\nEach row of the Cisco IOS software table (below) describes a release  train and the platforms or products for which it is intended. If a given  release train is vulnerable, then the earliest possible releases that contain  the fix (the \"First Fixed Release\") and the anticipated date of availability  for each are listed in the \"Rebuild\" and \"Maintenance\" columns. A device  running a release in the given train that is earlier than the release in a  specific column (less than the First Fixed Release) is known to be vulnerable.  The release should be upgraded at least to the indicated release or a later  version (greater than or equal to the First Fixed Release label). When  selecting a release, keep in mind the following definitions:\r\n\r\n Maintenance: Most heavily tested, stable, and highly  recommended release of a release train in any given row of the table.\r\n\r\n Rebuild: Constructed from the previous maintenance or  major release in the same train, it contains the fix for a specific defect.  Although it receives less testing, it contains only the minimal changes  necessary to repair the vulnerability.\r\n\r\nIn all cases, customers should exercise caution to confirm that the  devices to be upgraded contain sufficient memory and that current hardware and  software configurations will continue to be supported properly by the new  software release. If the information is not clear, contact the Cisco TAC for  assistance as shown in the Obtaining Fixed  Software [\"#fixes\"] section below.\r\n\r\nMore information on Cisco IOS software release names and abbreviations  is available at http://www.cisco.com/warp/public/620/1.html [\"http://www.cisco.com/warp/public/620/1.html\"].\r\n\r\nThe fixes will be available at the Software Center located at  http://www.cisco.com/tacpage/sw-center/ [\"http://www.cisco.com/tacpage/sw-center/\"].\r\n\r\nFor software installation and upgrade procedures, see  http://www.cisco.com/en/US/products/ps6350/tsd_products_support_install_and_upgrade.html [\"http://www.cisco.com/en/US/products/ps6350/tsd_products_support_install_and_upgrade.html\"].\r\n\r\nFor a current view of all posted and repaired images for Cisco IOS,  please check the listing available to registered Cisco.com users at:  http://www.cisco.com/tacpage/sw-center/sw-ios.shtml [\"http://www.cisco.com/tacpage/sw-center/sw-ios.shtml\"].\r\n\r\n Major Release\r\n\r\n Availability of Repaired Releases*\r\n\r\n  Affected 12.0-Based Release\r\n\r\n  Rebuild\r\n\r\n  Maintenance\r\n\r\n 12.0\r\n\r\n12.0(5)WC11 Available on 2005-Jan-24\r\n\r\n 12.0S\r\n\r\n12.0(26)S5\r\n\r\n12.0(27)S4\r\n\r\n12.0(28)S2\r\n\r\n12.0(30)S\r\n\r\n  Affected 12.1-Based Release\r\n\r\n  Rebuild\r\n\r\n  Maintenance\r\n\r\n 12.1\r\n\r\n12.1(26)\r\n\r\n 12.1E\r\n\r\n12.1(20)E5\r\n\r\n12.1(22)E3\r\n\r\n12.1(23)E1\r\n\r\n12.1(26)E Available on 2005-Jan-31\r\n\r\n 12.1EA\r\n\r\n12.1(22)EA2\r\n\r\n  Affected 12.2-Based Release\r\n\r\n  Rebuild\r\n\r\n  Maintenance\r\n\r\n 12.2\r\n\r\n12.2(27)\r\n\r\n 12.2BC\r\n\r\n12.2(15)BC1f\r\n\r\n12.2(15)BC2e\r\n\r\n 12.2EW\r\n\r\n12.2(18)EW2\r\n\r\n 12.2JK\r\n\r\n12.2(15)JK2\r\n\r\n 12.2S\r\n\r\n12.2(14)S12\r\n\r\n12.2(18)S6\r\n\r\n12.2(20)S6\r\n\r\n12.2(25)S1\r\n\r\n 12.2SE\r\n\r\n12.2(20)SE3\r\n\r\n12.2(25)SE\r\n\r\n 12.2SU\r\n\r\n12.2(14)SU2\r\n\r\n 12.2SV\r\n\r\n12.2(24)SV\r\n\r\n 12.2SXB\r\n\r\n12.2(17d)SXB5\r\n\r\n 12.2SXD\r\n\r\n12.2(18)SXD1\r\n\r\n 12.2T\r\n\r\n12.2(13)T14\r\n\r\n 12.2XR\r\n\r\n12.2(15)XR2\r\n\r\n  Affected 12.3-Based Release\r\n\r\n  Rebuild\r\n\r\n  Maintenance\r\n\r\n 12.3\r\n\r\n12.3(6d)\r\n\r\n12.3(9c)\r\n\r\n12.3(10a)\r\n\r\n12.3(12)\r\n\r\n 12.3BC\r\n\r\n12.3(5a)B2\r\n\r\n12.3(9a)BC\r\n\r\n 12.3JA\r\n\r\n12.3(2)JA\r\n\r\n 12.3T\r\n\r\n12.3(2)T8\r\n\r\n12.3(4)T8\r\n\r\n12.3(7)T4\r\n\r\n12.3(8)T4\r\n\r\n12.3(11)T\r\n\r\n 12.3XD\r\n\r\n12.3(4)XD4 Release date not yet determined\r\n\r\n 12.3XG\r\n\r\n12.3(4)XG2\r\n\r\n 12.3XI\r\n\r\n12.3(7)XI2\r\n\r\n 12.3XK\r\n\r\n12.3(4)XK1\r\n\r\n 12.3XR\r\n\r\n12.3(7)XR3\r\n\r\n 12.3XU\r\n\r\n12.3(8)XU2\r\n\r\n 12.3YD\r\n\r\n12.3(8)YD\r\n\r\n* All dates are estimated and subject to change.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is aware of exploitation of this vulnerability and is  recommending customers take action to protect themselves.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Telnet Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20040827-telnet"
			}
		],
		"title": "Cisco Telnet Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2004-08-27T10:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:05:10+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20040827-telnet",
			"initial_release_date": "2004-08-27T10:00:00+00:00",
			"revision_history": [
				{
					"date": "2004-08-27T10:00:00+00:00",
					"number": "1.1.0",
					"summary": "Added the second paragraph to the Details section. \n\t\t  Changed the Configuring a VTY Access Class and the Configuring\n\t\t\t Access Lists (ACLs) descriptions in the Workarounds section."
				}
			],
			"status": "final",
			"version": "2.5.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"cve": "CVE-2004-1464",
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Telnet Denial of Service Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20040827-telnet"
				}
			],
			"remediations": [
				{
					"category": "workaround",
					"details": "The effectiveness of any workaround is dependent on specific customer  situations such as product mix, network topology, traffic behavior, and  organizational mission. Customers should consult with their service provider or  support organization to ensure any applied workaround is the most appropriate  for use in the intended network before it is deployed.\r\n\r\n Mitigation Strategies\r\n\r\nNot all of the mitigation strategies listed will work for all  customers. Some of the workarounds listed are dependent on which versions and  feature-sets of IOS you have in your network.\r\n\r\n Enabling SSH and disabling telnet\r\n\r\n Note: SSH support is only available in certain IOS feature sets and platforms\r\n\r\nCisco devices that support SSH can enable it by following the steps  listed here:\r\n\r\n http://cisco.com/en/US/docs/ios/12_2/security/configuration/guide/scfssh.html#wp1001167 [\"http://cisco.com/en/US/docs/ios/12_2/security/configuration/guide/scfssh.html#wp1001167\"]\r\n\r\nTo disable telnet access to the device, configure the following on all  your VTY lines:\r\n\r\n\r\n\nRouter(config)# line vty 0 4 Router(config-line)# transport input ssh\r\n\r\n Note: Even if SSH is enabled, the IOS device is not protected until telnet access is disabled.\r\n\r\n Configuring a VTY Access Class\r\n\r\n Note: Cisco Catalyst switch platforms that contain any version of the Route Switch Module (RSM), Route Switch Feature Card (RSFC), Multilayer Switch Module (MSM) or Multilayer Switch Feature Card (MSFC) are able to connect to these modules from the switch Supervisor module using the 'session' command. Although the 'session' command uses telnet internally to connect to the MSM/MSFC, it is not restricted by VTY ACLs.\r\n\r\nIt is possible to limit the exposure of the Cisco device by applying a  VTY access class to permit only known, trusted devices to connect to the device  via telnet, reverse telnet and SSH.\r\n\r\nFor more information on restricting traffic to VTYs, please  consult:\r\n\r\n http://www.cisco.com/en/US/products/sw/iosswrel/ps1818/products_configuration_example09186a0080204528.shtml [\"http://www.cisco.com/en/US/products/sw/iosswrel/ps1818/products_configuration_example09186a0080204528.shtml\"]\r\n\r\nThe following example permits access to VTYs from the 192.168.1.0/24  netblock and the single IP address 172.16.1.2 while denying access from  everywhere else:\r\n\r\n\r\n\nRouter(config)# access-list 1 permit 192.168.1.0 0.0.0.255 Router(config)# access-list 1 permit host 172.16.1.2 Router(config)# line vty 0 4 Router(config-line)# access-class 1 in\r\n\r\nFor devices acting as a terminal server, to apply the access class to  reverse telnet ports, the access-list must be configured for the aux port and  terminal lines as well:\r\n\r\n\r\nRouter(config)# line 1 <x>\nRouter(config-line)# access-class 1 in\r\n\r\nDifferent Cisco platforms support different numbers of terminal lines.  Check your device's configuration to determine the correct number of terminal  lines for your platform.\r\n\r\n Configuring Access Lists (ACLs)\r\n\r\nIn addition to configuring a VTY Access Class, it may be desirable to  block all telnet and reverse telnet traffic destined to your network  infrastructure.\r\n\r\nTelnet and reverse telnet should be blocked as part of a Transit ACL  controlling all access to the trusted network. Transit ACLs are considered a  network security best practice and should be considered as a long-term addition  to good network security, as well as a workaround for this specific  vulnerability. The white paper entitled \"Transit Access Control Lists:  Filtering at Your Edge\" presents guidelines and recommended deployment  techniques for transit ACLs:\r\n\r\n http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml\"]\r\n\r\n Configuring Infrastructure Access Lists (iACLs)\r\n\r\nAlthough it is often difficult to block traffic transiting your  network, it is possible to identify traffic which should never be allowed to  target your infrastructure devices and block that traffic at the border of your  network. Infrastructure ACLs are considered a network security best practice  and should be considered as a long-term addition to good network security as  well as a workaround for this specific vulnerability. The white paper entitled  \"Protecting Your Core: Infrastructure Protection Access Control Lists\" presents  guidelines and recommended deployment techniques for infrastructure protection  ACLs:\r\n\r\n http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml\"]\r\n\r\n Configuring Receive Access Lists (rACLs)\r\n\r\nFor distributed platforms, rACLs may be an option starting in Cisco IOS  Software Versions 12.0(21)S2 for the 12000 series GSR and 12.0(24)S for the  7500 series. The receive access lists protect the device from harmful traffic  before the traffic can impact the route processor. Receive path ACLs are  considered a network security best practice, and should be considered as a  long-term addition to good network security, as well as a workaround for this  specific vulnerability. The CPU load is distributed to the line card processors  and helps mitigate load on the main route processor. The white paper entitled  \"GSR: Receive Access Control Lists\" will help identify and allow legitimate  traffic to your device and deny all unwanted packets:\r\n\r\n http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a0a5e.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a0a5e.shtml\"]\r\n\r\n Clearing Hung TCP Connections Using the IOS CLI\r\n\r\nThe who command will show VTY connections to  the device:\r\n\r\n\r\nRouter# who\n    Line       User       Host(s)              Idle       Location    0 con 0                192.168.10.72        00:00:00 *  2 vty 0                idle                 00:00:00 192.168.10.72    3 vty 1                idle                 00:00:04 192.168.10.10\r\n\r\nThe above shows two connections on VTYs, one from 192.168.10.72, and  one from 192.168.10.10. The * indicates which VTY belongs to the current  session. In the above example, the user issuing the who command was connecting  from 192.168.10.72. To clear the session from 192.168.10.10, which is on VTY 1,  the following command is used:\r\n\r\n\r\nRouter# clear tcp line vty 1\n[confirm]  [OK]\r\n\r\n Note: If you are using telnet to connect to the device, accidentally clearing your TCP connection will disconnect your telnet session. If the IOS device has been exploited, it will not be possible to reconnect via telnet. Console access or a device reload will be required to restore service.\r\n\r\n Clearing Hung TCP Connections Using SNMP\r\n\r\nIt is also possible to detect and clear hung TCP connections using  SNMP. To detect a hung connection, an SNMP read-only community string must be  configured on the device. To reset a connection, an SNMP read-write community  string must be configured on the device.\r\n\r\nThe following document describes, in detail, the process of detecting  and clearing hung TCP connections with SNMP:\r\n\r\n http://www.cisco.com/en/US/tech/tk648/tk362/technologies_problem_troubleshooting09186a00802b93ef.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk362/technologies_problem_troubleshooting09186a00802b93ef.shtml\"]"
				}
			],
			"title": "Cisco Telnet Denial of Service Vulnerability"
		}
	]
}
