{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during internal security testing by Keane O'Kelley of the Cisco Advanced Security Initiatives Group (ASIG)."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the Cisco AnyConnect VPN server of Cisco Meraki MX and Cisco Meraki Z Series Teleworker Gateway devices could allow an unauthenticated, remote attacker to hijack an AnyConnect VPN session or cause a denial of service (DoS) condition for individual users of the AnyConnect VPN service on an affected device.\r\n\r\nThis vulnerability is due to weak entropy for handlers that are used during the VPN authentication process as well as a race condition that exists in the same process. An attacker could exploit this vulnerability by correctly guessing an authentication handler and then sending crafted HTTPS requests to an affected device. A successful exploit could allow the attacker to take over the AnyConnect VPN session from a target user or prevent the target user from establishing an AnyConnect VPN session with the affected device.\r\n\r\nCisco Meraki has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "At the time of publication, this vulnerability affected the following Cisco Meraki products if they were running a vulnerable release of Cisco Meraki MX firmware and had Cisco AnyConnect VPN enabled:\r\n\r\nMX64\r\nMX64W\r\nMX65\r\nMX65W\r\nMX67\r\nMX67C\r\nMX67W\r\n\r\nMX68\r\nMX68CW\r\nMX68W\r\nMX75\r\nMX84\r\nMX85\r\nMX95\r\n\r\nMX100\r\nMX105\r\nMX250\r\nMX400\r\nMX450\r\nMX600\r\nvMX\r\n\r\nZ3\r\nZ3C\r\nZ4\r\nZ4C\r\n\r\nNote: Cisco AnyConnect VPN is supported on Cisco Meraki MX Series and Cisco Meraki Z Series Teleworker Gateway devices that run Cisco Meraki MX firmware releases 16.2 and later, except for Cisco Meraki MX64 and MX65, which support Cisco AnyConnect VPN only if they are running Cisco Meraki MX firmware releases 17.6 and later.\r\n\r\nFor information about which Cisco software releases were vulnerable at the time of publication, see the Fixed Software [\"#fs\"] section of this advisory.\r\n  Determine Whether Cisco AnyConnect VPN Is Enabled on Cisco Meraki MX Devices\r\nTo determine whether Cisco AnyConnect VPN is enabled on a Cisco Meraki MX device, complete the following steps:\r\n\r\nLog in to the Dashboard.\r\nChoose Security Appliance > Configure > Client VPN in the combined view.\r\nChoose the AnyConnect Settings tab.\r\n\r\nIf the Enabled radio button is selected, the device is configured to support Cisco AnyConnect VPN.\r\n\r\nIf the Cisco AnyConnect Settings tab is not displayed, or if the Disabled radio button is selected, the device is not impacted by this vulnerability.\r\n  Determine Whether Cisco AnyConnect VPN Is Enabled on Cisco Meraki Z Series Teleworker Gateway Devices\r\nTo determine whether Cisco AnyConnect VPN is enabled on a Cisco Meraki MX device, complete the following steps:\r\n\r\nLog in to the Dashboard.\r\nChoose Teleworker gateway > Configure > Client VPN in the combined view.\r\nChoose the AnyConnect Settings tab.\r\n\r\nIf the Enabled radio button is selected, the device is configured to support Cisco AnyConnect VPN.\r\n\r\nIf the Cisco AnyConnect Settings tab is not displayed, or if the Disabled radio button is selected, the device is not impacted by this vulnerability.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by these vulnerabilities.\r\n\r\nCisco has confirmed that these vulnerabilities do not affect the following Cisco products:\r\n\r\nMeraki Z1\r\nAdaptive Security Appliance (ASA) Software\r\nFirepower Threat Defense (FTD) Software\r\nIOS Software\r\nIOS XE Software",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability. Cisco Meraki recommends that administrators upgrade devices to a fixed software release.\r\n\r\nHowever, disabling Cisco AnyConnect VPN will remove the attack vector for the vulnerability that is described in this advisory.\r\n\r\nWhile this mitigation has been deployed and was proven successful in a test environment, customers should determine the applicability and effectiveness in their own environment and under their own use conditions. Customers should be aware that any workaround or mitigation that is implemented may negatively impact the functionality or performance of their network based on intrinsic customer deployment scenarios and limitations. Customers should not deploy any workarounds or mitigations before first evaluating the applicability to their own environment and any impact to such environment.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n      Fixed Releases\r\nAt the time of publication, the release information in the following table was accurate.\r\n\r\nThe left column lists Cisco Meraki software releases, and the right column indicates whether a release was affected by the vulnerability that is described in this advisory and which release included the fix for this vulnerability.\r\n        Cisco Meraki MX Firmware Release  First Fixed Release          Earlier than 16.2  Not affected.      16.2 and later  Migrate to a fixed release.      17.0 and later  Migrate to a fixed release.      18.0 and later  18.211.3\r\nNote: Cisco Meraki MX64 and MX65 are affected only when they are running Cisco Meraki MX firmware releases 17.6 and later.\r\n\r\nThe Cisco Product Security Incident Response Team (PSIRT) validates only the affected and fixed release information that is documented in this advisory.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "Neither the Cisco PSIRT nor the Cisco Meraki Incident Response Team is aware of any malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during internal security testing by Keane O'Kelley of the Cisco Advanced Security Initiatives Group (ASIG).",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Meraki MX and Z Series Teleworker Gateway AnyConnect VPN Session Takeover and Denial of Service Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-meraki-mx-vpn-dos-by-QWUkqV7X"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco Meraki MX and Z Series Teleworker Gateway AnyConnect VPN Session Takeover and Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2024-10-02T16:00:00+00:00",
			"generator": {
				"date": "2024-10-02T15:56:44+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-meraki-mx-vpn-dos-by-QWUkqV7X",
			"initial_release_date": "2024-10-02T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2024-10-02T15:56:00+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Meraki MX Firmware",
						"product": {
							"name": "Cisco Meraki MX Firmware ",
							"product_id": "CSAFPID-204724"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2024-20509",
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-204724"
				]
			},
			"release_date": "2024-10-02T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-204724"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 5.8,
						"baseSeverity": "MEDIUM",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:L",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-204724"
					]
				}
			],
			"title": "Cisco Meraki MX and Z3 Teleworker Gateway AnyConnect VPN Session Takeover and Denial of Service Vulnerability"
		}
	]
}
