{
	"document": {
		"category": "csaf_informational_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "In early May 2024, Cisco identified bugs in Cisco Webex Meetings that we now believe were leveraged in targeted security research activity allowing unauthorized access to meeting information and metadata in Cisco Webex deployments for certain customers. These bugs have been addressed and a fix has been fully implemented worldwide as of May 28, 2024.\r\n\r\nCisco has notified those customers who we identified as being affected by this activity based on available access logs. Because we strive to retain access logs only as long as necessary to deliver the service and comply with applicable records retention requirements and data protection limits, our access logs are not retained indefinitely and are deleted on a rolling basis. Cisco does not have available access logs on the data set before May 6, 2024.\r\n\r\nSince the bugs were patched, Cisco has not observed any further successful attempts to obtain new meeting data or metadata leveraging the bugs.\r\n\r\nOur investigation is still ongoing, and Cisco is providing the following updates:\r\n\r\nCisco believes with high confidence that the same actor involved in targeted research activity obtained a larger data set of meeting data prior to May 6, 2024.\r\nCisco has been notified by a limited number of customers of successful attempts to dial into meetings from the Public Switched Telephone Network (PSTN) using meeting data that was retrieved prior to the deployment of bug fixes.\r\nIn a successful PSTN dial-in, the actor identified themselves and stated the effort was to support security research.\r\n\r\nCisco recommends that customers who have PSTN enabled for their scheduled meetings verify that they require passcodes for dial-in users. If not previously enabled, enabling a passcode will require the host to re-send the meeting invitation with the new passcode.\r\n\r\nFor customers who have Personal Meeting Rooms (PMR) configured, Cisco recommends that customers verify that their lobby feature is enabled and configured as recommended in our best practices guidance (see below). This will require unauthenticated and external meeting participants to wait in a virtual lobby unless and until the host directly admits them to the meeting.\r\n\r\nCustomers are advised to review meeting information and metadata that may have been obtained before the bug fix was fully implemented worldwide as of May 28, 2024, and assess the risk for their deployments.\r\n\r\nCisco Webex Meetings customers should continue to monitor regular support channels for further communication and are encouraged to use those channels for further questions. As always, Cisco will communicate through established channels.\r\n\r\nCisco welcomes the opportunity to engage with customers and the security community to enhance security across the industry.\r\n\r\nFor a detailed list of security capabilities for Personal Meeting Rooms, the PSTN dial-in option for Cisco Webex Meeting hosts, and Cisco Webex administrators, see Best practices for secure meetings: hosts [\"https://help.webex.com/en-us/article/8zi8tq/Best-practices-for-secure-meetings:-hosts\"] and Webex best practices for secure meetings: Control Hub. [\"https://help.webex.com/en-us/article/ov50hy/Webex-best-practices-for-secure-meetings:-Control-Hub\"]\r\n\r\nObtaining Additional Support\r\nFor general security and support concerns about Cisco products and cloud-hosted services, the Cisco Technical Assistance Center (TAC) can provide configuration and technical assistance. The Cisco TAC can also help with nonsensitive security incidents and software upgrades for security bug fixes. TAC Support Worldwide contact information. [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "A workaround is not needed; the issue is corrected.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME. CISCO EXPECTS TO UPDATE THIS DOCUMENT AS NEW INFORMATION BECOMES AVAILABLE.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Webex Meetings Meeting Information and Metadata Issue June 2024",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-webex-june-2024"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "Best practices for secure meetings: hosts",
				"url": "https://help.webex.com/en-us/article/8zi8tq/Best-practices-for-secure-meetings:-hosts"
			},
			{
				"category": "external",
				"summary": "Webex best practices for secure meetings: Control Hub.",
				"url": "https://help.webex.com/en-us/article/ov50hy/Webex-best-practices-for-secure-meetings:-Control-Hub"
			},
			{
				"category": "external",
				"summary": "TAC Support Worldwide contact information.",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco Webex Meetings Meeting Information and Metadata Issue June 2024",
		"tracking": {
			"current_release_date": "2024-06-11T19:41:36+00:00",
			"generator": {
				"date": "2024-06-11T19:42:46+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-webex-june-2024",
			"initial_release_date": "2024-06-04T21:00:00+00:00",
			"revision_history": [
				{
					"date": "2024-06-04T21:09:02+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2024-06-05T20:30:21+00:00",
					"number": "1.1.0",
					"summary": "Updated summary."
				},
				{
					"date": "2024-06-11T19:21:34+00:00",
					"number": "1.2.0",
					"summary": "Updated summary."
				},
				{
					"date": "2024-06-11T19:41:36+00:00",
					"number": "1.3.0",
					"summary": "Adjusted Last Update time."
				}
			],
			"status": "interim",
			"version": "1.3.0"
		}
	},
	"product_tree": {}
}
