{
	"document": {
		"acknowledgments": [
			{
				"summary": "Cisco would like to thank Bekir KAYA of Secunnix for reporting this vulnerability."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the web UI of Cisco Desk Phone 9800 Series, Cisco IP Phone 7800 and 8800 Series, and Cisco Video Phone 8875 could allow an unauthenticated, remote attacker to access sensitive information on an affected device.\r\n\r\nThis vulnerability is due to improper storage of sensitive information within the web UI of Session Initiation Protocol (SIP)-based phone loads. An attacker could exploit this vulnerability by browsing to the IP address of a device that has Web Access enabled. A successful exploit could allow the attacker to access sensitive information, including incoming and outgoing call records.\r\n\r\nNote: Web Access is disabled by default.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "At the time of publication, this vulnerability affected the following Cisco products if they were running a vulnerable release of Cisco SIP IP Phone Software and had Web Access enabled:\r\n\r\nDesk Phone 9800 Series\r\nIP Phone 7800 Series\r\nIP Phone 8800 Series (except Cisco Wireless IP Phone 8821)\r\nVideo Phone 8875\r\n\r\nThe Web Access feature is disabled by default.\r\n\r\nFor information about which Cisco software releases were vulnerable at the time of publication, see the Fixed Software [\"#fs\"] section of this advisory. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.\r\n  Determine Whether Web Access Is Enabled\r\nWeb Access is disabled by default on Cisco phones. If a user can browse to the IP address listed in the phone configuration by following these steps, Web Access has been enabled:\r\n\r\nChoose the gear icon on the front of the phone to access the phone configuration and determine the IP address of the phone.\r\nChoose Admin settings > Network Setup > Ethernet setup or Wi-Fi client setup > IPv4 setup.\r\nType the IP address in a browser window and click Enter.\r\n\r\nIf the Device Information screen is displayed, then Web Access is enabled on the phone.\r\n\r\nTo enable or disable Web Access, follow these steps:\r\n\r\n\r\nLog in to the Communications Manager to which the phone is registered using Admin privileges, which allow modification of devices.\r\nChoose Device > Phone.\r\nType in the search criteria and choose Find.\r\nChoose the appropriate device from the Device Name list.\r\nScroll down to Web Access, toggle between Enabled or Disabled as desired, and click Save.\r\nVerify that the desired state has been set by typing the IP address into a browser window and clicking Enter.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect Cisco IP Phone 7800 Series or 8800 Series phones that are running Cisco Multiplatform Firmware.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n      Fixed Releases\r\nAt the time of publication, the release information in the following tables was accurate. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.\r\n\r\nThe left column lists Cisco software releases, and the right column indicates whether a release was affected by the vulnerability that is described in this advisory and which release included the fix for this vulnerability.\r\n\r\nDesk Phone 9800 Series\r\n        Cisco SIP IP Phone Software Release  First Fixed Release          3.1(1)  3.2(1)\r\n      3.1(1)SR1  3.2(1)\r\nIP Phone 7800 and 8800 Series\r\n           Cisco SIP IP Phone Software Release  First Fixed Release          Earlier than 14.3  Migrate to a fixed release.      14.3  14.3(1)\r\nVideo Phone 8875\r\n        Cisco SIP IP Phone Software Release  First Fixed Release          2.3(1)SR1 and earlier  Migrate to a fixed release.      3.2(1)  Not vulnerable.\r\nThe Cisco Product Security Incident Response Team (PSIRT) validates only the affected and fixed release information that is documented in this advisory.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "Cisco would like to thank Bekir KAYA of Secunnix for reporting this vulnerability.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco 7800, 8800, and 9800 Series Phones Information Disclosure Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-phone-infodisc-sbyqQVbG"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco 7800, 8800, and 9800 Series Phones Information Disclosure Vulnerability",
		"tracking": {
			"current_release_date": "2024-11-06T16:00:00+00:00",
			"generator": {
				"date": "2024-11-06T15:52:30+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-phone-infodisc-sbyqQVbG",
			"initial_release_date": "2024-11-06T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2024-11-06T15:51:54+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Session Initiation Protocol (SIP) Software",
						"product": {
							"name": "Cisco Session Initiation Protocol (SIP) Software ",
							"product_id": "CSAFPID-277608"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2024-20445",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCwk25862"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCwk25869"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCwk25863"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCwk32410"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-277608"
				]
			},
			"release_date": "2024-11-06T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-277608"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 5.3,
						"baseSeverity": "MEDIUM",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-277608"
					]
				}
			],
			"title": "Cisco IP Phone 7800, 8800, and 9800 Series Information Disclosure Vulnerability"
		}
	]
}
