{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during internal security testing."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the web proxy functionality of Cisco AsyncOS Software for Cisco Web Security Appliances could allow an unauthenticated, remote attacker to exhaust system memory and cause a denial of service (DoS) condition on an affected system.\r\n\r\nThe vulnerability exists because the affected software improperly manages memory resources for TCP connections to a targeted device. An attacker could exploit this vulnerability by establishing a high number of TCP connections to the data interface of an affected device via IPv4 or IPv6. A successful exploit could allow the attacker to exhaust system memory, which could cause the system to stop processing new connections and result in a DoS condition. System recovery may require manual intervention.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nThis advisory is available at the following link:\r\nhttps://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180815-wsa-dos [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180815-wsa-dos\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects Cisco AsyncOS Software Releases 9.1, 10.1, 10.5, and 11.0 for Cisco Web Security Appliances, both virtual and hardware appliances, if the HTTPS Proxy feature is enabled. By default, the HTTPS Proxy feature is disabled.\r\n\r\nFor more information about which Cisco AsyncOS Software releases are vulnerable, see the Fixed Software [\"#fs\"] section of this advisory.\r\n\r\nTo determine whether a vulnerable release of Cisco AsyncOS Software is running on a Cisco Web Security Appliance (WSA), administrators can use the version command in the WSA CLI. The following example shows the output of the command for a WSA that is running Cisco AsyncOS Software Release 10.5.2-072:\r\n\r\n\r\nciscowsa> version\r\nCurrent Version\r\n===============\r\nProduct: Cisco S670 Web Security Appliance\r\nModel: S670\r\nVersion: 10.5.2-072\r\n.  .  .\r\n\r\nTo determine whether the HTTPS Proxy feature is enabled for a WSA, administrators can log in to the web interface of the WSA  and navigate to Security Services > HTTPS Proxy. The value in the HTTPS Proxy field indicates whether the feature is enabled or disabled.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect the following Cisco products:\r\n\r\nEmail Security Appliance (ESA), both virtual and hardware appliances\r\nSecurity Management Appliance (SMA), both virtual and hardware appliances",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Exploitation of this vulnerability will cause the affected software to stop releasing memory resources that were allocated to established TCP connections, which could exhaust system memory on a device.\r\n\r\nAdministrators can assess the current status of device connections by using the netstat command in the device CLI. If the output of the command indicates an accumulation of TCP connections in the CLOSE_WAIT state, the device may be affected by this vulnerability. The following example shows the output of the netstat command for a device that has not released memory resources for several TCP connections running over IPv4 and IPv6, respectively:\r\n\r\n\r\nciscowsa> netstat\r\n  .\r\n.\r\n.\r\nActive Internet connections (including servers)\r\nProto Recv-Q Send-Q Local Address          Foreign Address        (state)\r\ntcp4       0      0 127.0.0.1.25255        127.0.0.1.36586        TIME_WAIT\r\ntcp4     112      0 127.0.0.1.443          127.0.0.1.9310         CLOSE_WAIT\r\ntcp4       0      0 127.0.0.1.9310         127.0.0.1.443          FIN_WAIT_2\r\ntcp4       0      0 127.0.0.1.25255        127.0.0.1.21834        TIME_WAIT\r\ntcp4     112      0 127.0.0.1.443          127.0.0.1.36782        CLOSE_WAIT\r\ntcp4       0      0 10.1.1.51.32969        1.1.1.1.443            ESTABLISHED\r\ntcp6     112      0 ::1.443                ::1.48808              CLOSE_WAIT\r\ntcp4       0      0 10.1.1.51.443          *.*                    LISTEN\r\ntcp6       0      0 ::1.443                *.*                    LISTEN\r\ntcp4       0      0 127.0.0.1.443          *.*                    LISTEN\r\n.\r\n.\r\n.\r\n\r\nTo recover memory resources on a device, administrators can reboot the device or restart the web proxy process. To restart the web proxy process, administrators can use the hidden diagnostic > PROXY > kick command in the device CLI, for example:\r\n\r\n\r\nciscowsa> diagnostic\r\n  Choose the operation you want to perform:\r\n- NET - Network Diagnostic Utility.\r\n- PROXY - Proxy Debugging Utility.\r\n- REPORTING - Reporting Utilities.\r\n[]> proxy\r\n\r\n- SNAP    - Take a snapshot of the proxy\r\n- OFFLINE - Take the proxy offline (via WCCP)\r\n- RESUME  - Resume proxy traffic via (via WCCP)\r\n- CACHE   - Clear proxy cache\r\n[]> kick\r\nKick the proxy?\r\nAre you sure you want to proceed? [N]> Y\r\n\r\nNote that web proxy services will be temporarily unavailable while the web proxy process restarts.",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n  Customers Without Service Contracts\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttps://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n  Fixed Releases\r\nCustomers are advised to upgrade to an appropriate release as indicated in the following table:\r\n                                Cisco AsyncOS Software Major Release              First Fixed Release                                              Prior to 9.1                            Migrate to 10.1.3-054 or later                                                9.1                            Migrate to 10.1.3-054 or later                                                10.1                            10.1.3-054                                                10.5                            10.5.2-072                                                11.0                            11.5.0-614                                                11.5                          Not vulnerable\r\nIn most cases, the software can be upgraded over the network by using the System Upgrade options in the web interface of the WSA. To upgrade a device by using the web interface:\r\n\r\nChoose System Administration > System Upgrade.\r\nClick Upgrade Options.\r\nChoose Download and Install.\r\nChoose the release to upgrade to.\r\nIn the Upgrade Preparation area, choose the appropriate options.\r\nClick Proceed to begin the upgrade. A progress bar displays the status of the upgrade.\r\n\r\nAfter the upgrade is complete, the device reboots.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during internal security testing.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Web Security Appliance Web Proxy Memory Exhaustion Denial of Service Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180815-wsa-dos"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180815-wsa-dos",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180815-wsa-dos"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco Web Security Appliance Web Proxy Memory Exhaustion Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2018-08-15T16:00:00+00:00",
			"generator": {
				"date": "2022-09-03T03:07:31+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20180815-wsa-dos",
			"initial_release_date": "2018-08-15T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2018-08-15T16:05:58+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Web Security Appliance (WSA)",
						"product": {
							"name": "Cisco Web Security Appliance (WSA) ",
							"product_id": "CSAFPID-189789"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2018-0410",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvf36610"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-189789"
				]
			},
			"release_date": "2018-08-15T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-189789"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 8.6,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-189789"
					]
				}
			],
			"title": "Cisco Web Security Appliance Web Proxy Memory Exhaustion Denial of Service Vulnerability"
		}
	]
}
