{
	"document": {
		"acknowledgments": [
			{
				"summary": "These vulnerabilities were reported to Cisco by Fortinet and Trend Micro as follows:\r\n                                Cisco Bug IDs\r\n              Reporter                                  CSCvi02621, CSCvi02965\r\n              Kushal Arvind Shah of Fortinet's FortiGuard Labs\r\n                                  CSCvi63329, CSCvi63333, CSCvi63335, CSCvi63374, CSCvi63376, CSCvi63377, CSCvi63391, CSCvi63392, CSCvi63396, CSCvi82684, CSCvi82700, CSCvi82705, CSCvi82725, CSCvi82737, CSCvi82742, CSCvj51284, CSCvj51294\r\n              b0nd working with Trend Micro's Zero Day Initiative                                  CSCvi63495, CSCvi63497, CSCvi63498, CSCvi82760, CSCvi82771\r\n              Steven Seeley of Source Incite working with Trend Micro's Zero Day Initiative"
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Multiple vulnerabilities exist in the Cisco Webex Network Recording Player for Advanced Recording Format (ARF) and Webex Recording Format (WRF) files. An attacker could exploit these vulnerabilities by providing a user with a malicious .arf or .wrf file via email or URL and convincing the user to launch the file in the Webex recording players. Exploitation of these vulnerabilities could allow arbitrary code execution on the system of a targeted user. There is no risk when a .arf player that is stored on a Webex site is played in the Webex Network Recording Player.\r\n\r\nThe Cisco Webex players are applications that are used to play back Webex meetings that have been recorded by an online meeting attendee. The Webex Network Recording Player for .arf files can be automatically installed when the user accesses a recording that is hosted on a Webex server. The Webex Player for .wrf files can be downloaded manually.\r\n\r\n\r\nCisco has updated affected versions of the ARF and WRF recording players on Cisco Webex Meetings Suite sites, Cisco Webex Meetings Online sites, and Cisco Webex Meetings Server. There are no workarounds that address these vulnerabilities.\r\n\r\nThis advisory is available at the following link:\r\nhttps://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180718-webex-rce [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180718-webex-rce\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "These vulnerabilities affect ARF and WRF recording players available from Cisco Webex Meetings Suite sites, Cisco Webex Meetings Online sites, and Cisco Webex Meetings Server. The following versions of ARF and WRF recording players are affected:\r\n\r\nCisco Webex Meetings Suite (WBS31) - Webex Network Recording Player and Webex Player versions prior to WBS31.23\r\nCisco Webex Meetings Suite (WBS32) - Webex Network Recording Player and Webex Player versions prior to WBS32.15\r\nCisco Webex Meetings Suite (WBS33) - Webex Network Recording Player and Webex Player versions prior to WBS33.2\r\nCisco Webex Meetings Online - Webex Network Recording Player and WebEx Player versions prior to 1.3.35\r\nCisco Webex Meetings Server - Webex Network Recording Player versions prior to 3.0MR1\r\n  To determine which version of the Cisco Webex Network Recording Player (for .arf files) or the Cisco Webex Player (for .wrf files) is installed, users can open the player and select the Help > About menu.\r\n\r\nNote: Customers who do not receive automatic software updates may be running versions of Cisco Webex Meetings that have reached end of software maintenance and should contact customer support.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The Cisco Webex Meetings Suite services and Cisco WebEx Meetings Online are hosted multimedia conferencing solutions that are managed and maintained by Cisco Webex. Cisco Webex Meetings Server is a multimedia conferencing solution that customers can host in their private clouds.\r\n\r\nCisco Webex Meetings services can be configured to allow recording of a meeting that is stored online and can be downloaded by a user in ARF format. These services can also record meetings directly on local computers in WRF format. The Cisco Webex Network Recording Player plays .arf files and the Cisco Webex Player plays .wrf files.\r\n\r\nThe Network Recording Player can be automatically installed when a user accesses a recording file that is hosted on a Cisco Webex Meetings Suite site (for streaming playback mode). The Cisco Webex Network Recording Player can also be installed manually. The Cisco Webex Player can only be manually installed from the Webex site.\r\n\r\nThe Cisco Webex Network Recording Player for .arf files is available for Cisco Webex Meetings Suite (WBS31, WBS32, WBS33), Cisco Webex Meetings Online, and for Cisco Webex Meetings Server. The Cisco Webex Player for .wrf files is only available for Cisco  Webex Meetings Suite (WBS31, WBS32, and WBS33) and Cisco Webex Meetings Online. The Cisco Webex Player for .wrf files is not available for Cisco Webex Meetings Server.\r\n\r\nThe vulnerabilities disclosed in this advisory affect the Cisco Webex Network Recording Player and the Cisco Webex Player. Windows, OS X, and Linux versions of the players are all affected by at least one vulnerability described in this advisory.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address these vulnerabilities. However, it is possible to remove the affected Cisco Webex Network Recording Player and Cisco Webex Player by following the uninstall procedure for the operating system. For example, in Windows, use Add or Remove Programs to uninstall the affected players.\r\n\r\nTo remove Webex software completely from a system, use the Meeting Services Removal Tool (for Microsoft Windows users) or Mac Webex Meeting Application Uninstaller (for Apple Mac OS X users), available for download from the Cisco Collaboration Help article Cisco WebEx and 3rd Party Support Utilities [\"https://collaborationhelp.cisco.com/article/en-us/WBX000026396\"].\r\n\r\nRemoval of the Webex software from a Linux or UNIX-based system can be accomplished by following the steps in the Cisco Collaboration Help article How Do I Uninstall WebEx Software on a Linux or Unix Based System? [\"https://collaborationhelp.cisco.com/article/en-us/WBX28548\"].",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttps://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n  Fixed Releases  The following versions of the Cisco Webex Network Recording Player and the Cisco Webex Player available from the Cisco Webex Meetings Suite sites (WBS31, WBS32, WBS33), Cisco Webex Meetings Online site, and Cisco Webex Meetings Server address all the vulnerabilities described in this advisory:\r\n\r\nCisco Webex Meetings Suite (WBS31) - Cisco Webex Network Recording Player and Cisco Webex Player versions WBS31.23 and later\r\nCisco Webex Meetings Suite (WBS32) - Cisco Webex Network Recording Player and Cisco Webex Player versions WBS32.15 and later\r\nCisco Webex Meetings Suite (WBS33) - Cisco Webex Network Recording Player and Cisco Webex Player versions WBS33.2 and later\r\nCisco Webex Meetings Online - Webex Network Recording Player and WebEx Player versions 1.3.35 and later\r\nCisco Webex Meetings Server - Webex Network Recording Player versions 3.0MR1 and later\r\n\r\nAlternatively, the latest versions of the ARF and WRF players are available from http://www.webex.com/play-webex-recording.html [\"http://www.webex.com/play-webex-recording.html\"].\r\n\r\nTo determine whether a Cisco Webex meeting site has an updated version of the Cisco Webex Players, users can sign into their Cisco Webex Meetings site and go to the Support > Downloads section. The version is displayed on the right side of the page under About Webex Meetings.\r\n\r\nThe Cisco Webex Network Recording Player (for .arf files) will be automatically upgraded to the latest, nonvulnerable version when users access a recording file that is hosted on a Cisco Webex Meetings site that contains the versions previously specified. Users will need to manually uninstall the Cisco Webex Player and get the updated version of the Cisco Webex Player from http://www.webex.com/play-webex-recording.html [\"http://www.webex.com/play-webex-recording.html\"] or from a Cisco Webex Meetings site specified previously.\r\n\r\nNote: Customers on lockdown sites will not automatically get updated versions of the Cisco Webex Network Recording Player and Cisco Webex Player. Contact Webex Support to update a Cisco Webex site and get the updated version of the Cisco Webex Recording Players from http://www.webex.com/play-webex-recording.html [\"http://www.webex.com/play-webex-recording.html\"].\r\n                                Cisco Bug ID              First Fixed Release                                  WBS31              WBS32              WBS33              Webex Meetings Online              Webex Meetings Server                                   CSCvi02621               31.23               32.15               33.2                                                                 CSCvi02965                                                            1.3.35                                                  CSCvi63329               31.23               32.15               33.2                                                                 CSCvi63333                                                                           3.0MR1                                   CSCvi63335                                                            1.3.35                                                  CSCvi63374               31.23               32.15               33.2                                                                 CSCvi63376                                                                           3.0MR1                                   CSCvi63377                                                            1.3.35                                                  CSCvi63391               31.23               32.15\r\n 33.0.6\r\n               33.1.1\r\n               33.2\r\n                                                                               CSCvi63392                                                                           3.0MR1                                   CSCvi63396                                                            1.3.35                                                  CSCvi63495               31.23               32.15               33.2                                                                 CSCvi63497                                                                           3.0MR1                                   CSCvi63498                                                            1.3.35                                                  CSCvi82684               31.23                              33.2                                                                 CSCvi82700                                                                           3.0MR1                                   CSCvi82705                                                            1.3.35                                                  CSCvi82725               31.23               32.15               33.2                                                                 CSCvi82737                                                                           3.0MR1                                   CSCvi82742                                                            1.3.35                                                  CSCvi82760               31.23               32.15               33.2                                                                 CSCvi82771                                                            1.3.35                                                  CSCvj51284                              32.15               33.2\r\n                                                                 CSCvj51294                                                            1.3.35",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "These vulnerabilities were reported to Cisco by Fortinet and Trend Micro as follows:\r\n                                Cisco Bug IDs\r\n              Reporter                                  CSCvi02621, CSCvi02965\r\n              Kushal Arvind Shah of Fortinet's FortiGuard Labs\r\n                                  CSCvi63329, CSCvi63333, CSCvi63335, CSCvi63374, CSCvi63376, CSCvi63377, CSCvi63391, CSCvi63392, CSCvi63396, CSCvi82684, CSCvi82700, CSCvi82705, CSCvi82725, CSCvi82737, CSCvi82742, CSCvj51284, CSCvj51294\r\n              b0nd working with Trend Micro's Zero Day Initiative                                  CSCvi63495, CSCvi63497, CSCvi63498, CSCvi82760, CSCvi82771\r\n              Steven Seeley of Source Incite working with Trend Micro's Zero Day Initiative",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Webex Network Recording Players Remote Code Execution Vulnerabilities",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180718-webex-rce"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180718-webex-rce",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180718-webex-rce"
			},
			{
				"category": "external",
				"summary": "Cisco WebEx and 3rd Party Support Utilities",
				"url": "https://collaborationhelp.cisco.com/article/en-us/WBX000026396"
			},
			{
				"category": "external",
				"summary": "How Do I Uninstall WebEx Software on a Linux or Unix Based System?",
				"url": "https://collaborationhelp.cisco.com/article/en-us/WBX28548"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			},
			{
				"category": "external",
				"summary": "http://www.webex.com/play-webex-recording.html",
				"url": "http://www.webex.com/play-webex-recording.html"
			},
			{
				"category": "external",
				"summary": "http://www.webex.com/play-webex-recording.html",
				"url": "http://www.webex.com/play-webex-recording.html"
			},
			{
				"category": "external",
				"summary": "http://www.webex.com/play-webex-recording.html",
				"url": "http://www.webex.com/play-webex-recording.html"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco Webex Network Recording Players Remote Code Execution Vulnerabilities",
		"tracking": {
			"current_release_date": "2018-07-18T16:00:00+00:00",
			"generator": {
				"date": "2022-09-03T03:01:10+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20180718-webex-rce",
			"initial_release_date": "2018-07-18T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2018-07-18T14:37:16+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco WebEx WRF Player",
						"product": {
							"name": "Cisco WebEx WRF Player ",
							"product_id": "CSAFPID-96064"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx ARF Player",
						"product": {
							"name": "Cisco WebEx ARF Player ",
							"product_id": "CSAFPID-100455"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi02621"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi02965"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63374"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63376"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63377"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63495"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63497"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63498"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63329"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63333"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63335"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63391"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63392"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63396"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82725"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82737"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82742"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82684"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82700"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82705"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82760"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82771"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvj51284"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvj51294"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-100455",
					"CSAFPID-96064"
				]
			},
			"release_date": "2018-07-18T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-96064",
						"CSAFPID-100455"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 7.8,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-100455",
						"CSAFPID-96064"
					]
				}
			],
			"title": "Cisco Webex Network Recording Player Remote Code Execution Vulnerabilities"
		},
		{
			"cve": "CVE-2018-0379",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi02621"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi02965"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63374"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63376"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63377"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63495"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63497"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63498"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63329"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63333"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63335"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63391"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63392"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi63396"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82725"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82737"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82742"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82684"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82700"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82705"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82760"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi82771"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvj51284"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvj51294"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-100455",
					"CSAFPID-96064"
				]
			},
			"release_date": "2018-07-18T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-96064",
						"CSAFPID-100455"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 7.8,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-100455",
						"CSAFPID-96064"
					]
				}
			],
			"title": "Cisco Webex Network Recording Player Remote Code Execution Vulnerabilities"
		}
	]
}
