{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during the resolution of a Cisco TAC support case."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in traffic-monitoring functions in Cisco Web Security Appliance (WSA) could allow an unauthenticated, remote attacker to circumvent Layer 4 Traffic Monitor (L4TM) functionality and bypass security protections.\r\n\r\nThe vulnerability is due to a change in the underlying operating system software that is responsible for monitoring affected traffic. An attacker could exploit this vulnerability by sending crafted IP packets to an affected device. A successful exploit could allow the attacker to pass traffic through the device, which the WSA was configured to deny. This vulnerability affects both IPv4 and IPv6 traffic.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nThis advisory is available at the following link:\r\nhttps://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-wsa [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-wsa\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects Cisco AsyncOS versions for WSA on both virtual and hardware appliances running any release of the 10.5.1, 10.5.2, or 11.0.0 WSA Software. See the Fixed Software [\"#fs\"] section of this security advisory for additional information about affected software releases.\r\n\r\nThe WSA is vulnerable if it is configured for L4TM. To check whether a WSA is configured for L4TM, administrators can navigate to the L4 Traffic Monitor configuration settings:\r\n\r\n      Click Security Services > L4 Traffic Monitor\r\n      Click Edit Global Settings\r\n      Check Enable L4 Traffic Monitor and select the required ports\r\n  Determining the WSA Software Version\r\n  To determine whether a vulnerable version of Cisco AsyncOS Software is running on a Cisco WSA, administrators can use the version command in the WSA CLI. The following example shows the results for an appliance running Cisco AsyncOS Software version 10.5.1-296:\r\n\r\n\r\nciscowsa> version\r\n\r\n\r\nCurrent Version\r\n===============\r\nProduct: Cisco IronPort S670 Web Security Appliance\r\nModel: S670\r\nVersion: 10.5.1-296\r\n.\r\n.\r\n.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect the following Cisco products:\r\n\r\nEmail Security Appliance (ESA), both virtual and hardware versions\r\nSecurity Mail Appliance (SMA), both virtual and hardware versions",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:  https://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC: https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n  Fixed Releases\r\nIn the following table, the left column lists major releases of Cisco AsyncOS for WSA Software. The right column indicates whether a major release is affected by the vulnerability described in this advisory and the first minor release that includes the fix for this vulnerability.\r\n\r\n  Customers should upgrade to an appropriate release as indicated in the following table:\r\n                                Cisco AsyncOS WSA Software Major Release              First Fixed Release for This Vulnerability                                              Prior to 10.5.1\r\n              Not vulnerable\r\n                                  10.5.1\r\n              10.5.2-042\r\n                                  10.5.2               10.5.2-042                                  11.0.0               11.5.0-0614\r\nIn most cases, a WSA can be updated over the network by using the System Upgrade options in the System Administration GUI. To upgrade a device by using the System Administration GUI:\r\n\r\n      Choose System Administration > System Upgrade.\r\n      Click Upgrade Options.\r\n      Choose Download and Install.\r\n      Choose the release to upgrade to.\r\n      In the Upgrade Preparation area, choose the appropriate options.\r\n      Click Proceed to begin the upgrade. A progress bar displays the status of the upgrade.\r\n\r\n  After the upgrade is complete, the device reboots.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during the resolution of a Cisco TAC support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Web Security Appliance Layer 4 Traffic Monitor Security Bypass Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-wsa"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-wsa",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-wsa"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco Web Security Appliance Layer 4 Traffic Monitor Security Bypass Vulnerability",
		"tracking": {
			"current_release_date": "2018-06-08T14:26:00+00:00",
			"generator": {
				"date": "2022-09-03T03:01:06+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20180606-wsa",
			"initial_release_date": "2018-06-06T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2018-06-06T14:33:03+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2018-06-08T14:26:30+00:00",
					"number": "1.1.0",
					"summary": "Updated fixed release information to reflect availability of Release 10.5.2-042."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Web Security Appliance (WSA)",
						"product": {
							"name": "Cisco Web Security Appliance (WSA) ",
							"product_id": "CSAFPID-189789"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2018-0353",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvg78875"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-189789"
				]
			},
			"release_date": "2018-06-06T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-189789"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 7.5,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-189789"
					]
				}
			],
			"title": "Cisco Web Security Appliance Layer 4 Traffic Monitor Security Bypass Vulnerability"
		}
	]
}
