{
	"document": {
		"acknowledgments": [
			{
				"summary": "Cisco would like to thank Kushal Arvind Shah of Fortinet’s FortiGuard Labs for reporting this vulnerability."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the Cisco WebEx Network Recording Player for Advanced Recording Format (ARF) files could allow an unauthenticated, remote attacker to execute arbitrary code on the system of a targeted user.\r\n\r\nAn attacker could exploit this vulnerability by sending the user a link or email attachment with a malicious ARF file and persuading the user to follow the link or open the file. Successful exploitation could allow the attacker to execute arbitrary code on the user’s system.\r\n\r\nThe Cisco WebEx players are applications that are used to play back WebEx meeting recordings that have been recorded by an online meeting attendee. The player can be installed automatically when a user accesses a recording file that is hosted on a WebEx server.\r\n\r\nCisco has updated affected versions of Cisco WebEx Business Suite meeting sites, Cisco WebEx Meetings sites, Cisco WebEx Meetings Server, and the Cisco WebEx ARF Player to address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\n  This advisory is available at the following link:\r\nhttps://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180502-war [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180502-war\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects Cisco WebEx Business Suite meeting sites, Cisco WebEx Meetings sites, Cisco WebEx Meetings Server, and Cisco WebEx ARF players. The following client builds of Cisco WebEx Business Suite (WBS31 and WBS32), Cisco WebEx Meetings, and Cisco WebEx Meetings Server are affected by the vulnerability described in this advisory:\r\n\r\nCisco WebEx Business Suite (WBS31) client builds prior to T31.23.4\r\nCisco WebEx Business Suite (WBS32) client builds prior to T32.12\r\nCisco WebEx Meetings with client builds prior to T32.12\r\nCisco WebEx Meeting Server builds prior to 3.0 Patch 1\r\n  To determine whether a Cisco WebEx meeting site is running an affected version of the WebEx client build, users can log in to their Cisco WebEx meeting site and go to Support > Downloads. The version of the WebEx client build will be displayed on the right side of the page under About Meeting Center. See the Fixed Software [\"#fixed\"] section of this advisory for details.\r\n\r\nAlternatively, version information for the Cisco WebEx meeting client can be accessed directly within the Cisco WebEx meeting client. Version information for the Cisco WebEx meeting client on Windows and Linux platforms can be viewed by choosing Help > About Cisco WebEx Meeting Center. Version information for the Cisco WebEx meeting client on Mac platforms can be viewed by choosing Meeting Center > About Cisco WebEx Meeting Center.\r\n\r\nCisco WebEx software updates are cumulative in client builds. For example, if client build 30.32.16 is fixed, build 30.32.17 will contain updated software. Cisco WebEx site administrators have access to secondary version nomenclature, for example, T30 SP32 EP 16, which shows that the server is running client build 30.32.16.\r\n\r\nNote: Customers who do not receive automatic software updates may be running versions of Cisco WebEx that have reached end of software maintenance and should contact customer support.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco WebEx Business Suite (WBS) meeting services and Cisco WebEx Meetings are a hosted multimedia conferencing solution that is managed and maintained by Cisco WebEx. The Cisco WebEx Meetings Server is a multimedia conferencing solution that customers can host in their private clouds.\r\n\r\nThe ARF file format is used to store WebEx meeting recordings that have been recorded on a WebEx meeting site or on the computer of an online meeting attendee. The Cisco WebEx ARF Player is an application that is used to play back and edit WebEx ARF recording files (files with an .arf filename extension).\r\n\r\nThe Cisco WebEx ARF Player can be installed automatically when a user accesses a recording file that is hosted on a Cisco WebEx Meetings site (for streaming playback mode). The Cisco WebEx ARF Player can also be installed manually after downloading the application from https://www.webex.com/play-webex-recording.html [\"https://www.webex.com/play-webex-recording.html\"] for offline playback of recording files.\r\n\r\nThe Cisco WebEx ARF Player is available for all Cisco WebEx meeting site clients (WBS31, WBS32, and WebEx Meetings) and for Cisco WebEx Meetings Server clients.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability. However, it is possible to remove all WebEx software completely from a system by using the Meeting Services Removal Tool (for Microsoft Windows users) or the Mac WebEx Meeting Application Uninstaller (for Apple Mac OS X users), both of which are available for download from the Cisco Collaboration Help article at https://collaborationhelp.cisco.com/article/en-us/WBX000026396 [\"https://collaborationhelp.cisco.com/article/en-us/WBX000026396\"].\r\n\r\nRemoval of Cisco WebEx software from a Linux or UNIX-based system can be accomplished by following the steps in the Cisco Collaboration Help article at https://collaborationhelp.cisco.com/article/en-us/WBX28548 [\"https://collaborationhelp.cisco.com/article/en-us/WBX28548\"].\r\n\r\nComplete removal of the Cisco WebEx software will no longer allow WebEx functionality unless the software is reinstalled prior to attending a meeting or watching a recording.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttps://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n\r\nFixed Releases\r\n\r\nThe following client builds of Cisco WebEx Business Suite (WBS31 and WBS32), Cisco WebEx Meetings, and Cisco WebEx Meetings Server address the vulnerability described in this advisory:\r\n\r\nCisco WebEx Business Suite (WBS31) client builds T31.23.4 and later\r\nCisco WebEx Business Suite (WBS32) client builds T32.12 and later\r\nCisco WebEx Meetings with client builds T32.12 and later\r\nCisco WebEx Meeting Server builds 3.0 Patch 1 and later\r\n  To determine whether a Cisco WebEx meeting site is running an affected version of a WebEx client build, users can log in to their Cisco WebEx meeting site and go to Support > Downloads. The version of the WebEx client build will be displayed on the right side of the page under About Meeting Center. Cisco WebEx software updates are cumulative in client builds. For example, if client build 30.32.16 is fixed, build 30.32.17 will contain updated software.\r\n\r\nThe vulnerability disclosed in this advisory affects the Cisco WebEx ARF Player. The Microsoft Windows, Apple Mac OS X, and Linux versions of the player are all affected by the vulnerability described in this advisory. If the Cisco WebEx ARF Player was automatically installed, it will be automatically upgraded to the latest, non-vulnerable version when users access a recording file that is hosted on a WebEx meeting site. If the Cisco WebEx ARF Player was manually installed, users will need to manually install a new version of the player after downloading the latest version from https://www.webex.com/play-webex-recording.html [\"https://www.webex.com/play-webex-recording.html\"].\r\n\r\nUsers can manually verify the installed version of the Cisco WebEx ARF Player to determine whether they are affected by this vulnerability.\r\n\r\nNote: Users whose WebEx Business Suites are on lockdown will need to contact WebEx Support to apply the appropriate patch to their WebEx site.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "Cisco would like to thank Kushal Arvind Shah of Fortinet’s FortiGuard Labs for reporting this vulnerability.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco WebEx Advanced Recording Format Remote Code Execution Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180502-war"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180502-war",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180502-war"
			},
			{
				"category": "external",
				"summary": "https://www.webex.com/play-webex-recording.html",
				"url": "https://www.webex.com/play-webex-recording.html"
			},
			{
				"category": "external",
				"summary": "https://collaborationhelp.cisco.com/article/en-us/WBX000026396",
				"url": "https://collaborationhelp.cisco.com/article/en-us/WBX000026396"
			},
			{
				"category": "external",
				"summary": "https://collaborationhelp.cisco.com/article/en-us/WBX28548",
				"url": "https://collaborationhelp.cisco.com/article/en-us/WBX28548"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			},
			{
				"category": "external",
				"summary": "https://www.webex.com/play-webex-recording.html",
				"url": "https://www.webex.com/play-webex-recording.html"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco WebEx Advanced Recording Format Remote Code Execution Vulnerability",
		"tracking": {
			"current_release_date": "2018-05-02T16:00:00+00:00",
			"generator": {
				"date": "2022-09-03T03:03:17+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20180502-war",
			"initial_release_date": "2018-05-02T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2018-05-02T15:08:41+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco WebEx ARF Player",
						"product": {
							"name": "Cisco WebEx ARF Player ",
							"product_id": "CSAFPID-100455"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Meetings Server",
						"product": {
							"name": "Cisco WebEx Meetings Server ",
							"product_id": "CSAFPID-190702"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco Webex Meetings",
						"product": {
							"name": "Cisco Webex Meetings ",
							"product_id": "CSAFPID-228295"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2018-0264",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvh85410"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvh85442"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvh85430"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvh85457"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvh85440"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvh85453"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-228295",
					"CSAFPID-190702",
					"CSAFPID-100455"
				]
			},
			"release_date": "2018-05-02T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-228295",
						"CSAFPID-100455",
						"CSAFPID-190702"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 9.6,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-228295",
						"CSAFPID-190702",
						"CSAFPID-100455"
					]
				}
			],
			"title": "Cisco WebEx Advanced Recording Format Remote Code Execution Vulnerability"
		}
	]
}
