{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during the resolution of a Cisco TAC support case."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the authentication, authorization, and accounting (AAA) security services of Cisco IOS XE Software could allow an unauthenticated, remote attacker to execute arbitrary code on an affected device or cause an affected device to reload, resulting in a denial of service (DoS) condition.\r\n\r\nThe vulnerability is due to incorrect memory operations that the affected software performs when the software parses a username during login authentication. An attacker could exploit this vulnerability by attempting to authenticate to an affected device. A successful exploit could allow the attacker to execute arbitrary code on the affected device or cause the affected device to reload, resulting in a DoS condition.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nThis advisory is available at the following link:\r\nhttps://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-aaa [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-aaa\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects Cisco devices that are running Cisco IOS XE Software Release Fuji 16.7.1 or Fuji 16.8.1 and are configured to use AAA for login authentication.\r\n  Checking the AAA Configuration\r\nTo determine whether a device is configured to use AAA for login authentication, administrators can log in to the device and use the show running-config | include aaa authentication login command in the CLI, as shown in the following example:\r\n\r\n\r\nRouter# show running-config | include aaa authentication login\r\n  aaa authentication login default local  Router#\r\n\r\nIf the device is configured to use AAA for login authentication, the output of the command will include the aaa authentication login command and the configuration values for the name of the authentication list (default in the preceding example) and the authentication method (local in the preceding example).\r\n\r\nIf the show running-config | include aaa authentication login command does not return any output, the device is not configured to use AAA for login authentication.\r\n  Determining the Cisco IOS XE Software Release\r\nTo determine which Cisco IOS XE Software release is running on a device, administrators can log in to the device, use the show version command in the CLI, and then refer to the system banner that appears. If the device is running Cisco IOS XE Software, the system banner displays Cisco IOS Software, Cisco IOS XE Software, or similar text.\r\n\r\nThe following example shows the output of the command for a device that is running Cisco IOS XE Software Release 16.2.1 and has an installed image name of CAT3K_CAA-UNIVERSALK9-M:\r\n\r\n\r\nios-xe-device# show version\r\n  Cisco IOS Software, Catalyst L3 Switch Software (CAT3K_CAA-UNIVERSALK9-M), Version Denali 16.2.1, RELEASE SOFTWARE (fc1)  Technical Support: http://www.cisco.com/techsupport  Copyright (c) 1986-2016 by Cisco Systems, Inc.  Compiled Sun 27-Mar-16 21:47 by mcpre  .  .  .\r\n\r\nFor information about the naming and numbering conventions for Cisco IOS XE Software releases, see the Cisco IOS and NX-OS Software Reference Guide [\"https://www.cisco.com/c/en/us/about/security-center/ios-nx-os-reference-guide.html\"].",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect any other releases of Cisco IOS XE Software. Cisco has also confirmed that this vulnerability does not affect Cisco IOS Software, Cisco IOS XR Software, or Cisco NX-OS Software.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "This vulnerability affects AAA login authentication that is applied to any supported tty lines, including console port (CTY) lines, auxiliary (AUX) port lines, virtual terminal (VTY) lines, and asynchronous tty (TTY) lines.\r\n\r\nThis vulnerability can be exploited via IPv4 or IPv6.\r\n\r\nThis vulnerability does not affect login authentication to the web UI of the affected software.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability. However, administrators may limit the exposure of a device by limiting administration sessions to the device.\r\n\r\nBy applying a vty access class that permits only known, trusted devices to connect to the device, administrators can help ensure that only trusted sources can access a device via vty.\r\n\r\nThe following example shows a vty access class that permits vty access to a device from the 192.168.1.0/24 netblock and the IP address 172.16.1.2, and denies vty access from everywhere else:\r\n\r\n\r\nRouter(config)# access-list 1 permit 192.168.1.0 0.0.0.255\r\nRouter(config)# access-list 1 permit host 172.16.1.2  Router(config)# line vty 0 4  Router(config-line)# access-class 1 in\r\n\r\nFor console ports or auxiliary ports that are connected via a terminal server connection, ensure that the vty access class is configured on the terminal server. For console ports or auxiliary ports that are not connected or not used, issue the no exec command on the line to prevent access to that port, as shown in the following example:\r\n\r\n\r\nRouter(config)# line aux 0\r\nRouter(config-line)# no exec\r\n\r\nBecause different Cisco platforms support different numbers of terminal lines, administrators should check the device configuration to determine the correct number of terminal lines for the platform.\r\n\r\nFor detailed information about restricting traffic to a device via a vty line, see the Telnet, Console and AUX Port Passwords on Cisco Routers Configuration Example [\"https://www.cisco.com/c/en/us/support/docs/ios-nx-os-software/ios-software-releases-110/45843-configpasswords.html\"].",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttps://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n  Fixed Releases\r\nThis vulnerability is fixed in Cisco IOS XE Software Releases Fuji 16.7.2, Fuji 16.8.1c, and Fuji 16.8.1s.\r\n\r\nThis vulnerability will be fixed in Cisco IOS XE Software Release Fuji 16.9.1, which is expected to be released in July 2018, and Cisco IOS XE Software Release Fuji 16.8.2, which is expected to be released in September 2018.\r\n  Cisco IOS and IOS XE Software\r\nTo help customers determine their exposure to vulnerabilities in Cisco IOS and IOS XE Software, Cisco provides a tool, the Cisco IOS Software Checker [\"https://sec.cloudapps.cisco.com/security/center/selectIOSVersion.x\"], that identifies any Cisco Security Advisories that impact a specific software release and the earliest release that fixes the vulnerabilities described in each advisory (“First Fixed”). If applicable, the tool also returns the earliest release that fixes all the vulnerabilities described in all the advisories identified (“Combined First Fixed”).\r\n\r\nCustomers can use this tool to perform the following tasks:\r\n\r\nInitiate a search by choosing one or more releases from a drop-down menu or uploading a file from a local system for the tool to parse\r\nEnter the output of the show version command for the tool to parse\r\nCreate a custom search by including all previously published Cisco Security Advisories, a specific advisory, or all advisories in the most recent bundled publication\r\n\r\nTo determine whether a release is affected by any published Cisco Security Advisory, use the Cisco IOS Software Checker [\"https://sec.cloudapps.cisco.com/security/center/selectIOSVersion.x\"] on Cisco.com or enter a Cisco IOS Software or Cisco IOS XE Software release—for example, 15.1(4)M2 or 3.1.4S—in the following field:",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during the resolution of a Cisco TAC support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS XE Software Authentication, Authorization, and Accounting Login Authentication Remote Code Execution Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-aaa"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-aaa",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-aaa"
			},
			{
				"category": "external",
				"summary": "Cisco IOS and NX-OS Software Reference Guide",
				"url": "https://www.cisco.com/c/en/us/about/security-center/ios-nx-os-reference-guide.html"
			},
			{
				"category": "external",
				"summary": "Telnet, Console and AUX Port Passwords on Cisco Routers Configuration Example",
				"url": "https://www.cisco.com/c/en/us/support/docs/ios-nx-os-software/ios-software-releases-110/45843-configpasswords.html"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;IOS Software Checker",
				"url": "https://sec.cloudapps.cisco.com/security/center/selectIOSVersion.x"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;IOS Software Checker",
				"url": "https://sec.cloudapps.cisco.com/security/center/selectIOSVersion.x"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco IOS XE Software Authentication, Authorization, and Accounting Login Authentication Remote Code Execution Vulnerability",
		"tracking": {
			"current_release_date": "2018-06-08T13:55:00+00:00",
			"generator": {
				"date": "2022-09-03T03:32:01+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20180606-aaa",
			"initial_release_date": "2018-06-06T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2018-06-06T14:04:32+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2018-06-08T13:55:30+00:00",
					"number": "1.1.0",
					"summary": "Added that this vulnerability can be exploited via IPv4 or IPv6. Specified where to configure the vty ACLs and added details for use of the no exec command."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"branches": [
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "16.7.1",
										"product": {
											"name": "16.7.1",
											"product_id": "CSAFPID-218903"
										}
									},
									{
										"category": "service_pack",
										"name": "16.7.1a",
										"product": {
											"name": "16.7.1a",
											"product_id": "CSAFPID-231389"
										}
									},
									{
										"category": "service_pack",
										"name": "16.7.1b",
										"product": {
											"name": "16.7.1b",
											"product_id": "CSAFPID-232767"
										}
									}
								],
								"category": "product_version",
								"name": "16.7"
							},
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "16.8.1",
										"product": {
											"name": "16.8.1",
											"product_id": "CSAFPID-218905"
										}
									},
									{
										"category": "service_pack",
										"name": "16.8.1a",
										"product": {
											"name": "16.8.1a",
											"product_id": "CSAFPID-235307"
										}
									},
									{
										"category": "service_pack",
										"name": "16.8.1b",
										"product": {
											"name": "16.8.1b",
											"product_id": "CSAFPID-235858"
										}
									}
								],
								"category": "product_version",
								"name": "16.8"
							}
						],
						"category": "product_family",
						"name": "Cisco IOS XE Software"
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2018-0315",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi25380"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-218903",
					"CSAFPID-218905",
					"CSAFPID-231389",
					"CSAFPID-232767",
					"CSAFPID-235307",
					"CSAFPID-235858"
				]
			},
			"release_date": "2018-06-06T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-218903",
						"CSAFPID-218905",
						"CSAFPID-231389",
						"CSAFPID-232767",
						"CSAFPID-235307",
						"CSAFPID-235858"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 9.8,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-218903",
						"CSAFPID-218905",
						"CSAFPID-231389",
						"CSAFPID-232767",
						"CSAFPID-235307",
						"CSAFPID-235858"
					]
				}
			],
			"title": "Cisco IOS XE Software Authentication, Authorization, and Accounting Login Authentication Remote Code Execution Vulnerability"
		}
	]
}
