{
	"document": {
		"acknowledgments": [
			{
				"summary": "These vulnerabilities were found during the resolution of Cisco TAC support cases."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Multiple vulnerabilities in the Login Enhancements (Login Block) feature of Cisco IOS Software could allow an unauthenticated, remote attacker to trigger a reload of an affected system, resulting in a denial of service (DoS) condition.\r\n\r\nFor more information about these vulnerabilities, see the Details [\"#details\"] section of this security advisory.\r\n\r\nThere are no workarounds that address both vulnerabilities.\r\n\r\nThis advisory is available at the following link:\r\nhttps://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-slogin [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-slogin\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "These vulnerabilities affect Cisco devices that are running Cisco IOS Software Release 15.4(2)T, 15.4(3)M, or 15.4(2)CG and later.\r\n\r\nDetermining the Cisco IOS Software Release\r\nTo determine which Cisco IOS Software release is running on a device, administrators can log in to the device, use the show version command in the CLI, and then refer to the system banner that appears. If the device is running Cisco IOS Software, the system banner displays text similar to Cisco Internetwork Operating System Software or Cisco IOS Software. The banner also displays the installed image name in parentheses, followed by the Cisco IOS Software release number and release name. Some Cisco devices do not support the show version command or may provide different output.\r\n\r\nThe following example shows the output of the command for a device that is running Cisco IOS Software Release 15.5(2)T1 and has an installed image name of C2951-UNIVERSALK9-M:\r\n\r\n\r\nRouter> show version\r\n  Cisco IOS Software, C2951 Software (C2951-UNIVERSALK9-M), Version 15.5(2)T1, RELEASE SOFTWARE (fc1)  Technical Support: http://www.cisco.com/techsupport  Copyright (c) 1986-2015 by Cisco Systems, Inc.  Compiled Mon 22-Jun-15 09:32 by prod_rel_team  .  .  .\r\n\r\nFor information about the naming and numbering conventions for Cisco IOS Software releases, see the Cisco IOS and NX-OS Software Reference Guide [\"https://www.cisco.com/c/en/us/about/security-center/ios-nx-os-reference-guide.html\"].",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by these vulnerabilities.\r\n\r\nCisco has confirmed that these vulnerabilities do not affect IOS XE Software, Cisco IOS XR Software, or Cisco NX-OS Software.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The Cisco IOS Login Enhancements (Login Block) Feature\r\nThe Cisco IOS Login Enhancements (Login Block) feature allows users to enhance the security of a router by configuring options to automatically block further login attempts when a possible DoS attack is detected.\r\n\r\nThe login block and login delay options introduced by this feature can be configured for Telnet or SSH virtual connections. By enabling this feature, you can slow down “dictionary attacks” by enforcing a “quiet period” if multiple failed connection attempts are detected, thereby protecting the routing device from a type of DoS attack.\r\n\r\nFurther information on the Login Enhancements (Login Block) feature is available in the Cisco IOS Security Configuration Guide [\"https://www.cisco.com/c/en/us/td/docs/ios/sec_user_services/configuration/guide/12_4/sec_securing_user_services_12-4_book/sec_login_enhance.html\"].\r\n  Vulnerability Details\r\nTwo vulnerabilities in the Login Enhancements (Login Block) feature of Cisco IOS Software could allow an unauthenticated, remote attacker to trigger a reload of an affected device, resulting in a denial of service (DoS) condition.\r\n\r\nThe vulnerabilities are not dependent on one another; exploitation of one of the vulnerabilities is not required to exploit the other vulnerability. In addition, a software release that is affected by one of the vulnerabilities may not be affected by the other vulnerability.\r\n\r\nDetails about the vulnerabilities are as follows.\r\n\r\nCisco IOS Software Login Block Denial of Service Vulnerability\r\n\r\n\r\nA vulnerability in the Login Enhancements (Login Block) feature of Cisco IOS Software could allow an unauthenticated, remote attacker to trigger a reload of an affected system, resulting in a denial of service (DoS) condition.\r\n\r\nThe vulnerability is due to an attempt to free an area of memory that has not been previously allocated. An attacker could exploit this vulnerability by attempting to log in to an affected device via Secure Shell (SSH) or Telnet with invalid credentials multiple times.\r\n\r\nThis vulnerability is exploitable only if both of the following conditions are met:\r\n\r\nlogin quiet-mode access-class has been configured prior to configuring login block-for. These features are not enabled by default.\r\nThe device has not been reloaded since that configuration occurred.\r\n\r\nThe Common Vulnerabilities and Exposures (CVE) ID for this vulnerability is: CVE-2018-0179\r\n\r\nThe Security Impact Rating (SIR) for this vulnerability is: Medium\r\n\r\nThe Cisco bug ID for this vulnerability is: CSCuy32360\r\n\r\nCisco IOS Software Login Block Denial of Service Vulnerability\r\n\r\n\r\nA vulnerability in the Login Enhancements (Login Block) feature of Cisco IOS Software could allow an unauthenticated, remote attacker to trigger a reload of an affected system, resulting in a denial of service (DoS) condition.\r\n\r\nThe vulnerability is due to an attempt to free an area of memory that has not been previously allocated. An attacker could exploit this vulnerability by attempting to log in to an affected device via SSH or Telnet with invalid credentials multiple times while the administrator modifies the login block-for configuration.\r\n\r\nThis vulnerability is exploitable only if login block-for has been configured on an affected device. This feature is not enabled by default.\r\n\r\nThe CVE ID for this vulnerability is: CVE-2018-0180\r\n\r\nThe SIR for this vulnerability is: Medium\r\n\r\nThe Cisco bug ID for this vulnerability is: CSCuz60599",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "The following conditions can indicate that a compromise has occurred.\r\n  Cisco IOS Software Login Block Denial of Service Vulnerability - CSCuy32360\r\nImmediately before the device crashes and reloads, the device will log messages similar to the following example at least twice:\r\n\r\n\r\n%SEC_LOGIN-4-LOGIN_FAILED: Login failed [user: USERNAME] [Source: xx.xx.xx.xx [localport: 22] [Reason: Login Authentication Failed] at 03:37:06 UTC Sat Feb 13 2016\r\n%SEC_LOGIN-1-QUIET_MODE_ON: Still timeleft for watching failures is 52 secs, [user: USERNAME] [Source: xx.xx.xx.xx] [localport: 22] [Reason: Login Authentication Failed] [ACL: LOGIN_ACL] at 03:37:06 UTC Sat Feb 13 2016\r\n\r\nExploitation of this vulnerability will cause an affected device to generate a crashinfo file. Contact the Cisco Technical Assistance Center (TAC) to review the output of the show tech-support command and the crashinfo file to determine whether the device has been compromised by exploitation of this vulnerability.\r\n  Cisco IOS Software Login Block Denial of Service Vulnerability - CSCuz60599\r\nAfter this vulnerability has been exploited on an affected system, the device will log an error message about a bad chunk reference count in process Secure Login similar to the following example:\r\n\r\n\r\n%SYS-2-CHUNKBADREFCOUNT: Bad chunk reference count, chunk 3F57D864 data 3F589728 refcount FFFFFFFF alloc pc 323635BC. -Process= \"Secure Login\", ipl= 0, pid= 388\r\n\r\nExploitation of this vulnerability will cause an affected device to generate a crashinfo file. Contact the Cisco Technical Assistance Center (TAC) to review the output of the show tech-support command and the crashinfo file to determine whether the device has been compromised by exploitation of this vulnerability.",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "As a workaround for the vulnerability described in CSCuy32360, administrators can take one of the following actions:\r\n\r\nConfigure login block-for prior to configuring login quiet-mode access-class\r\nEnsure that the device is reloaded after login block-for and login quiet-mode access-class are configured\r\n\r\nThere are no workarounds that address the vulnerability described in CSCuz60599.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "For detailed information about fixed software releases, consult the Cisco bug ID(s) at the top of this advisory.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "In March 2022, the Cisco Product Security Incident Response Team (PSIRT) became aware of additional attempted exploitation of this vulnerability in the wild. Cisco continues to strongly recommend that customers upgrade to a fixed software release to remediate this vulnerability.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "These vulnerabilities were found during the resolution of Cisco TAC support cases.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS Software Login Enhancements Login Block Denial of Service Vulnerabilities",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-slogin"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-slogin",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-slogin"
			},
			{
				"category": "external",
				"summary": "Cisco IOS and NX-OS Software Reference Guide",
				"url": "https://www.cisco.com/c/en/us/about/security-center/ios-nx-os-reference-guide.html"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;IOS Security Configuration Guide",
				"url": "https://www.cisco.com/c/en/us/td/docs/ios/sec_user_services/configuration/guide/12_4/sec_securing_user_services_12-4_book/sec_login_enhance.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco IOS Software Login Enhancements Login Block Denial of Service Vulnerabilities",
		"tracking": {
			"current_release_date": "2022-12-15T22:19:49+00:00",
			"generator": {
				"date": "2022-12-15T22:20:19+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20180328-slogin",
			"initial_release_date": "2018-03-28T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2018-03-28T15:20:39+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2022-12-15T22:19:49+00:00",
					"number": "1.1.0",
					"summary": "Updated exploitation information."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "IOS",
						"product": {
							"name": "Cisco IOS ",
							"product_id": "CSAFPID-2097"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2018-0180",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCuz60599"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-2097"
				]
			},
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-2097"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 6.8,
						"baseSeverity": "MEDIUM",
						"vectorString": "CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-2097"
					]
				}
			],
			"title": "Cisco IOS Software Login Enhancements Login Block Denial of Service Vulnerability - CSCuz60599"
		},
		{
			"cve": "CVE-2018-0179",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCuy32360"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-2097"
				]
			},
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-2097"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 6.8,
						"baseSeverity": "MEDIUM",
						"vectorString": "CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-2097"
					]
				}
			],
			"title": "Cisco IOS Software Login Enhancements Login Block Denial of Service Vulnerability - CSCuy32360"
		}
	]
}
