{
	"document": {
		"acknowledgments": [
			{
				"summary": "Cisco would like to thank security researcher Suhail Alaskar of Saudi Information Technology Company for reporting this vulnerability."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Update (2018-December-20): The updated patch ciscocm.CSCvk30822_v2.0.k3.cop.sgn  that avoids the functional issues identified with the v1.0 patch has been posted to Cisco.com. See the Fixed Releases [\"#fr\"]  section for details.\r\n\r\nUpdate (2018-December-10): Installing the ciscocm.CSCvk30822_v1.0.k3.cop.sgn  patch may cause functional issues. Workarounds are available for some of these issues. Rolling back this patch as described in the Fixed Releases [\"#fr\"] section will correct these functional issues, but  the device will be affected by this vulnerability again when the patch is not in place. See the Fixed Releases [\"#fr\"] section for details.\r\n\r\n\r\nA vulnerability in the web framework code of Cisco Prime License Manager  (PLM) could allow an unauthenticated, remote attacker to execute arbitrary SQL queries.\r\n  The vulnerability is due to a lack of proper validation of user-supplied input in SQL queries. An attacker could exploit this vulnerability by sending crafted HTTP POST requests that contain malicious SQL statements to an affected application. A successful exploit could allow the attacker to modify and delete arbitrary data in the PLM database or gain shell access with the privileges of the postgres user.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nThis advisory is available at the following link:\r\nhttps://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20181128-plm-sql-inject [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20181128-plm-sql-inject\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects Cisco Prime License Manager Releases 11.0.1 and later. Both standalone deployments of Cisco Prime License Manager and coresident deployments, where Cisco Prime License Manager is installed automatically as part of the installation of Cisco Unified Communications Manager and Cisco Unity Connection, are affected.\r\n\r\nTo identify which release of Cisco Prime License Manager is running, administrators can log in to the Cisco Prime License Manager GUI and click About in the top-right corner of the screen. The following example shows the Version string that is reported by a Cisco Prime License Manager instance that is running the 11.5.1 release:\r\n\r\n\r\nVersion: 11.5.1.10000-5",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco Unified Communications Manager and Cisco Unity Connection Releases 12.0 and later have been confirmed to be not affected by this vulnerability as Cisco Prime License Manager is no longer included in these releases.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.\r\n\r\nCustomers with coresident deployments of Cisco Prime License Manager as part of Cisco Unified Communications Manager or Cisco Unity Connection who do not use PLM can disable the feature to close the attack vector as follows:\r\n\r\nLog in to the Cisco Unified Communications Manager or Cisco Unity Connection CLI as admin user.\r\nRun the command license management system remove.\r\nConfirm with y.\r\nWait for the operation to complete; afterwards, the system will reboot automatically.\r\n\r\nNote: This procedure needs to be executed on all nodes in a cluster. It will persist across upgrades.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n  Customers Without Service Contracts\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttps://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n    Fixed Releases\r\nThis vulnerability is fixed in Cisco Prime License Manager patch ciscocm.CSCvk30822_v2.0.k3.cop.sgn (the v1.0 release of this patch should no longer be used due to functional issues caused by that version of the patch). The same COP file can be used with standalone deployments of Cisco Prime License Manager as well as with coresident deployments as part of Cisco Unified Communications Manager and Cisco Unity Connection and with all affected versions. Installation instructions are available in a corresponding Readme document.\r\n\r\nNote: This patch can be installed on Cisco Prime License Manager, Cisco Unified Communications Manager, and Cisco Unity Connection 11.5(1) only. Customers running an earlier release will need to upgrade to 11.5(1) prior to installing this patch.\r\n\r\nFunctional Issues Identified in the v1.0 Patch File\r\n\r\nInstalling the ciscocm.CSCvk30822_v1.0.k3.cop.sgn patch on standalone or coresident PLM will resolve the vulnerability described in this advisory, but this action will disable the following features:\r\n\r\nInstall/upgrade functionality in the PLM GUI\r\nBackup and Restore functionality in the PLM GUI\r\n\r\nWorkarounds for the Functional Issues\r\n  Standalone PLM\r\nInstall/upgrade can be accomplished by using the CLI.\r\nThere is no workaround for the Backup and Restore functionality.\r\n  Coresident PLM\r\nInstall/upgrade can be accomplished by using the CUCM/CUC GUI.\r\nBackup and Restore functionality continues to be available in the CUCM/CUC GUI.\r\n\r\nUpgrading from the v1.0 Patch to the v2.0 Patch\r\n\r\n\r\nCustomers who have previously installed the ciscocm.CSCvk30822_v1.0.k3.cop.sgn patch should upgrade to the ciscocm.CSCvk30822_v2.0.k3.cop.sgn patch to remediate the functional issues. Installing the v2.0 patch will first rollback the v1.0 patch and then install the v2.0 patch:\r\n\r\n Download the ciscocm.CSCvk30822_v2.0.k3.cop.sgn file from the locations indicated in the Patch and Patch Rollback File Download [\"#dl\"] section of this advisory.\r\nInstall that downloaded file by using the CLI (for a standalone PLM) or by using the CUCM/CUC GUI (for a coresident PLM).\r\n\r\nPatch and Patch Rollback File Download\r\n\r\nThe patch files and patch rollback files, including a Readme document, are available for download from the Software Center [\"https://software.cisco.com/download/navigator.html\"] on Cisco.com by navigating to the following locations:\r\n\r\nCisco Prime License Manager\r\nBrowse all > Cloud and Systems Management > Collaboration and Unified  Communications Management > Prime License Manager > Prime License  Manager 11.5 > Prime License Manager Software Patches > UTILS\r\n\r\nCisco Unified Communications Manager\r\nBrowse all > Unified Communications > Call Control > Unified Communications Manager (CallManager) > Unified Communications Manager Version 11.5 > Unified Communications Manager / CallManager / Cisco Unity Connection Utilities > COP-Files\r\n\r\nCisco Unity Connection\r\nBrowse all > Unified Communications > Unified Communications Applications > Messaging > Unity Connection > Unity Connection Version 11.x > Unified Communications Manager / CallManager / Cisco Unity Connection Utilities > COP-Files",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "Cisco would like to thank security researcher Suhail Alaskar of Saudi Information Technology Company for reporting this vulnerability.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Prime License Manager SQL Injection Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20181128-plm-sql-inject"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20181128-plm-sql-inject",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20181128-plm-sql-inject"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			},
			{
				"category": "external",
				"summary": "Software Center",
				"url": "https://software.cisco.com/download/navigator.html"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco Prime License Manager SQL Injection Vulnerability",
		"tracking": {
			"current_release_date": "2018-12-20T15:33:00+00:00",
			"generator": {
				"date": "2022-09-03T03:03:31+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20181128-plm-sql-inject",
			"initial_release_date": "2018-11-28T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2018-11-28T15:42:11+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2018-12-04T16:34:44+00:00",
					"number": "1.1.0",
					"summary": "Added details on how to disable a coresident installation of PLM."
				},
				{
					"date": "2018-12-10T18:27:03+00:00",
					"number": "1.2.0",
					"summary": "Added information about functional issues that were discovered with the initial COP file."
				},
				{
					"date": "2018-12-20T15:33:50+00:00",
					"number": "1.3.0",
					"summary": "Added information about updated COP file."
				}
			],
			"status": "final",
			"version": "1.3.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Prime License Manager",
						"product": {
							"name": "Cisco Prime License Manager ",
							"product_id": "CSAFPID-203607"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2018-15441",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvk30822"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-203607"
				]
			},
			"release_date": "2018-11-28T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-203607"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 9.4,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-203607"
					]
				}
			],
			"title": "Cisco Prime License Manager SQL Injection Vulnerability"
		}
	]
}
