{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during the resolution of a Cisco TAC support case."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the RADIUS authentication module of Cisco Policy Suite could allow an unauthenticated, remote attacker to be authorized as a subscriber without providing a valid password; however, the attacker must provide a valid username.\r\n\r\nThe vulnerability is due to incorrect RADIUS user credential validation. An attacker could exploit this vulnerability by attempting to access a Cisco Policy Suite domain configured with RADIUS authentication. An exploit could allow the attacker to be authorized as a subscriber without providing a valid password.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects the Cisco Policy Suite application running a release prior to 13.1.0 with Hotfix Patch 1 when RADIUS authentication is configured for a domain. Cisco Policy Suite Release 14.0.0 is also affected, as it includes vulnerable code, but RADIUS authentication is not officially supported in Cisco Policy Suite Releases 14.0.0 and later. See the Fixed Software [\"#Fixed\"] section of this security advisory for additional information about the affected software versions.\r\n\r\nTo determine which software version is running on the application, administrators can issue the about.sh command from the CLI. In the following example, the device is running software release 12.1.0:\r\n# about.sh\r\nCisco Policy Suite - Copyright (c) 2015. All rights reserved.\r\nCPS Multi-Node Environment\r\nCPS Installer Version - 12.1.0\r\n.\r\n.\r\n.\r\nCPS Patch History\r\n---------------------------\r\nNo patches have been applied\r\n.\r\n.\r\n.\r\n\n\r\nThe system is vulnerable only if RADIUS is used for authentication in a domain. RADIUS authentication is not enabled by default. Administrators can use the Policy Builder GUI to verify if RADIUS authentication is configured for a domain by accessing the Services tab and selecting the appropriate domain under the Domains tab. On the General tab, administrators can check if USuM Authorization is selected and the User Id Field and Password Field are populated with RADIUS Username and RADIUS Password respectively.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttps://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n\r\nFixed Releases\r\n\r\nIn the following table, the left column lists major releases of Cisco Policy Suite software. The right column indicates whether a major release is affected by the vulnerability described in this advisory and the first minor release that includes the fix for this vulnerability.\r\n\r\nCustomers should upgrade to an appropriate release as indicated in the following table:\r\n                            Cisco Policy Suite Major Release                          First Fixed Release for This Vulnerability                               Prior 12.x\r\n             Vulnerable. Upgrade to 13.1.0 and apply Hotfix Patch 1.\r\n                               12.x\r\n             Vulnerable. Upgrade to 13.1.0 and apply Hotfix Patch 1.\r\n                               13.0\r\n             Vulnerable. Upgrade to 13.1.0 and apply Hotfix Patch 1.\r\n                               13.1\r\n             Vulnerable. Apply Hotfix Patch 1.\r\n                               14.0\r\n             Vulnerable. 1\r\n                               18.0\r\n             Not vulnerable.\r\n\r\n1 Cisco Policy Suite Release 14.0 includes vulnerable code, but does not officially support RADIUS authentication. The subsequent Cisco Policy Suite Release 18.0 does not support RADIUS authentication and does not include vulnerable code.\r\n\r\nThe Cisco Policy Suite 13.1.0 Hotfix Patch 1 and other Cisco Policy Suite software can be downloaded from the Software Center [\"https://software.cisco.com/download/navigator.html\"] on Cisco.com by choosing Downloads Home > Products > Wireless > Mobile Internet > Policy Suite for Service Providers > Policy Suite for Wi-Fi > Cisco Policy Suite (CPS) Software\r\n\r\nTo apply the Hotfix Patch 1 on Cisco Policy Suite Release 13.1.0, please refer to the Apply a Patch section in the CPS Migration and Upgrade Guide, Release 13.1.0 [\"https://www.cisco.com/c/en/us/td/docs/wireless/quantum-policy-suite/R23-2-0/CPS-MigrationandUpgradeGuide/cps23-2-0migrationandupgradeguide/m_applypatchescps.html?bookSearch=true#id_11097\"] document.\r\n\r\nTo verify if the Hotfix Patch 1 has been applied to the system, administrators can issue the about.sh command from the CLI. In the following example, the output from the about.sh command provides verification that the patch has been installed:\r\n# about.sh\r\nCisco Policy Suite - Copyright (c) 2015. All rights reserved.\r\nCPS Multi-Node Environment\r\nCPS Installer Version - 13.1.0\r\nCPS Core Versions\r\n---------------------------\r\nhostname: qns-1      (pcrf): 13.1.1.r113649\r\nhostname: qns-2        (pb): 13.1.1.r113649\r\n.\r\n.\r\n.\r\nCPS Patch History\r\n---------------------------\r\nCPS_Hotfix_Patch1_13.1.0\r\n.\r\n.\r\n.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during the resolution of a Cisco TAC support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Policy Suite RADIUS Authentication Bypass Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180207-cps"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			},
			{
				"category": "external",
				"summary": "Software Center",
				"url": "https://software.cisco.com/download/navigator.html"
			},
			{
				"category": "external",
				"summary": "CPS Migration and Upgrade Guide, Release 13.1.0",
				"url": "https://www.cisco.com/c/en/us/td/docs/wireless/quantum-policy-suite/R23-2-0/CPS-MigrationandUpgradeGuide/cps23-2-0migrationandupgradeguide/m_applypatchescps.html?bookSearch=true#id_11097"
			}
		],
		"title": "Cisco Policy Suite RADIUS Authentication Bypass Vulnerability",
		"tracking": {
			"current_release_date": "2018-02-07T16:00:00+00:00",
			"generator": {
				"date": "2024-06-04T13:23:29+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20180207-cps",
			"initial_release_date": "2018-02-07T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2018-02-07T14:53:33+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Policy Suite (CPS) Software",
						"product": {
							"name": "Cisco Policy Suite (CPS) Software ",
							"product_id": "CSAFPID-213864"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2018-0116",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvg40124"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-213864"
				]
			},
			"release_date": "2018-02-07T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-213864"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 7.2,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:L/A:N",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-213864"
					]
				}
			],
			"title": "Cisco Policy Suite Radius Authentication Bypass Vulnerability"
		}
	]
}
