{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during the resolution of a Cisco TAC support case."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the UDP broadcast forwarding function of  Cisco IOS XR Software could allow an unauthenticated, adjacent attacker to cause a denial of service (DoS) condition on the affected device.\r\n\r\nThe vulnerability is due to improper handling of UDP broadcast packets that are forwarded to an IPv4 helper address. An attacker could exploit this vulnerability by sending multiple UDP broadcast packets to the affected device. An exploit could allow the attacker to cause a buffer leak on the affected device, eventually resulting in a DoS condition requiring manual intervention to recover.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nThis advisory is available at the following link:\r\nhttps://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180418-iosxr [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180418-iosxr\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects all Cisco IOS XR platforms running 6.3.1, 6.2.3, or earlier releases of Cisco IOS XR Software when at least one IPv4 helper address is configured on an interface of the device.\r\n\r\nBy default, no IPv4 helper address is enabled in Cisco IOS XR Software.\r\n\r\nDHCP Relay Profile helper addresses and DHCPv6 Relay Service configurations are not affected.\r\n\r\nDetermining if the Device Has an IPv4 Helper Address Configured\r\n\r\nThis vulnerability can be exploited only if the affected device has at least one interface configured with an IPv4 helper address.\r\n\r\nThe following example shows the output of the show running-config | include ipv4 helper-address CLI command on a device with an IPv4 helper address configured:\r\nRP/0/RSP0/CPU0:Router# show running-config | include ipv4 helper-address\r\nBuilding configuration...\r\nipv4 helper-address vrf default 192.0.2.1\r\n\n\r\nDetermining the Cisco IOS XR Software Release\r\n\r\nTo determine which Cisco IOS XR Software release is running on a device and the name of the device on which it is running, administrators can log in to the device and use the show version command in the CLI. If the device is running Cisco IOS XR Software, Cisco IOS XR Software or similar text appears in the system banner. The location and name of the system image file that is currently running on the device appears next to the System image file is text. The name of the hardware product appears on the line after the name of the system image file.\r\n\r\nThe following example shows the output of the show version command on a device that is running Cisco IOS XR Software release 5.3.4:\r\nRP/0/RSP0/CPU0:ASR9001#show version\r\nWed Jan 24 01:32:32.751 EST    Cisco IOS XR Software, Version 5.3.4[Default]  Copyright (c) 2017 by Cisco Systems, Inc.    ROM: System Bootstrap, Version 2.04(20140227:092320) [ASR9K ROMMON],      ASR9001 uptime is 6 hours, 17 minutes  System image file is \"bootflash:disk0/asr9k-os-mbi-5.3.4.sp4-1.0.0/0x100000/mbiasr9k-rp.vm\"    cisco ASR9K Series (P4040) processor with 8388608K bytes of memory.  P4040 processor at 1500MHz, Revision 2.0  ASR-9001 Chassis    2 Management Ethernet  8 TenGigE  20 GigabitEthernet  8 DWDM controller(s)  8 WANPHY controller(s)  44 GigabitEthernet/IEEE 802.3 interface(s)  219k bytes of non-volatile configuration memory.  2880M bytes of hard disk.  3932144k bytes of disk0: (Sector size 512 bytes).    Configuration register on node 0/RSP0/CPU0 is 0x2102",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "An attacker could exploit this vulnerability by sending multiple UDP broadcast packets to an interface that is configured with an IPv4 helper address. This would cause a buffer leak in the Software Packet Path (SPP) on the active Route Processor (RP) of the affected device.\r\n\r\nConsumption of all available SPP buffers on the active RP would cause the device to start dropping control plane traffic, including routing protocol packets. While experiencing this problem, traffic that is destined to the device and, depending on the information learned from the routing protocols, pass-through traffic could be dropped, resulting in a DoS condition. A manual reload of the device would be needed to restore operations.\r\n\r\nSPP buffers utilization on the active RP can be monitored using the show spp buffers location CLI command. The active RP can be identified with the show redundancy CLI command.\r\n\r\nThe following example shows the output of the show redundancy CLI command on a device with 0/RSP0/CPU0 in the active RP role:\r\nRP/0/RSP0/CPU0:Router#show redundancy\n Redundancy information for node 0/RSP0/CPU0: ========================================== Node 0/RSP0/CPU0 is in ACTIVE role . . .\r\n\r\nThe following example shows the output of the show spp buffer location 0/RSP0/CPU0 CLI command on an affected device:\r\n\r\n\r\nRP/0/RSP0/CPU0:Router#show spp buffer location 0/RSP0/CPU0\n SPP Buffer Analysis  PID Buffers 0 15065 225413 41108  Total Buffers in use: 49138 Owned by clients/spp (of which plugins): 41108/8030 (0) . . .\r\n\r\nA continuous increase of the Owned by clients buffers could be an indication of a buffer leak.\r\n The number of free buffers can be calculated by subtracting the number of Owned by SPP buffers from the number of buffers associated with PID 0. When the number of free buffers is reduced to 8192 or fewer, the affected device might be starting to drop control plane packets. In the previous example, the number of buffers associated with PID 0 is 15065 and the number of Owned by SPP buffers is 8030, so the number of free buffers is 15065 - 8030 = 7035.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "Exploitation of this vulnerability could cause the affected device to consume all available SPP buffers and generate error messages similar to the following:\r\nRP/0/RSP0/CPU0:Feb 23 17:25:11.697 : netio[340]: %PKT_INFRA-spp-4-PKT_ALLOC_FAIL : Failed to allocate 1 packets for sending\r\n\nFor a final confirmation on whether this message does indicate exploitation of this issue, please contact your support organization.",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttps://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n\r\nFixed Releases\r\n\r\nThis vulnerability has been corrected in Cisco IOS XR Software Release 6.3.2 and later.\r\n\r\nSoftware maintenance upgrades (SMUs) for Cisco Aggregation Services Router (ASR) 9000 Series have also been made available that address this vulnerability.\r\n                            IOS XR Release             SMU ID             ASR 9000 SMU Name                                5.3.4             AA14136\r\n             asr9k-px-5.3.4.CSCvi35625.tar [\"https://software.cisco.com/download/release.html?mdfid=282414851&softwareid=280867577&release=5.3.4\"] 1\r\n                                6.1.4             AA14137\r\n             asr9k-px-6.1.4.CSCvi35625.tar [\"https://software.cisco.com/download/release.html?mdfid=282414851&softwareid=280867577&release=6.1.4\"]                                6.2.3             AA14138\r\n             asr9k-px-6.2.3.CSCvi35625.tar [\"https://software.cisco.com/download/release.html?mdfid=282414851&softwareid=280867577&release=6.2.3\"]\r\n1 Note: An SMU including a partial fix named \"asr9k-px-5.3.4.CSCvh49341.tar\" was made available for a short time for Cisco IOS XR Software Release 5.3.4. After additional testing, this was verified to be an incomplete fix. Cisco recommends that customers who might have installed this SMU uninstall it and install the new SMU containing the complete fix referenced in the table.\r\nCustomers using a Cisco IOS XR platform other than ASR 9000 Series Routers, or running a Cisco IOS XR Software Release for which no SMU is listed in the previous table, are advised to upgrade the IOS XR Software or open a support case to evaluate upgrade options.\r\n\r\n\r\n\r\nCisco IOS XR Software can be downloaded from the Software Center [\"https://software.cisco.com/download/navigator.html\"] on Cisco.com by navigating to Downloads Home > Products > Routers > Service Provider Edge Routers or Service Provider Core Routers, selecting the appropriate product, and selecting  IOS XR Software.\r\n\r\nThe SMUs for Cisco ASR 9000 Series Routers can be downloaded from the Software Center [\"https://software.cisco.com/download/navigator.html\"] on Cisco.com by navigating to Downloads Home > Products > Routers > Service Provider Edge Routers > ASR 9000 Series Aggregation Services Routers > ASR 9xxx Router > Software on Chassis  >  IOS XR Software Maintenance Upgrades (SMU).",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during the resolution of a Cisco TAC support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS XR Software UDP Broadcast Forwarding Denial of Service Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180418-iosxr"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180418-iosxr",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180418-iosxr"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			},
			{
				"category": "external",
				"summary": "asr9k-px-5.3.4.CSCvi35625.tar",
				"url": "https://software.cisco.com/download/release.html?mdfid=282414851&amp;softwareid=280867577&amp;release=5.3.4"
			},
			{
				"category": "external",
				"summary": "asr9k-px-6.1.4.CSCvi35625.tar",
				"url": "https://software.cisco.com/download/release.html?mdfid=282414851&amp;softwareid=280867577&amp;release=6.1.4"
			},
			{
				"category": "external",
				"summary": "asr9k-px-6.2.3.CSCvi35625.tar",
				"url": "https://software.cisco.com/download/release.html?mdfid=282414851&amp;softwareid=280867577&amp;release=6.2.3"
			},
			{
				"category": "external",
				"summary": "Software Center",
				"url": "https://software.cisco.com/download/navigator.html"
			},
			{
				"category": "external",
				"summary": "Software Center",
				"url": "https://software.cisco.com/download/navigator.html"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco IOS XR Software UDP Broadcast Forwarding Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2018-04-18T16:00:00+00:00",
			"generator": {
				"date": "2022-09-03T03:03:14+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20180418-iosxr",
			"initial_release_date": "2018-04-18T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2018-04-18T15:41:01+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco IOS XR Software",
						"product": {
							"name": "Cisco IOS XR Software ",
							"product_id": "CSAFPID-5834"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2018-0241",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvi35625"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-5834"
				]
			},
			"release_date": "2018-04-18T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-5834"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 7.4,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.0/AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-5834"
					]
				}
			],
			"title": "Cisco IOS XR Software UDP Broadcast Forwarding Denial of Service Vulnerability"
		}
	]
}
