{
	"document": {
		"acknowledgments": [
			{
				"summary": "On September 5, 2017, the Apache Software Foundation publicly disclosed these vulnerabilities in the following security bulletins:\r\n\r\nCVE-2017-9805: http://struts.apache.org/docs/s2-052.html [\"http://struts.apache.org/docs/s2-052.html\"]\r\nCVE-2017-9804: http://struts.apache.org/docs/s2-050.html [\"http://struts.apache.org/docs/s2-050.html\"]\r\nCVE-2017-9793: http://struts.apache.org/docs/s2-051.html [\"http://struts.apache.org/docs/s2-051.html\"]"
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "On September 5, 2017, the Apache Software Foundation released security bulletins that disclosed three vulnerabilities in the Apache Struts 2 package. Of these vulnerabilities, the Apache Software Foundation classifies one as Critical Severity, one as Medium Severity, and one as Low Severity. For more information about the vulnerabilities, refer to the Details [\"#details\"] section of this advisory.\r\n\r\nMultiple Cisco products incorporate a version of the Apache Struts 2 package that is affected by these vulnerabilities.\r\n\r\nThe following Snort rule can be used to detect possible exploitation of this vulnerability: Snort SIDs 44315 and 44327 through 44330.\r\n\r\nThis advisory is available at the following link:\r\nhttps://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170907-struts2 [\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170907-struts2\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "For information about whether a product is affected by these vulnerabilities, refer to the Vulnerable Products [\"#vuln_prods\"] and Products Confirmed Not Vulnerable [\"#prods_not_vuln\"] sections of this advisory. The Vulnerable Products section includes Cisco bug IDs for each affected product. The bugs are accessible through the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"] and contain additional platform-specific information, including any available workarounds and fixed software releases.\r\n\r\nNote: Only Cisco products that include Struts are listed in the \"Vulnerable Products\" or \"Products Confirmed Not Vulnerable\" sections. If a Cisco product is not listed, then it does not include Struts and is therefore not affected.",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "The following table lists Cisco products that are affected by the vulnerabilities described in this advisory. If an asterisk (*) appears after a product name, the product is affected by the critical severity vulnerability: CVE-2017-9805, Apache Struts REST plug-in XML processing arbitrary code execution vulnerability. At the time of publication, four Cisco products were known to be affected by CVE-2017-9805.\r\n\r\nCisco documents detailed information about fixed software releases in the Cisco bugs listed in this table. The bugs are accessible through the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"]. When planning a software upgrade, customers should review the bugs directly because the bugs will have the most current and up-to-date information.\r\n\r\n                              Product              Cisco Bug ID              Fixed Release Availability                                  Network Management and Provisioning                                  Cisco Digital Media Manager              CSCvf86117 [\"https://tools.cisco.com/bugsearch/bug/CSCvf86117\"]              No fix expected (EoSWM) (19-Aug-2016)                                  Cisco MXE 3500 Series Media Experience Engines (*)              CSCvf86119 [\"https://tools.cisco.com/bugsearch/bug/CSCvf86119\"]              No fix expected (EoSWM) (2-Jan-2017)                                  Voice and Unified Communications Devices                                  Cisco Hosted Collaboration Solution for Contact Center (*)              CSCvf86143 [\"https://tools.cisco.com/bugsearch/bug/CSCvf86143\"]                                                 Video, Streaming, TelePresence, and Transcoding Devices                                  Cisco Video Distribution Suite for Internet Streaming (VDS-IS) (*)              CSCvf86124 [\"https://tools.cisco.com/bugsearch/bug/CSCvf86124\"]              Product updated with Struts 2.3.34 (29-Sept-2017)                                  Cisco Hosted Services                                  Cisco Network Performance Analysis (*)              CSCvf86134 [\"https://tools.cisco.com/bugsearch/bug/CSCvf86134\"]              Product updated with Struts 2.3.34 (12-Sept-2017)",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco has confirmed that the following products are not affected by the vulnerabilities described in this advisory.\r\n\r\nCollaboration and Social Media\r\n\r\nCisco Unified MeetingPlace\r\nCisco WebEx Meetings Server\r\nEndpoint Clients and Client Software\r\n\r\nCisco WebEx Management - SuperAdmin Control Panel\r\nNetwork Application, Service, and Acceleration\r\n\r\nCisco Data Center Network Manager\r\nNetwork and Content Security Devices\r\n\r\nCisco Identity Services Engine (ISE)\r\nCisco Secure Access Control System (ACS)\r\nNetwork Management and Provisioning\r\n\r\nCisco Prime Access Registrar\r\nCisco Prime Central for Service Providers\r\nCisco Prime Collaboration Assurance\r\nCisco Prime Collaboration Provisioning\r\nCisco Prime Home\r\nCisco Prime Infrastructure\r\nCisco Prime LAN Management Solution - Solaris\r\nCisco Prime License Manager\r\nCisco Prime Network Registrar IP Address Manager (IPAM)\r\nCisco Prime Network\r\nCisco Security Manager\r\nCisco Smart Net Total Care - Local Collector appliance\r\nCisco Unified Intelligence Center\r\nRouting and Switching - Enterprise and Service Provider\r\n\r\nCisco Broadband Access Center for Telco and Wireless\r\nVoice and Unified Communications Devices\r\n\r\nCisco Business Edition 4000\r\nCisco Emergency Responder\r\nCisco Enterprise Chat and Email\r\nCisco Finesse\r\nCisco Hosted Collaboration Mediation Fulfillment\r\nCisco MediaSense\r\nCisco SocialMiner\r\nCisco Unified Communications Manager IM & Presence Service (formerly CUPS)\r\nCisco Unified Communications Manager\r\nCisco Unified Contact Center Enterprise - Live Data server\r\nCisco Unified Contact Center Enterprise\r\nCisco Unified Contact Center Express\r\nCisco Unified Customer Voice Portal\r\nCisco Unified E-Mail Interaction Manager\r\nCisco Unified Intelligent Contact Management Enterprise\r\nCisco Unified SIP Proxy Software\r\nCisco Unified Survivable Remote Site Telephony Manager\r\nCisco Unified Web Interaction Manager\r\nCisco Unity Connection\r\nCisco Unity Express\r\nCisco Virtualized Voice Browser\r\nVideo, Streaming, TelePresence, and Transcoding Devices\r\n\r\nCisco Enterprise Content Delivery System (ECDS)\r\nCisco Hosted Services\r\n\r\nCisco Business Video Services Automation Software\r\nCisco Cloud Email Security\r\nCisco Cloud Web Security\r\nCisco Context Service\r\nCisco Deployment Automation Tool\r\nCisco Network Device Security Assessment Service\r\nCisco Partner Support Service 1.x\r\nCisco Prime Service Catalog\r\nCisco Services Provisioning Platform\r\nCisco Smart Net Total Care - Contracts Information System Process Controller\r\nCisco Smart Net Total Care\r\nCisco Spark\r\nCisco Tidal Performance Analyzer\r\nCisco Umbrella\r\nCisco Unified Service Delivery Platform\r\nCisco WebEx Meeting Center - Windows\r\nCisco WebEx Network-Based Recording (NBR) Management",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Apache Struts REST Plug-In XML Processing Arbitrary Code Execution Vulnerability\r\n\r\nA vulnerability in the Representational State Transfer (REST) plug-in of Apache Struts could allow an unauthenticated, remote attacker to execute arbitrary code.\r\n\r\nThe vulnerability is due to the improper deserialization of XML requests by the REST plug-in with the XStream handler of the affected software. An attacker could exploit this vulnerability by sending crafted XML content to a targeted system. A successful exploit could allow the attacker to execute arbitrary code on the system, which could result in a complete system compromise.\r\n\r\nThis vulnerability has been assigned the following CVE ID: CVE-2017-9805\r\n\r\nThe Security Impact Rating (SIR) of this vulnerability is Critical.\r\n\r\nApache Struts REST Plug-In Denial of Service Vulnerability\r\n\r\nA vulnerability in the REST plug-in for Apache Struts could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on a targeted system.\r\n\r\nThe vulnerability is due to insufficient validation of user-supplied input by the XStream library in the REST plug-in for the affected application. An attacker could submit crafted XML data to the affected system. A successful exploit could allow the attacker to cause a DoS condition on the targeted system.\r\n\r\nThis vulnerability has been assigned the following CVE ID: CVE-2017-9793\r\n\r\nThe SIR of this vulnerability is Medium.\r\n\r\nApache Struts URLValidator Resource Exhaustion Denial of Service Vulnerability\r\n\r\nA vulnerability in the URLValidator feature of Apache Struts could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected system.\r\n\r\nThe vulnerability is due to insufficient validation of user-supplied input when the affected software uses the URLValidator feature to validate URLs. An attacker could exploit this vulnerability by submitting a crafted URL in a form field of an application utilizing an affected version of Apache Struts. An exploit could trigger a condition in the regular expression (regex) processing by the URLValidator that would consume excessive amounts of CPU resources, resulting in a DoS condition.\r\n\r\nThis vulnerability has been assigned the following CVE ID: CVE-2017-9804\r\n\r\nThe SIR of this vulnerability is Low.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "Any workarounds that address these vulnerabilities will be documented in the Cisco bugs, which are accessible through the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"].",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Updates for affected software releases will be published when they are available and information about those updates will be documented in Cisco bugs, which are accessible through the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"].\r\n\r\nWhen Cisco releases software updates that address these vulnerabilities, customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html [\"https://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttps://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html [\"https://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n\r\nFixed Releases\r\n\r\nTo determine the affected and fixed releases for each vulnerable product, refer to the Cisco bug identified for the product in the Vulnerable Products [\"#vuln_prods\"] section of this advisory. Cisco bugs are accessible through the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/\"].",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of these vulnerabilities against Cisco products.\r\n\r\nFor CVE-2017-9805, Apache Struts REST plug-in XML processing arbitrary code execution vulnerability, there are reports of active exploitation in the wild. At the time of publication, this exploitation appears to be primarily scanning activity that is being performed in attempts to identify potentially vulnerable systems.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "On September 5, 2017, the Apache Software Foundation publicly disclosed these vulnerabilities in the following security bulletins:\r\n\r\nCVE-2017-9805: http://struts.apache.org/docs/s2-052.html [\"http://struts.apache.org/docs/s2-052.html\"]\r\nCVE-2017-9804: http://struts.apache.org/docs/s2-050.html [\"http://struts.apache.org/docs/s2-050.html\"]\r\nCVE-2017-9793: http://struts.apache.org/docs/s2-051.html [\"http://struts.apache.org/docs/s2-051.html\"]",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Multiple Vulnerabilities in Apache Struts 2 Affecting Cisco Products: September 2017",
				"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170907-struts2"
			}
		],
		"title": "Multiple Vulnerabilities in Apache Struts 2 Affecting Cisco Products: September 2017",
		"tracking": {
			"current_release_date": "2017-10-23T20:27:00+00:00",
			"generator": {
				"date": "2022-07-15T02:15:42+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20170907-struts2",
			"initial_release_date": "2017-09-07T21:00:00+00:00",
			"revision_history": [
				{
					"date": "2017-09-07T21:20:08+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2017-09-08T20:12:43+00:00",
					"number": "1.1.0",
					"summary": "Updated the lists of products for Vulnerable, Not Vulnerable, and Under Investigation sections. Added the SIR value for each vulnerability. Added information about public exploitation."
				},
				{
					"date": "2017-09-11T19:33:57+00:00",
					"number": "1.2.0",
					"summary": "Updated the lists of products for Vulnerable, Not Vulnerable, and Under Investigation sections."
				},
				{
					"date": "2017-09-12T19:53:19+00:00",
					"number": "1.3.0",
					"summary": "Updated the lists of products for Vulnerable, Not Vulnerable, and Under Investigation sections."
				},
				{
					"date": "2017-09-13T18:37:39+00:00",
					"number": "1.4.0",
					"summary": "Updated the lists of products for Vulnerable, Not Vulnerable, and Under Investigation sections."
				},
				{
					"date": "2017-09-14T17:30:46+00:00",
					"number": "1.5.0",
					"summary": "Updated the lists of products for Vulnerable, Not Vulnerable, and Under Investigation sections."
				},
				{
					"date": "2017-09-15T18:27:38+00:00",
					"number": "1.6.0",
					"summary": "Updated the lists of products for Vulnerable, Not Vulnerable, and Under Investigation sections."
				},
				{
					"date": "2017-09-18T18:10:53+00:00",
					"number": "1.7.0",
					"summary": "Updated the lists of products for Vulnerable, Not Vulnerable, and Under Investigation sections. Under Affected Products added further clarification on products not listed."
				},
				{
					"date": "2017-09-21T15:51:56+00:00",
					"number": "1.8.0",
					"summary": "Updated the lists of products for Vulnerable, Not Vulnerable, and Under Investigation sections."
				},
				{
					"date": "2017-09-25T14:22:02+00:00",
					"number": "1.9.0",
					"summary": "Updated the lists of products for Vulnerable, Not Vulnerable, and Under Investigation sections."
				},
				{
					"date": "2017-09-28T11:23:40+00:00",
					"number": "1.10.0",
					"summary": "Updated the list of Products Confirmed Not Vulnerable."
				},
				{
					"date": "2017-10-03T19:43:29+00:00",
					"number": "1.11.0",
					"summary": "Updated the Vulnerable Products table with information about fixes. Updated Summary, Affected Products, Vulnerable Products, and Fixed Software to \"Final status\" language."
				},
				{
					"date": "2017-10-23T20:27:39+00:00",
					"number": "1.12.0",
					"summary": "Updated the list of Products Confirmed Not Vulnerable to add Cisco Umbrella."
				}
			],
			"status": "final",
			"version": "1.12.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"cve": "CVE-2017-9793",
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Apache Struts 2 Affecting Cisco Products: September 2017",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170907-struts2"
				}
			],
			"release_date": "2017-09-06T11:25:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "Any workarounds that address these vulnerabilities will be documented in the Cisco bugs, which are accessible through the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"]."
				}
			],
			"title": "Apache Struts REST Plugin Denial of Service Vulnerability"
		},
		{
			"cve": "CVE-2017-9804",
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Apache Struts 2 Affecting Cisco Products: September 2017",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170907-struts2"
				}
			],
			"release_date": "2017-09-06T11:32:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "Any workarounds that address these vulnerabilities will be documented in the Cisco bugs, which are accessible through the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"]."
				}
			],
			"title": "Apache Struts URLValidator Resource Exhaustion Denial of Service Vulnerability"
		},
		{
			"cve": "CVE-2017-9805",
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Apache Struts 2 Affecting Cisco Products: September 2017",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170907-struts2"
				}
			],
			"release_date": "2017-09-06T11:39:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "Any workarounds that address these vulnerabilities will be documented in the Cisco bugs, which are accessible through the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"]."
				}
			],
			"title": "Apache Struts REST Plug-in XML Processing Arbitrary Code Execution Vulnerability"
		}
	]
}
