{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was reported to Cisco by Steven Seeley of Source Incite working with Trend Micro Zero Day Initiative."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Multiple buffer overflow vulnerabilities exist in the Cisco WebEx Network Recording Player for Advanced Recording Format (ARF) files. An attacker could exploit these vulnerabilities by providing a user with a malicious ARF file via email or URL and convincing the user to launch the file. Exploitation of these vulnerabilities could cause an affected player to crash and, in some cases, could allow arbitrary code execution on the system of a targeted user.\r\n\r\nThe Cisco WebEx Network Recording Player is an application that is used to play back WebEx meeting recordings that have been recorded on the computer of an online meeting attendee. The player can be automatically installed when the user accesses a recording file that is hosted on a WebEx server.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nThis advisory is available at the following link:\r\nhttps://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170621-wnrp [\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170621-wnrp\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects the Cisco WebEx ARF Player. The following client builds are affected by this vulnerability:\r\n\r\nCisco WebEx Business Suite (WBS29) client builds prior to T29.13.130\r\nCisco WebEx Business Suite (WBS30) client builds prior to T30.17\r\nCisco WebEx Business Suite (WBS31) client builds prior to T31.10\r\n  To determine whether a Cisco WebEx meeting site is running an affected version of the WebEx client build, users can log in to their Cisco WebEx meeting site and go to the Support > Downloads section. The version of the WebEx client build will be displayed on the right side of the page under \"About Support Center.\"\r\n\r\nAlternatively, version information of the Cisco WebEx Meeting client can be accessed from within the Cisco WebEx Meeting client. Version information for the Cisco WebEx meeting client on Windows and Linux platforms can be viewed by choosing Help > About Cisco WebEx Meeting Center. Version information for the Cisco WebEx meeting client on Mac platforms can be viewed by choosing Meeting Center > About Cisco WebEx Meeting Center.\r\n\r\nThe Cisco WebEx software updates are cumulative in client builds. For example, if client build 29.32.16 is fixed, build 29.32.17 will contain updated software. Cisco WebEx site administrators have access to secondary version nomenclature, for example, T29 SP32 EP16, which shows that the server is running client build 29.32.16.\r\n\r\nNote: Customers who do not receive automatic software updates may be running versions of Cisco WebEx that have reached end of software maintenance and should contact customer support.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect the Cisco WebEx WRF Player.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The Cisco WebEx Business Suite (WBS) meeting services are a hosted multimedia conferencing solution that is managed and maintained by Cisco WebEx. The Cisco WebEx Meetings Server is a multimedia conferencing solution that customers can host in their private clouds.\r\n\r\nThe ARF file format is used to store WebEx meeting recordings that have been recorded on a WebEx meeting site.\r\n\r\nThe Cisco WebEx ARF Player is an application that is used to play back and edit WebEx ARF recording files (files with .arf extensions).\r\n\r\nThe Cisco WebEx ARF Player can be automatically installed when the user accesses a recording file that is hosted on a WebEx meeting site (for stream playback mode). The Cisco WebEx ARF Player can also be manually installed after downloading the application from http://www.webex.com/play-webex-recording.html [\"http://www.webex.com/play-webex-recording.html\"] to play back recording files for offline playback.\r\n\r\nThe Cisco WebEx ARF Player is available for all Cisco WebEx Business Suite clients (WBS29, WBS30, and WBS31), Cisco WebEx Meetings, and for Cisco WebEx Meetings Server clients.\r\n\r\nExploitation of this vulnerability may cause player applications to crash or, in some cases, remote code execution could occur.\r\n\r\nTo exploit this vulnerability, the player application would need to open a malicious ARF file. An attacker may be able to accomplish this exploit by providing the malicious recording file directly to users (for example, by using email), or by directing a user to a malicious web page. The vulnerabilities cannot be triggered by users who are attending a WebEx meeting.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability. However, it is possible to remove all WebEx software completely from a system using the Meeting Services Removal Tool (for Microsoft Windows users) or Mac Cisco-WebEx Uninstaller (for Apple Mac OS X users) available at https://help.webex.com/docs/DOC-2672 [\"https://help.webex.com/docs/DOC-2672\"].\r\n\r\nRemoval of WebEx software from a Linux or UNIX-based system can be accomplished by following the steps in the WebEx knowledge base help article at the following link: https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux# [\"https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux\"].",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttp://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html [\"http://www.cisco.com/c/en/us/td/docs/general/warranty/English/EU1KEN_.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to upgrade contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttp://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html [\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n\r\nFixed Releases\r\n\r\nThe following client builds of Cisco WebEx Business Suite (WBS29, WBS30, WBS31) address this vulnerability:\r\n\r\nCisco WebEx Business Suite (WBS29) client builds T29.13.130 or later\r\nCisco WebEx Business Suite (WBS30) client builds T30.17 or later\r\nCisco WebEx Business Suite (WBS31) client builds T31.10 or later\r\n  To determine whether a Cisco WebEx meeting site is running an affected version of the WebEx client build, users can log in to their Cisco WebEx meeting site and go to the Support > Downloads section. The version of the WebEx client build will be displayed on the right side of the page under \"About Support Center.\" The Cisco WebEx software updates are cumulative in client builds. For example, if client build 29.32.16 is fixed, build 29.32.17 will contain updated software.\r\n\r\nUsers who have downloaded the ARF player directly from the WebEx site can update their player manually by downloading the application from http://www.webex.com/play-webex-recording.html [\"http://www.webex.com/play-webex-recording.html\"].\r\n\r\nNOTE: Users whose WebEx Business Suites are on lockdown will need to contact WebEx Support to apply the appropriate patch to their WebEx site.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was reported to Cisco by Steven Seeley of Source Incite working with Trend Micro Zero Day Initiative.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco WebEx Network Recording Player Multiple Buffer Overflow Vulnerabilities",
				"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170621-wnrp"
			}
		],
		"title": "Cisco WebEx Network Recording Player Multiple Buffer Overflow Vulnerabilities",
		"tracking": {
			"current_release_date": "2017-06-26T15:12:00+00:00",
			"generator": {
				"date": "2022-07-15T02:11:27+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20170621-wnrp",
			"initial_release_date": "2017-06-21T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2017-06-21T15:18:30+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2017-06-26T15:12:57+00:00",
					"number": "1.1.0",
					"summary": "Corrected the source information."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco WebEx ARF Player",
						"product": {
							"name": "Cisco WebEx ARF Player ",
							"product_id": "CSAFPID-100455"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2017-6669",
			"notes": [
				{
					"category": "other",
					"text": "CSCvc47758,CSCvc51227,CSCvc51242",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-100455"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco WebEx Network Recording Player Multiple Buffer Overflow Vulnerabilities",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170621-wnrp"
				}
			],
			"release_date": "2017-06-21T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability. However, it is possible to remove all WebEx software completely from a system using the Meeting Services Removal Tool (for Microsoft Windows users) or Mac Cisco-WebEx Uninstaller (for Apple Mac OS X users) available at https://help.webex.com/docs/DOC-2672 [\"https://help.webex.com/docs/DOC-2672\"].\r\n\r\nRemoval of WebEx software from a Linux or UNIX-based system can be accomplished by following the steps in the WebEx knowledge base help article at the following link: https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux# [\"https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux\"]."
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 7.3,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-100455"
					]
				},
				{
					"cvss_v3": {
						"baseScore": 7.3,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-100455"
					]
				}
			],
			"title": "Cisco WebEx Network Recording Player Multiple Buffer Overflow Vulnerabilities"
		}
	]
}
