{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "On May 1st, 2017, Intel released a security advisory titled Intel Active Management Technology, Intel Small Business Technology, and Intel Standard Manageability Escalation of Privilege, also known as INTEL-SA-00075. The advisory details a vulnerability in the Intel Active Management (AMT), Intel Small Business (ISB), and Intel Standard Manageability (ISM) firmware modules included with some Intel-based platforms.\r\n\r\nThe Cisco PSIRT Team has investigated the impact of this vulnerability on Cisco products and determined that no Cisco products are affected.\r\n\r\nAdditional Information\r\nAdditional information about the vulnerability can be found at the following links:\r\n\r\nIntel Security Advisory: Intel Active Management Technology, Intel Small Business Technology, and Intel Standard Manageability Escalation of Privilege [\"https://security-center.intel.com/advisory.aspx?intelid=INTEL-SA-00075&languageid=en-fr\"]\r\nCisco Multivendor Security Alert: Intel Active Management Technology Privilege Escalation Vulnerability [\"https://tools.cisco.com/security/center/viewAlert.x?alertId=53677\"]\r\nUS-CERT Vulnerability Note: VU#491375 [\"http://www.kb.cert.org/vuls/id/491375\"]\r\n\r\nCisco Security Procedures\r\nComplete information on reporting security vulnerabilities in Cisco  products, obtaining assistance with security incidents, and registering to  receive security information from Cisco is available on the Cisco worldwide  website at  http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"].  This includes instructions for press inquiries regarding Cisco security advisories. All Cisco security advisories are available at  http://www.cisco.com/go/psirt [\"http://www.cisco.com/go/psirt\"].",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Intel Active Management Technology Privilege Escalation Vulnerability",
				"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170512-intelamt"
			}
		],
		"title": "Intel Active Management Technology Privilege Escalation Vulnerability",
		"tracking": {
			"current_release_date": "2017-05-12T18:30:00+00:00",
			"generator": {
				"date": "2022-07-15T02:17:55+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20170512-intelamt",
			"initial_release_date": "2017-05-12T18:30:00+00:00",
			"revision_history": [
				{
					"date": "2017-05-12T18:31:11+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"cve": "CVE-2017-5689",
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Intel Active Management Technology Privilege Escalation Vulnerability",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170512-intelamt"
				}
			],
			"release_date": "2017-05-02T17:02:00+00:00",
			"title": "Intel Active Management Technology Privilege Escalation Vulnerability"
		}
	]
}
