{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during internal security testing."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A privilege escalation vulnerability in the Secure Shell (SSH) subsystem in the StarOS operating system for Cisco ASR 5000 Series, ASR 5500 Series, ASR 5700 Series devices, and Cisco Virtualized Packet Core could allow an authenticated, remote attacker to gain unrestricted, root shell access.\r\n\r\nThe vulnerability is due to missing input validation of parameters passed during SSH or SFTP login. An attacker could exploit this vulnerability by providing crafted user input to the SSH or SFTP command-line interface (CLI) during SSH or SFTP login. An exploit could allow an authenticated attacker to gain root privileges access on the router.\r\n\r\nNote: Only traffic directed to the affected system can be used to exploit this vulnerability. This vulnerability can be triggered via both IPv4 and IPv6 traffic. An established TCP connection toward port 22, the SSH default port, is needed to perform the attack. The attacker must have valid credentials to login to the system via SSH or SFTP.\r\n\r\nCisco has released software updates that address this vulnerability. Workarounds that mitigate this vulnerability are not available.\r\n\r\nThis advisory is available at the following link:\r\nhttps://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170315-asr [\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170315-asr\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "The following products have been confirmed to be vulnerable:\r\n\r\nCisco ASR 5000/5500/5700 Series devices running StarOS after 17.7.0 and prior to 18.7.4, 19.5, and 20.2.3 with SSH configured are vulnerable.\r\nCisco Virtualized Packet Core - Single Instance (VPC-SI) and Distributed Instance (VPC-DI) devices running StarOS prior to N4.2.7 (19.3.v7) and N4.7 (20.2.v0) with SSH configured are vulnerable.\r\n  To determine whether a vulnerable version of Cisco StarOS is running on ASR 5000/5500/5700 Series devices, administrators can issue the show version command from the CLI. The following output is an example of a router that is running StarOS version 19.2.1.\r\n[local]ASR-2# show version\r\nFriday August 12 13:17:31 AST 2016\r\nActive Software:\r\n  Image Version:                  19.2.1\r\n  Image Build Number:             62564\r\n  Image Description:              Deployment_Build\r\n  Image Date:                     Thu Dec 31 20:13:39 EST 2015\r\n  Boot Image:                     /flash/asr5500-19.2.1.bin\r\nSimilarly, administrators can issue the show version command from the CLI to determine whether a vulnerable version of Cisco StarOS is running on a vPC-SI or vPC-DI instance. The following output is an example of a vPC instance that is running StarOS version N4.6 (20.1.v0):\r\n[local]vPC-DI# show version\r\nActive Software:\r\n Image Version:                  20.1.v0\r\n Image Build Number:             64657\r\n Image Description:              Deployment_Build\r\n Image Date:                     Wed Jul 27 18:46:53 EDT 2016\r\n Boot Image:                     /flash/qvpc-di-20.1.v0.bin\r\nTo determine whether SSH is configured on Cisco StarOS or Cisco vPC software, administrators can issue the show configuration | grep sshd command from the CLI. In the following example, the presence of the server sshd line shows that the SSH server is enabled:\r\n[local]ASR-2# show configuration | grep sshd\r\n    server sshd",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco has confirmed that this vulnerability does not affect the following products:\r\n\r\nCisco Elastic Services Controller (ESC)\r\nCisco Ultra Automation Services (UAS)\r\n  No other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Successful exploitation of this vulnerability causes CLI logs to show a CLI session starting for the compromised user and the same CLI session ending within a few milliseconds. Administrators can view CLI logs by using the show logs facility cli command. In the following example, the user inspector exploited this vulnerability.\r\n[local]ASR-2# show logs facility cli\r\n2017-Feb-01+13:33:08.477 [cli 30005 info] [6/0/14607 <cli:6014607> _commands_cli.c:1775] [software internal system syslog] CLI session ended for Inspector inspector on device\r\n2017-Feb-01+13:33:08.455 [cli 30004 info] [6/0/14607 <cli:6014607> cli_sess.c:127] [software internal system syslog] CLI session started for Inspector inspector on device  from 10.X.X.X\r\n.\r\n.\r\n.",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.\r\n\r\nAdministrators can restrict access to the management interface, (for example, by applying an access control list (ACL)), to limit the attack surface.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttp://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html [\"http://www.cisco.com/c/en/us/td/docs/general/warranty/English/EU1KEN_.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to upgrade contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttp://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html [\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n\r\nFixed Releases\r\n\r\nIn the following tables, the left column lists major releases of Cisco StarOS and Cisco vPC software, respectively. The right column indicates whether a major release is affected by the vulnerability described in this advisory and the first release that includes the fix for this vulnerability.\r\n\r\n  StarOS for Cisco ASR 5000/5500/5700 Series Routers\r\n                                 Cisco StarOS Major Release\r\n               First Fixed Release\r\n                                               17.7 and earlier\r\n               Not affected\r\n                                   18.0               18.7.4                                   19.0               19.5                                   20.0               20.2.3                                   21.0               Not affected\r\n\r\nCisco Virtualized Packet Core (vPC) Software\r\n                                 Cisco vPC Major Release\r\n              First Fixed Release\r\n                                               N4.0 (19.2)\r\n               Affected; migrate to N4.2.7 (19.3.v7) or later\r\n                                   N4.2 (19.3)\r\n               N4.2.7 (19.3.v7)\r\n                                   N4.5 (20.0)\r\n               Affected; migrate to N4.7 (20.2.v0) or later\r\n                                   N4.6 (20.1)\r\n               Affected; migrate to N4.7 (20.2.v0) or later\r\n                                   N4.7 (20.2)\r\n               Fixed\r\n                                   N5.0 (21.0)\r\n               Not affected",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during internal security testing.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco StarOS SSH Privilege Escalation Vulnerability",
				"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170315-asr"
			}
		],
		"title": "Cisco StarOS SSH Privilege Escalation Vulnerability",
		"tracking": {
			"current_release_date": "2017-03-15T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T01:39:22+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20170315-asr",
			"initial_release_date": "2017-03-15T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2017-03-15T15:31:57+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco ASR 5000 Series Software",
						"product": {
							"name": "Cisco ASR 5000 Series Software ",
							"product_id": "CSAFPID-193199"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco Virtualized Packet Core",
						"product": {
							"name": "Cisco Virtualized Packet Core ",
							"product_id": "CSAFPID-217771"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2017-3819",
			"notes": [
				{
					"category": "other",
					"text": "CSCva65853",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-193199",
					"CSAFPID-217771"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco StarOS SSH Privilege Escalation Vulnerability",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170315-asr"
				}
			],
			"release_date": "2017-03-15T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability.\r\n\r\nAdministrators can restrict access to the management interface, (for example, by applying an access control list (ACL)), to limit the attack surface."
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 8.8,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-193199",
						"CSAFPID-217771"
					]
				},
				{
					"cvss_v3": {
						"baseScore": 8.8,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-193199",
						"CSAFPID-217771"
					]
				}
			],
			"title": "Cisco StarOS SSH Privilege Escalation Vulnerability"
		}
	]
}
