{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was reported to Cisco by Tavis Ormandy of Google."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in Cisco WebEx browser extensions could allow an unauthenticated, remote attacker to execute arbitrary code with the privileges of the affected browser on an affected system. This vulnerability affects the browser extensions for Cisco WebEx Meetings Server and Cisco WebEx Centers (Meeting Center, Event Center, Training Center, and Support Center) when they are running on Microsoft Windows.\r\n\r\nThe vulnerability is due to a design defect in an application programing interface (API) response parser within the plugin. An attacker that can convince an affected user to visit an attacker-controlled web page or follow an attacker-supplied link with an affected browser could exploit the vulnerability.  If successful, the attacker could execute arbitrary code with the privileges of the affected browser.\r\n\r\nCisco has released software updates for Google Chrome, Firefox, and Internet Explorer that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nThis advisory is available at the following link:\r\nhttps://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170124-webex [\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170124-webex\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects Cisco WebEx extensions and plugins for Windows when running on most supported browsers. The affected browsers are Google Chrome, Mozilla Firefox, and Internet Explorer for Windows.\r\n\r\nThe following versions of the Cisco WebEx browser extensions are affected by the vulnerability described in this document:\r\n\r\nVersions prior to 1.0.7 of the Cisco WebEx Extension on Google Chrome\r\nVersions prior to 106 of the ActiveTouch General Plugin Container on Mozilla Firefox\r\nVersions prior to the first fixed version of the GpcContainer Class ActiveX control plugin on Internet Explorer - See the Fixed Software [\"#fcontainer\"] section\r\nVersions prior to 2.1.0.10 of the Download Manager ActiveX control plugin on Internet Explorer\r\n  Customers can determine which versions of the Cisco WebEx extensions are being utilized by following the steps listed below:\r\n\r\nGoogle Chrome\r\nCisco WebEx Extension for Google Chrome version 1.0.7 was released on January 26, 2017, and contains a fix for this vulnerability. Chrome users can ensure they are using the fixed version of the Cisco WebEx Extension for Google Chrome by doing the following:\r\n\r\nIn Chrome, open the Settings page\r\nClick Extensions\r\n  The extension version is listed next to the Cisco WebEx Extension name.\r\n\r\nThe Cisco WebEx Extension for Google Chrome identification string, which organizations can use to identify hosts that contain the plugin, is the following:\r\n\r\nJlhmfgmfgeifomenelglieieghnjghma\r\n\r\nMozilla Firefox\r\nVersion 106 of the ActiveTouch General Plugin Container for Mozilla Firefox was released on January 28, 2017, and contains a fix for this vulnerability. Mozilla users can ensure they are using the fixed version of the ActiveTouch General Plugin Container for Mozilla by:\r\n\r\nClicking the menu button (three horizontal bars on the upper right of the application) and selecting Add-ons\r\nIn the Add-ons Manager tab, click the Plugins panel\r\nLocate the ActiveTouch General Plugin Container in the list of Plugins and click on the More link to obtain the version information\r\n\r\nThe Cisco WebEx NPAPI Plugin for Mozilla Firefox identification string, which organizations can use to identify hosts that contain the plugin, is the following:\r\natgpccontrol\r\n    Microsoft Internet Explorer\r\nVersions of the Cisco WebEx Plugin for Microsoft Internet Explorer were released on January 28, 2017, and contain a fix for this vulnerability. The registered name of the plugin in Internet Explorer may differ based on the installation method used for the plugin. The fixed version of the plugin depends on the version of Cisco WebEx that provided the update. The update may have been applied either via the web when joining a WebEx meeting or by a local update of the client via an MSI file. Internet Explorer users can ensure they are using the fixed version of the plugin for Internet Explorer by:\r\n\r\nIn Internet Explorer, select the Tools button\r\nSelect Manage add-ons\r\nSelect All add-ons from the Show drop-down menu\r\nSelect either Download Manager or GpcContainer Class add-on under Cisco WebEx LLC\r\n\r\nThe version number is displayed at the bottom of the Manage Add-ons window. See the table of fixed plugin versions in the Fixed Software [\"#fcontainer\"] section of this advisory.\r\n\r\nThe Cisco WebEx ActiveX Plugin for Microsoft Internet Explorer Class ID (CLSID), which organizations can use to identify hosts that contain the plugin, is the following:\r\n\r\nE06E2E99-0AA1-11D4-ABA6-0060082AA75C",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.\r\n\r\nCisco WebEx Productivity Tools are not affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect Cisco WebEx browser extensions for Mac or Linux, or Cisco WebEx on Microsoft Edge.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability. However, administrators and users of Windows 10 systems may utilize Microsoft Edge to join and participate in WebEx sessions as Microsoft Edge is not affected by this vulnerability. Additionally, administrators and users can remove all WebEx software from a Windows system by using the Meeting Services Removal Tool, which is available from https://help.webex.com/docs/DOC-2672 [\"https://help.webex.com/docs/DOC-2672\"].\r\n\r\nCustomers who currently have web proxies or web gateways in their environment can create a URL filtering policy to block web requests matching the following condition:\r\n\r\nURL requests containing the string pattern \"cwcsf-nativemsg-iframe-43c85c0d-d633-af5e-c056-32dc7efc570b.html\"\r\nand\r\nURL hostname not matching the known customer's WebEx site URL (e.g. company.webex.com in https://company.webex.com/cwcsf-nativemsg-iframe-43c85c0d-d633-af5e-c056-32dc7efc570b.html)",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttp://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html [\"http://www.cisco.com/c/en/us/td/docs/general/warranty/English/EU1KEN_.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to upgrade contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttp://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html [\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n\r\nFixed Releases\r\nFor the latest information about the following products, please consult the Cisco bug ID provided:\r\n\r\nCisco WebEx Meeting Center: CSCvc86959 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvc86959\"]\r\nCisco WebEx Event Center: CSCvc95037 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvc95037\"]\r\nCisco WebEx Training Center: CSCvc95034 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvc95034\"]\r\nCisco WebEx Support Center: CSCvc95044 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvc95044\"]\r\nCisco WebEx Meetings Server: CSCvc88194 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvc88194\"]\r\nCisco WebEx Meetings: CSCvc88535 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvc88535\"]\r\nBrowser Plugin Updates\r\n\r\nGoogle Chrome\r\nCisco WebEx Extension for Google Chrome version 1.0.7 was released on January 26, 2017, and contains a fix for this vulnerability. Chrome users can ensure they are using the fixed version of the Cisco WebEx Extension for Google Chrome by doing the following:\r\n\r\nIn Chrome, open the Settings page\r\nClick Extensions\r\nSelect the Developer mode checkbox\r\nClick Update extensions now\r\nRestart the Chrome browser\r\nMicrosoft Internet Explorer and Mozilla Firefox\r\nCisco released updated plugins for Microsoft Internet Explorer and Mozilla Firefox on January 28, 2017, that resolve this vulnerability. The plugins are available as part of the Cisco WebEx Client packages associated with each WebEx product, and will be available to download after a WebEx site has been upgraded to a fixed version. Upgraded clients are available from the Downloads section of each site after an upgrade has been performed. Users that connect to an upgraded site without the updated client software may be prompted to perform an online upgrade.\r\n\r\nCustomers may check that the browser plugin upgrade was successful by using the following procedures for Microsoft Internet Explorer and Mozilla Firefox:\r\n\r\nMicrosoft Internet Explorer\r\nThe Cisco WebEx Plugin for Microsoft Internet Explorer was released on January 28, 2017, and contains a fix for this vulnerability. The registered name of the plugin in Internet Explorer may differ based on the installation method used for the plugin. The version of the plugin depends on the version of Cisco WebEx that provided the update. The update may have been applied either via the web when joining a WebEx meeting or by a local update of the client via an MSI file. When a fixed version of the plugin from any version of Cisco WebEx is installed, it will not be downgraded or changed to a version installed by a different fixed version of Cisco WebEx. Internet Explorer users can ensure they are using the fixed version of the plugin for Internet Explorer by:\r\n\r\nIn Internet Explorer, select the Tools button\r\nSelect Manage add-ons\r\nSelect All add-ons from the Show drop-down menu\r\nSelect either Download Manager or GpcContainer Class add-on under Cisco WebEx LLC\r\nValidate that the Download Manager Version or GpcContainer Class Version shows as 2.1.0.10 or later, or one of the versions strings in the following table:\r\n\r\nThe version number is displayed at the bottom of the Manage Add-ons window.\r\n\r\n                              Cisco WebEx Major Version\r\n               Fixed GPC Container Version                                   T31.10.0               10031.6.2017.0126                                   T31.9.8               10031.6.2017.0126                                   T30.16.2               10030.100.2017.127                                   T30.15.5               10030.100.2017.0127                                   T30.14.2               10030.0.2017.0127                                   T30.12.4               10030.1204.2017.0127                                   T30.9.2               10030.100.2017.0127                                   T30.6.6               10030.100.2017.0127                                   T30.4.4               10030.100.2017.127                                   T29.13.121               29.13.2017.0127                                   T29.13.94               29.13.2017.0127                                   T29.13.73               29.13.2017.0127                                   T29.13.56               29.13.2017.0127                                   T29.13.42               29.13.2017.0127\r\n                                   T29.13.35               29.13.2017.0127\r\n                                   T29.13.14               29.13.2017.0127\r\n\r\n\r\nMozilla Firefox\r\n\r\nVersion 106 of the ActiveTouch General Plugin Container (10031.6.2017.127) for Mozilla Firefox was released on January 28, 2017, and contains a fix for this vulnerability. Mozilla users can ensure they are using the first fixed or later version of the ActiveTouch General Plugin Container for Mozilla by:\r\nClicking the menu button (three horizontal bars on the upper right of the application) and selecting Add-ons\r\nIn the Add-ons Manager tab, click the Plugins panel\r\nLocate the ActiveTouch General Plugin Container in the list of Plugins and click on the More link to obtain the version information\r\n\r\nValidating Cisco WebEx Meeting Center Product Upgrades\r\nCisco has upgraded all unlocked customers of the following products to a fixed version:\r\n\r\nCisco WebEx Meeting Center\r\nCisco WebEx Event Center\r\nCisco WebEx Training Center\r\nCisco WebEx Support Center\r\nCisco WebEx Meetings\r\n  Customers utilizing a locked version of a Cisco WebEx Meeting Center product will need to request an upgrade with their Cisco service representative (CSR) or Cisco partner.\r\n\r\nCurrent WebEx customers can confirm that their site has received updated software by reviewing the Application Version information found in the Support section of their WebEx page. To view this information, please perform the followings steps:\r\nSign in to your WebEx account\r\nClick the Meeting Center tab\r\nUnder Support, click Downloads\r\n  The Application Version is displayed on the right side of the screen under the About Meeting Center heading.\r\n\r\n                              Cisco WebEx Major Version\r\n               Fixed Application Version\r\n                                   T31.10.2               31.10.2.5 or later                                   T31.9.8               31.9.8.5 or later                                   T30.16.2               30.16.2.10007 E or later\r\n                                   T30.15.5               30.15.5.10009 E or later\r\n                                   T30.14.2               30.14.2.10003 E or later\r\n                                   T30.12.4               30.12.4.10004 E or later\r\n                                   T30.9.2               30.9.2.10010 E or later                                   T30.6.6               30.6.6.10006 E or later                                   T30.4.4               30.4.4.10003 E or later\r\n                                   T29.13.121               29.13.121.10011 E or later                                   T29.13.94               29.13.94.10005 E or later                                   T29.13.73               29.13.72.10007 E or later                                   T29.13.56               29.13.56.10008 E or later                                   T29.13.42               29.13.42.10008 E or later                                   T29.13.35               29.13.25.10005 E  or later                                   T29.13.14               29.13.14.10012 E or later\r\n  Note: The clients for all licensed features of a Cisco WebEx product must be upgraded to ensure compatibility with the deployed site application version. Upgrading a single client will resolve the vulnerability documented by CVE-2017-3823. The following clients are available:\r\n\r\nCisco WebEx Meeting Center Client\r\nCisco WebEx Event Center Client\r\nCisco WebEx Training Center Client\r\nCisco WebEx Support Center Client\r\nCisco WebEx Access Anywhere Client\r\nCisco WebEx Remote Access Client\r\nCisco WebEx Meetings Server\r\nCustomers who have deployed Cisco WebEx Meetings Server, the onsite Cisco WebEx offering, can download updated software at https://software.cisco.com/download/navigator.html?mdfid=282628019&flowid=76922 [\"https://software.cisco.com/download/navigator.html?mdfid=282628019&flowid=76922\"] or choose the following options from the Cisco Download Software [\"https://software.cisco.com/download/navigator.html\"] page:  Products > Conferencing > Web Conferencing > WebEx Meetings Server\r\n\r\nCisco WebEx Meetings Server version 2.0 customers should migrate to Cisco WebEx Meetings Server 2.5 or later. The following releases of Cisco WebEx Meetings Server have been updated to address this vulnerability:\r\n\r\nWebEx Meetings Server 2.5MR6 Patch 4\r\nWebEx Meetings Server 2.6MR3 Patch 2\r\nWebEx Meetings Server 2.7MR2 Patch 1\r\n\r\nCisco WebEx Meetings Server client packages will be available as part of the upgraded solution.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) has been notified of ongoing, but limited, exploitation of this vulnerability.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was reported to Cisco by Tavis Ormandy of Google.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco WebEx Browser Extension Remote Code Execution Vulnerability",
				"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170124-webex"
			}
		],
		"title": "Cisco WebEx Browser Extension Remote Code Execution Vulnerability",
		"tracking": {
			"current_release_date": "2019-03-28T18:53:00+00:00",
			"generator": {
				"date": "2022-07-15T01:52:23+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20170124-webex",
			"initial_release_date": "2017-01-24T18:30:00+00:00",
			"revision_history": [
				{
					"date": "2017-01-24T18:56:40+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2017-01-25T21:28:15+00:00",
					"number": "1.1.0",
					"summary": "Updated details to better explain the vulnerability.  Updated fixed software information to indicate that No Fixes are currently available.  Previous release of the WebEx Plugin for Chrome version 1.0.5 was incomplete."
				},
				{
					"date": "2017-01-26T18:26:33+00:00",
					"number": "1.2.0",
					"summary": "Updated summary to include Cisco WebEx Extension update. Updated Fixed Software to reflect Cisco WebEx Extension update for Chrome being available and added Cisco WebEx Meetings bug. Updated Vulnerable Products to no longer reflect Chrome. Updated Products Confirmed Not Vulnerable to reflect Chrome."
				},
				{
					"date": "2017-01-27T19:52:01+00:00",
					"number": "1.3.0",
					"summary": "Updated summary to include information about Firefox.\r\nUpdated Vulnerable Products to include additional details about browser extension identification."
				},
				{
					"date": "2017-01-28T16:47:09+00:00",
					"number": "1.4.0",
					"summary": "Updated Summary to reflect updates to all browser extensions. Updated Vulnerable Products to reflect updates to Firefox and Internet Explorer browser extension releases. Updated Fixed Software to include Firefox and Internet Explorer steps to confirm fixed software installation and table of fixed application versions for WebEx sites."
				},
				{
					"date": "2017-01-29T23:27:40+00:00",
					"number": "1.5.0",
					"summary": "Updated Fixed Software table of fixed application versions for WebEx sites and customer premises installations."
				},
				{
					"date": "2017-01-30T16:02:17+00:00",
					"number": "1.6.0",
					"summary": "Updated Affected Products and Fixed Software with correct version information for Internet Explorer."
				},
				{
					"date": "2017-01-31T01:44:52+00:00",
					"number": "1.7.0",
					"summary": "Added additional plugin identification information for affected browsers in Affected Products section. Additional clarifying information added to Fixed Software section. Added information about upgrading all clients to be compatible with the deployed site application version. Added product status information for Cisco WebEx Meetings Server 2.0 customers."
				},
				{
					"date": "2017-01-31T17:54:23+00:00",
					"number": "1.8.0",
					"summary": "Added additional plugin identification information for Microsoft Internet Explorer. Added Cisco WebEx Productivity Tools to the list of products confirmed not affected."
				},
				{
					"date": "2017-02-04T23:13:31+00:00",
					"number": "1.9.0",
					"summary": "Updated Internet Explorer information in the Vulnerable Products and Fixed Software sections."
				},
				{
					"date": "2019-03-28T18:53:41+00:00",
					"number": "1.10.0",
					"summary": "Included information about ongoing, limited exploitation."
				}
			],
			"status": "final",
			"version": "1.10.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco WebEx Meeting Center",
						"product": {
							"name": "Cisco WebEx Meeting Center ",
							"product_id": "CSAFPID-97151"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Meetings Server",
						"product": {
							"name": "Cisco WebEx Meetings Server ",
							"product_id": "CSAFPID-190702"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2017-3823",
			"notes": [
				{
					"category": "other",
					"text": "CSCvc86959,CSCvc88535,CSCvc95037,CSCvc95034,CSCvc95044,CSCvc88194",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-97151",
					"CSAFPID-190702"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco WebEx Browser Extension Remote Code Execution Vulnerability",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170124-webex"
				}
			],
			"release_date": "2017-01-24T18:30:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability. However, administrators and users of Windows 10 systems may utilize Microsoft Edge to join and participate in WebEx sessions as Microsoft Edge is not affected by this vulnerability. Additionally, administrators and users can remove all WebEx software from a Windows system by using the Meeting Services Removal Tool, which is available from https://help.webex.com/docs/DOC-2672 [\"https://help.webex.com/docs/DOC-2672\"].\r\n\r\nCustomers who currently have web proxies or web gateways in their environment can create a URL filtering policy to block web requests matching the following condition:\r\n\r\nURL requests containing the string pattern \"cwcsf-nativemsg-iframe-43c85c0d-d633-af5e-c056-32dc7efc570b.html\"\r\nand\r\nURL hostname not matching the known customer's WebEx site URL (e.g. company.webex.com in https://company.webex.com/cwcsf-nativemsg-iframe-43c85c0d-d633-af5e-c056-32dc7efc570b.html)"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 8.8,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-97151",
						"CSAFPID-190702"
					]
				},
				{
					"cvss_v3": {
						"baseScore": 8.8,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-97151",
						"CSAFPID-190702"
					]
				}
			],
			"title": "Cisco WebEx Browser Extension Remote Code Execution Vulnerability"
		}
	]
}
