{
	"document": {
		"acknowledgments": [
			{
				"summary": "Cisco would like to thank Hanno Böck, Juraj Somorovsky of Ruhr-Universität Bochum/Hackmanit GmbH, Craig Young of Tripwire VERT, and Dirk Wetter of testssl.sh/Dr. Wetter IT-Consulting for reporting these vulnerabilities."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "On December 12, 2017, a research paper with the title Return of Bleichenbacher's Oracle Threat was  made publicly available. This paper describes how some Transport Layer Security (TLS) stacks are vulnerable to variations of the classic Bleichenbacher attack on RSA key exchange. Multiple vulnerabilities were identified based on this research.\r\n\r\nAn attacker could iteratively query a server running a vulnerable TLS stack implementation to perform cryptanalytic operations that may allow decryption of previously captured TLS sessions.\r\n\r\nTo exploit these vulnerabilities, an attacker must be able to perform both of the following actions:\r\n\r\nCapture traffic between clients and the affected TLS server.\r\nActively establish a considerable number of TLS connections to the vulnerable server. The actual number of connections required varies with the implementation-specific vulnerabilities, and could range from hundreds of thousands to millions of connections.\r\nMultiple Cisco products are affected by these vulnerabilities.\r\n\r\nCisco has released software updates that address some of these vulnerabilities.\r\n\r\nThere may be workarounds available for selected products.\r\n\r\nThis advisory is available at the following link:\r\nhttps://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20171212-bleichenbacher [\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20171212-bleichenbacher\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco investigated its product line to determine which products may be affected by these vulnerabilities and the impact on each affected product. Refer to the \"Vulnerable Products\" and \"Products Confirmed Not Vulnerable\" sections of this advisory for information about whether a product is affected.\r\n\r\nThe \"Vulnerable Products\" section includes Cisco bug IDs for each affected product. The bugs are accessible through the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"] and contain additional platform-specific information, including workarounds (if available) and fixed software releases.",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "The following table lists Cisco products that are affected by one or more of the vulnerabilities that are described in this advisory:\r\n\r\n                              Product              Cisco Bug ID              Fixed Release Availability                                  Cisco Cloud Hosted Services                                  Cisco WebEx Business Suite (including Meeting Center, Training Center, Event Center, Support Center)              CSCvh10981 [\"https://tools.cisco.com/bugsearch/bug/CSCvh10981\"]              Remediation has been completed. (15-Jan-2018)\r\n                                  Cisco WebEx Meetings              CSCvh10981 [\"https://tools.cisco.com/bugsearch/bug/CSCvh10981\"]              Remediation has been completed. (15-Jan-2018)\r\n                                  Cisco WebEx Messenger              CSCvh25064 [\"https://tools.cisco.com/bugsearch/bug/CSCvh25064\"]              Remediation has been completed. (15-Jan-2018)\r\n                                  Network Application, Service, and Acceleration                                  Cisco ACE 4710 Application Control Engine Appliance\r\n              CSCvg74693 [\"https://tools.cisco.com/bugsearch/bug/CSCvg74693\"]              No fix will be provided for this product. 1                                  Cisco ACE30 Application Control Engine Module              CSCvg74693 [\"https://tools.cisco.com/bugsearch/bug/CSCvg74693\"]              No fix will be provided for this product. 2\r\n                                  Network and Content Security Devices                                  Cisco Adaptive Security Appliance (ASA) - ASA 5505, 5510, 5520, 5540, and 5550              CSCvg97652 [\"https://tools.cisco.com/bugsearch/bug/CSCvg97652\"]              9.1.7.21 (5-Jan-2018)\r\n9.2.4.25 (8-Jan-2018)\r\n                                  Cisco SSL Appliance              CSCvh00296 [\"https://tools.cisco.com/bugsearch/bug/CSCvh00296\"]              3.12.2.1 (18-May-2018)\r\n\r\n1 Cisco ACE 4710 Application Control Engine Appliance entered the end-of-life cycle on July 26, 2013. For reference, see the End-of-Sale and End-of-Life Announcement [\"https://www.cisco.com/c/en/us/products/collateral/application-networking-services/ace-4700-series-application-control-engine-appliances/eol_C51-728944.html\"].\r\n2 Cisco ACE30 Application Control Engine Module entered the end-of-life cycle on July 26, 2013. For reference, see the End-of-Sale and End-of-Life Announcement [\"https://www.cisco.com/c/en/us/products/collateral/interfaces-modules/services-modules/eol_C51-728979.html\"].",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by these vulnerabilities.\r\n\r\nCisco has confirmed that these vulnerabilities do not affect the following products:\r\n\r\nCisco Cloud Hosted Services\r\nCisco Cloud Web Security (CWS)\r\nCisco Spark\r\nCisco Umbrella\r\nNetwork Application, Service, and Acceleration\r\n\r\nCisco Wide Area Application Services (WAAS)\r\nNetwork and Content Security Devices\r\nCisco Adaptive Security Appliance (ASA) - All models not listed in the Vulnerable Products section\r\nCisco ASA Next-Generation Firewall Services\r\nCisco Content Security Management Appliance (SMA)\r\nCisco Email Security Appliance (ESA)\r\nCisco Firepower 2100 Series\r\nCisco Firepower 4100 Series\r\nCisco Firepower 7000 Series\r\nCisco Firepower 8000 Series\r\nCisco Firepower 9300 Security Appliance\r\nCisco Identity Services Engine (ISE)\r\nCisco Web Security Appliance (WSA)\r\nRouting and Switching - Enterprise and Service Provider\r\nCisco VPN Internal Service Module for ISR (VPN ISM)",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Bleichenbacher's attack is an adaptive chosen-ciphertext attack against RSA PKCS#1 v1.5 encryption block formatting. Daniel Bleichenbacher originally performed this attack against the RSA key exchange on Secure Sockets Layer (SSL) Version 3.0.\r\n\r\nThe attack relies on the presence of a side channel indicating, for any chosen ciphertext, whether the corresponding plaintext has the correct format according to the RSA PKCS#1 v1.5 standard. An attacker could exploit this side channel as an oracle, iteratively constructing crafted TLS messages. Eventually the attacker might be able to recover the plaintext for a given TLS session.\r\n\r\nThe new research focused on identifying current TLS implementations affected by the classic Bleichenbacher attack or those affected by newly introduced variations. These new variations use the overall TCP connection state as a possible side channel and use a nonstandard, abbreviated TLS message flow.\r\n\r\nThe following vulnerabilities were identified based on this research:\r\n\r\nCavium SSL SDK Bleichenbacher Attack Information Disclosure Vulnerability\r\n\r\nA vulnerability in the TLS protocol implementation of Cavium SSL Software Development Kits (SDKs) could allow an unauthenticated, remote attacker to access sensitive information.\r\n\r\nThe vulnerability is due to improper implementation of countermeasures against the Bleichenbacher attack for cipher suites that rely on RSA for key exchange. An attacker could exploit this vulnerability by sending crafted TLS messages to the device, which would act as an oracle and allow the attacker to carry out a chosen-ciphertext attack.\r\n\r\nThis vulnerability has been assigned the following CVE ID: CVE-2017-17428.\r\n\r\n  Legacy Cisco ASA 5500 Series Bleichenbacher Attack Information Disclosure Vulnerability\r\n\r\nA vulnerability in the TLS protocol implementation of legacy Cisco ASA 5500 Series (ASA 5505, 5510, 5520, 5540, and 5550) devices could allow an unauthenticated, remote attacker to access sensitive information.\r\n\r\nThe vulnerability is due to improper implementation of countermeasures against the Bleichenbacher attack for cipher suites that rely on RSA for key exchange. An attacker could exploit this vulnerability by sending crafted TLS messages to the device, which would act as an oracle and allow the attacker to carry out a chosen-ciphertext attack.\r\n\r\nThis vulnerability affects the listed ASA models when they are using a 2048-bit RSA key.\r\n\r\nThis vulnerability has been assigned the following CVE ID: CVE-2017-12373.\r\n\r\nSSL Visibility Bleichenbacher Attack Information Disclosure Vulnerability\r\n\r\nA vulnerability in the TLS protocol implementation of Cisco SSL Appliance (Bluecoat SSL Visibility OEM appliance) could allow an  unauthenticated, remote attacker to access sensitive information.\r\n\r\nThe vulnerability is due to improper implementation of countermeasures  against the Bleichenbacher attack for cipher suites that rely on RSA for  key exchange. An attacker could exploit this vulnerability by sending  crafted TLS messages to the device, which would act as an oracle and  allow the attacker to carry out a chosen-ciphertext attack.\r\n\r\nThis vulnerability has been assigned the following CVE ID: CVE-2017-15533.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "Disabling use of TLS ciphers that rely on RSA for key exchange is a possible mitigation for these vulnerabilities. It is applicable only to products that support other types of ciphers, such as those based on Diffie-Hellman key exchange. This mitigation may have an impact on interoperability with legacy clients that do not support these ciphers. This mitigation is not applicable to Cisco Application Control Engine (ACE).\r\n\r\nFor potential workarounds on a specific Cisco product, refer to the relevant Cisco bug, which is available from the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"].",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "For information about fixed software releases, consult the Cisco bug ID(s) at the top of this advisory. Questions concerning the WebEx environment can be directed to the Cisco Technical Assistance Center (TAC).\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco TAC or their contracted maintenance providers.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any malicious use of the vulnerabilities that are described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "Cisco would like to thank Hanno Böck, Juraj Somorovsky of Ruhr-Universität Bochum/Hackmanit GmbH, Craig Young of Tripwire VERT, and Dirk Wetter of testssl.sh/Dr. Wetter IT-Consulting for reporting these vulnerabilities.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Bleichenbacher Attack on TLS Affecting Cisco Products: December 2017",
				"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20171212-bleichenbacher"
			}
		],
		"title": "Bleichenbacher Attack on TLS Affecting Cisco Products: December 2017",
		"tracking": {
			"current_release_date": "2018-05-18T17:31:00+00:00",
			"generator": {
				"date": "2022-07-15T02:17:56+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20171212-bleichenbacher",
			"initial_release_date": "2017-12-12T15:45:00+00:00",
			"revision_history": [
				{
					"date": "2017-12-12T15:45:10+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2017-12-13T20:35:51+00:00",
					"number": "1.1.0",
					"summary": "Updated information for vulnerable and nonvulnerable products and products under investigation. Added CVE-2017-12373."
				},
				{
					"date": "2017-12-15T15:58:51+00:00",
					"number": "1.2.0",
					"summary": "Updated information for nonvulnerable products."
				},
				{
					"date": "2017-12-21T23:17:43+00:00",
					"number": "1.3.0",
					"summary": "Updated information for vulnerable and nonvulnerable products and products under investigation. Modified CVE-2017-12373 description."
				},
				{
					"date": "2018-01-08T18:05:24+00:00",
					"number": "1.4.0",
					"summary": "Updated information about fixed release availability for Cisco ASA devices."
				},
				{
					"date": "2018-01-16T17:38:11+00:00",
					"number": "1.5.0",
					"summary": "Updated information about fixed release availability for Cisco WebEx products. Updated information for nonvulnerable products."
				},
				{
					"date": "2018-05-18T17:31:50+00:00",
					"number": "1.6.0",
					"summary": "Updated information for vulnerable products. Added CVE-2017-15533. Modified CVE-2017-17428 description. Changed Document Status to Final."
				}
			],
			"status": "final",
			"version": "1.6.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "SSL Visibility",
						"product": {
							"name": "Blue Coat Systems, Inc. SSL Visibility ",
							"product_id": "CSAFPID-198785"
						}
					}
				],
				"category": "vendor",
				"name": "Blue Coat Systems, Inc."
			},
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Adaptive Security Appliance (ASA) Software",
						"product": {
							"name": "Cisco Adaptive Security Appliance (ASA) Software ",
							"product_id": "CSAFPID-6588"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco ACE Application Control Engine Module",
						"product": {
							"name": "Cisco ACE Application Control Engine Module ",
							"product_id": "CSAFPID-7365"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco ACE 4700 Series Application Control Engine Appliances",
						"product": {
							"name": "Cisco ACE 4700 Series Application Control Engine Appliances ",
							"product_id": "CSAFPID-80725"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Connect",
						"product": {
							"name": "Cisco WebEx Connect ",
							"product_id": "CSAFPID-97145"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Event Center",
						"product": {
							"name": "Cisco WebEx Event Center ",
							"product_id": "CSAFPID-97148"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Meeting Center",
						"product": {
							"name": "Cisco WebEx Meeting Center ",
							"product_id": "CSAFPID-97151"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Support Center",
						"product": {
							"name": "Cisco WebEx Support Center ",
							"product_id": "CSAFPID-97163"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Training Center",
						"product": {
							"name": "Cisco WebEx Training Center ",
							"product_id": "CSAFPID-97166"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco Webex Meetings",
						"product": {
							"name": "Cisco Webex Meetings ",
							"product_id": "CSAFPID-228295"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2017-12373",
			"notes": [
				{
					"category": "other",
					"text": "CSCvg97652",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-6588"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Bleichenbacher Attack on TLS Affecting Cisco Products: December 2017",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20171212-bleichenbacher"
				}
			],
			"release_date": "2017-12-13T10:29:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "Disabling use of TLS ciphers that rely on RSA for key exchange is a possible mitigation for these vulnerabilities. It is applicable only to products that support other types of ciphers, such as those based on Diffie-Hellman key exchange. This mitigation may have an impact on interoperability with legacy clients that do not support these ciphers. This mitigation is not applicable to Cisco Application Control Engine (ACE).\r\n\r\nFor potential workarounds on a specific Cisco product, refer to the relevant Cisco bug, which is available from the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"]."
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 5.3,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-6588"
					]
				},
				{
					"cvss_v3": {
						"baseScore": 5.3,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-6588"
					]
				}
			],
			"title": "Legacy Cisco ASA 5500 Series Bleichenbacher Attack Information Disclosure Vulnerability"
		},
		{
			"cve": "CVE-2017-17428",
			"notes": [
				{
					"category": "other",
					"text": "CSCvg74693,CSCvh10981,CSCvh25064",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-7365",
					"CSAFPID-80725",
					"CSAFPID-228295",
					"CSAFPID-97151",
					"CSAFPID-97148",
					"CSAFPID-97166",
					"CSAFPID-97163",
					"CSAFPID-97145"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Bleichenbacher Attack on TLS Affecting Cisco Products: December 2017",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20171212-bleichenbacher"
				}
			],
			"release_date": "2017-12-12T15:45:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "Disabling use of TLS ciphers that rely on RSA for key exchange is a possible mitigation for these vulnerabilities. It is applicable only to products that support other types of ciphers, such as those based on Diffie-Hellman key exchange. This mitigation may have an impact on interoperability with legacy clients that do not support these ciphers. This mitigation is not applicable to Cisco Application Control Engine (ACE).\r\n\r\nFor potential workarounds on a specific Cisco product, refer to the relevant Cisco bug, which is available from the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"]."
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 5.3,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-7365",
						"CSAFPID-80725",
						"CSAFPID-228295",
						"CSAFPID-97151",
						"CSAFPID-97148",
						"CSAFPID-97166",
						"CSAFPID-97163",
						"CSAFPID-97145"
					]
				},
				{
					"cvss_v3": {
						"baseScore": 5.3,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-7365",
						"CSAFPID-80725",
						"CSAFPID-228295",
						"CSAFPID-97151",
						"CSAFPID-97148",
						"CSAFPID-97166",
						"CSAFPID-97163",
						"CSAFPID-97145"
					]
				}
			],
			"title": "Cavium SSL SDK Bleichenbacher Attack Information Disclosure Vulnerability"
		},
		{
			"cve": "CVE-2017-15533",
			"notes": [
				{
					"category": "other",
					"text": "Not available.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Bleichenbacher Attack on TLS Affecting Cisco Products: December 2017",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20171212-bleichenbacher"
				}
			],
			"release_date": "2018-05-16T10:30:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "Disabling use of TLS ciphers that rely on RSA for key exchange is a possible mitigation for these vulnerabilities. It is applicable only to products that support other types of ciphers, such as those based on Diffie-Hellman key exchange. This mitigation may have an impact on interoperability with legacy clients that do not support these ciphers. This mitigation is not applicable to Cisco Application Control Engine (ACE).\r\n\r\nFor potential workarounds on a specific Cisco product, refer to the relevant Cisco bug, which is available from the Cisco Bug Search Tool [\"https://bst.cloudapps.cisco.com/bugsearch/bug/BUGID\"]."
				}
			],
			"title": "SSL Visibility Bleichenbacher Attack Information Disclosure Vulnerability"
		}
	]
}
