{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was externally reported to Cisco by Knud Hojgaard with F-Secure."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the Session Initiation Protocol (SIP) of the Cisco TelePresence Codec (TC) and Collaboration Endpoint (CE) Software could allow an unauthenticated, remote attacker to cause a TelePresence endpoint to reload unexpectedly, resulting in a denial of service (DoS) condition.\r\n\r\nThe vulnerability is due to a lack of flow-control mechanisms within the software. An attacker could exploit this vulnerability by sending a flood of SIP INVITE packets to the affected device. An exploit could allow the attacker to impact the availability of services and data of the device, including a complete DoS condition.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nThis advisory is available at the following link:\r\nhttps://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170607-tele [\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170607-tele\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects the following Cisco TC and CE platforms when running software versions prior to TC 7.3.8 and  CE 8.3.0.\r\n\r\nTelePresence MX Series:\r\nTelePresence MX800\r\nTelePresence MX700\r\nTelePresence MX300\r\nTelePresence MX300 G2\r\nTelePresence MX200\r\nTelePresence MX200 G2\r\n\r\nTelePresence Profile Series:\r\nTelePresence System Profile 65-inch\r\nTelePresence System Profile 52-inch\r\n\r\nTelepresence SX Series:\r\nTelePresence SX80 Codec\r\nTelePresence SX20 Quick Set\r\nTelePresence SX10 Quick Set\r\n\r\nTelePresence System Profile MXP Series:\r\nTelePresence System Profile 52-inch MXP\r\nTelePresence System Profile MXP Model\r\n\r\nCollaboration Desk Endpoints: DX Series\r\nDX70\r\nDX80\r\n\r\nTelePresence System EX Series:\r\nTelePresence EX60\r\nTelePresence EX90\r\n\r\nTelePresence Integrator C Series:\r\nTelePresence Codec C90\r\nTelePresence Codec C60\r\nTelePresence System Integrator Package C60\r\nTelePresence System Integrator Package C40\r\nTelePresence System Quick Set C20\r\n  To determine which Cisco TelePresence Software release is running on a Cisco product, administrators can check the system information on the local touch control device or on-screen via the infrared (IR) remote controller. On both the touch control device and the IR remote controller, the user can press the menu button located in the top-left corner to access the system information.\r\n\r\nAdministrators can also determine which software release is running by logging into the web interface and using the http(s):// <system-ip> access URL or via the external API (xAPI) with the SSH protocol, using the ssh admin@ <system-ip> command. After logging into the web interface, the welcome text displays information about the software release that is running on the device. Users logged into the web interface may navigate to Setup -> Configuration -> NetworkServices -> SIP Mode (On/Off) or, in xAPI, by typing: xconfig //sip mode (SIP mode is on by default).",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect the following Cisco TelePresence Endpoint platforms in any software release:\r\nCisco Spark Room Series\r\nSpark Room Kit\r\nTelePresence Software release CE 9.0.1 is not affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttp://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html [\"http://www.cisco.com/c/en/us/td/docs/general/warranty/English/EU1KEN_.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to upgrade contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttp://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html [\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n\r\nFixed Releases\r\n\r\nThe following TelePresence Software releases address this vulnerability:\r\n\r\nTelePresence TC 7.3.8\r\nTelePresence CE 8.3.0\r\n\r\nThis vulnerability is fixed in Cisco TC 7.3.8 and CE 8.3.0 Software releases and later. The Cisco TelePresence software can be downloaded from the Download Software site by navigating to Products > Collaboration Endpoints> Collaboration Room Endpoints.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was externally reported to Cisco by Knud Hojgaard with F-Secure.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco TelePresence Endpoint Denial of Service Vulnerability",
				"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170607-tele"
			}
		],
		"title": "Cisco TelePresence Endpoint Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2017-06-07T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T02:11:14+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20170607-tele",
			"initial_release_date": "2017-06-07T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2017-06-07T15:32:01+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco TelePresence TC Software",
						"product": {
							"name": "Cisco TelePresence TC Software ",
							"product_id": "CSAFPID-192563"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco TelePresence CE Software",
						"product": {
							"name": "Cisco TelePresence CE Software ",
							"product_id": "CSAFPID-222445"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2017-6648",
			"notes": [
				{
					"category": "other",
					"text": "CSCux94002",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-192563",
					"CSAFPID-222445"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco TelePresence Endpoint Denial of Service Vulnerability",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170607-tele"
				}
			],
			"release_date": "2017-06-07T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 7.5,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-192563",
						"CSAFPID-222445"
					]
				},
				{
					"cvss_v3": {
						"baseScore": 7.5,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-192563",
						"CSAFPID-222445"
					]
				}
			],
			"title": "Cisco TelePresence End-Point Denial of Service Vulnerability"
		}
	]
}
