{
	"document": {
		"acknowledgments": [
			{
				"summary": "Cisco would like to thank Marcos Accossatto of SecureAuth for reporting this vulnerability."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the update service of Cisco Webex Meetings Desktop App and Cisco Webex Productivity Tools for Windows could allow an authenticated, local attacker to execute arbitrary commands as a privileged user.\r\n  The vulnerability is due to insufficient validation of user-supplied parameters. An attacker could exploit this vulnerability by invoking the update service command with a crafted argument. An exploit could allow the attacker to run arbitrary commands with SYSTEM user privileges.\r\n\r\n  While the CVSS Attack Vector metric denotes the requirement for an attacker to have local access, administrators should be aware that in Active Directory deployments, the vulnerability could be exploited remotely by leveraging the operating system remote management tools.\r\n\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nThis advisory is available at the following link:\r\nhttps://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20190227-wmda-cmdinj [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20190227-wmda-cmdinj\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects all Cisco Webex Meetings Desktop App releases prior to 33.6.6, and Cisco Webex Productivity Tools Releases 32.6.0 and later prior to 33.0.7, when running on a Microsoft Windows end-user system.\r\n\r\nTo determine whether a vulnerable version of Cisco Webex Meetings Desktop App is installed on a Windows machine, users can launch the Cisco Webex Meetings application and click the gear icon in the top right of the application window, then choose the About... menu entry; a popup window displaying the currently installed version will open. This is also documented in the article Check the Cisco Webex Meetings Desktop App Version [\"https://collaborationhelp.cisco.com/article/en-us/0usc4ab\"].\r\n\r\nTo determine whether a vulnerable version of Cisco Webex Productivity Tools is installed on a Windows machine, users can right-click the Webex Productivity Tools icon on the Windows taskbar and select About from the menu; a popup window displaying the currently installed version will open. This is also documented in the article Check the Cisco Webex Productivity Tools Version for Windows [\"https://collaborationhelp.cisco.com/article/en-us/nf387ab\"].",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20190227-wmda-cmdinj#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that these vulnerabilities do not affect the Apple Mac OS X or Linux versions of these products.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n  Customers Without Service Contracts\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC:\r\nhttps://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n  Fixed Releases\r\nCisco Webex Meetings Desktop App (Cisco Webex Meetings Suite WBS33)\r\n\r\nThis vulnerability is fixed in Cisco Webex Meetings Desktop App Release 33.6.6 and 33.9.1 releases.\r\n\r\nAdministrators can update the Cisco Webex Meetings Desktop App for their user base by following the instructions available in the document IT Administrator Guide for Mass Deployment of the Cisco Webex Meetings Desktop App [\"https://collaborationhelp.cisco.com/article/en-us/nulpixd\"].\r\n\r\n  Users can update the Cisco Webex Meetings Desktop App by launching the Cisco Webex Meetings application and clicking the gear icon in the top right of the application window and then choosing the Check for Updates entry from the drop-down list. This is also documented in the article Update the Cisco Webex Meetings Desktop App [\"https://collaborationhelp.cisco.com/article/en-us/n1kwkd6\"].\r\n\r\nCisco Webex Productivity Tools (Cisco Webex Meetings Suite WBS32)\r\n\r\nThis vulnerability is fixed in Cisco Webex Productivity Tools Release 33.0.7.\r\n\r\nCisco Webex Productivity Tools is an optional companion application that allows users to quickly schedule and join meetings from their desktop without the need to access the Meetings website. The application should not be confused with the Cisco Webex Meetings Client, which is the main client application that provides the core functionality to host or attend a Webex meeting.\r\n\r\nAdministrators can update the Cisco Webex Productivity Tools for their user base by following the instructions available in the document IT Administrator Guide for Mass Deployment of the Cisco Webex Meetings Desktop App [\"https://collaborationhelp.cisco.com/article/en-us/nulpixd\"].\r\n\r\n  Users can update the Cisco Webex Productivity Tools by launching the Cisco Webex Meetings application and clicking Settings in the top right of the application window and then choosing Check for Updates from the drop-down list. This is documented in more detail in the article Check for Cisco Webex Productivity Tools Updates for Windows [\"https://collaborationhelp.cisco.com/article/en-us/nk758tr\"].",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "Cisco would like to thank Marcos Accossatto of SecureAuth for reporting this vulnerability.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Webex Meetings Desktop App and Cisco Webex Productivity Tools Update Service Command Injection Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20190227-wmda-cmdinj"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20190227-wmda-cmdinj",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20190227-wmda-cmdinj"
			},
			{
				"category": "external",
				"summary": "Check the Cisco Webex Meetings Desktop App Version",
				"url": "https://collaborationhelp.cisco.com/article/en-us/0usc4ab"
			},
			{
				"category": "external",
				"summary": "Check the Cisco Webex Productivity Tools Version for Windows",
				"url": "https://collaborationhelp.cisco.com/article/en-us/nf387ab"
			},
			{
				"category": "external",
				"summary": "Vulnerable Products",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20190227-wmda-cmdinj#vp"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			},
			{
				"category": "external",
				"summary": "IT Administrator Guide for Mass Deployment of the Cisco Webex Meetings Desktop App",
				"url": "https://collaborationhelp.cisco.com/article/en-us/nulpixd"
			},
			{
				"category": "external",
				"summary": "Update the Cisco Webex Meetings Desktop App",
				"url": "https://collaborationhelp.cisco.com/article/en-us/n1kwkd6"
			},
			{
				"category": "external",
				"summary": "IT Administrator Guide for Mass Deployment of the Cisco Webex Meetings Desktop App",
				"url": "https://collaborationhelp.cisco.com/article/en-us/nulpixd"
			},
			{
				"category": "external",
				"summary": "Check for Cisco Webex Productivity Tools Updates for Windows",
				"url": "https://collaborationhelp.cisco.com/article/en-us/nk758tr"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco Webex Meetings Desktop App and Cisco Webex Productivity Tools Update Service Command Injection Vulnerability",
		"tracking": {
			"current_release_date": "2019-02-27T16:00:00+00:00",
			"generator": {
				"date": "2022-09-03T03:39:12+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20190227-wmda-cmdinj",
			"initial_release_date": "2019-02-27T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2019-02-27T15:36:50+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco WebEx Event Center",
						"product": {
							"name": "Cisco WebEx Event Center ",
							"product_id": "CSAFPID-97148"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Meeting Center",
						"product": {
							"name": "Cisco WebEx Meeting Center ",
							"product_id": "CSAFPID-97151"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Support Center",
						"product": {
							"name": "Cisco WebEx Support Center ",
							"product_id": "CSAFPID-97163"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Training Center",
						"product": {
							"name": "Cisco WebEx Training Center ",
							"product_id": "CSAFPID-97166"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2019-1674",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvn55874"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-97148",
					"CSAFPID-97151",
					"CSAFPID-97163",
					"CSAFPID-97166"
				]
			},
			"release_date": "2019-02-27T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97163",
						"CSAFPID-97166"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 7.8,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
						"version": "3.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				}
			],
			"title": "Cisco Webex Meetings Desktop App and Cisco Webex Productivity Tools Update Service Command Injection Vulnerability"
		}
	]
}
