{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the role-based access control (RBAC) implementation of the Cisco Secure Access Control Server (ACS) could allow an authenticated, remote attacker to view system administrator reports and status.\n\r\n \n\r\nThe vulnerability is due to improper RBAC validation when a user accesses the report generation web interface. An attacker could exploit this vulnerability by authenticating as a non-privileged user and navigating to what should be a restricted web page. A successful exploit could allow the attacker to view confidential report and status information about the affected device, including IP addresses and usernames.\n\r\n\n\r\nCisco has released software updates that address this vulnerability. Workarounds that mitigate this vulnerability are not available.\n\r\n\n\r\nThis advisory is available at the following link: http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20151023-acs_rbac1[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20151023-acs_rbac1\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco Secure Access Control Server (ACS) Solution Engine version 5.7(0.15).",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Workarounds are not available.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \r\n\r\nIn all cases, customers should ensure that the devices to upgrade contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers. \r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Secure Access Control Server Role-Based Access Control Weak Protection Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20151023-acs_rbac1"
			}
		],
		"title": "Cisco Secure Access Control Server Role-Based Access Control Weak Protection Vulnerability",
		"tracking": {
			"current_release_date": "2015-10-26T00:00:00+00:00",
			"generator": {
				"date": "2022-07-15T01:18:03+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20151023-acs_rbac1",
			"initial_release_date": "2015-10-26T00:00:00+00:00",
			"revision_history": [
				{
					"date": "2015-10-26T14:22:54+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Secure Access Control Server Solution Engine (ACSE)",
						"product": {
							"name": "Cisco Secure Access Control Server Solution Engine (ACSE) ",
							"product_id": "CSAFPID-5622"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2015-6348",
			"notes": [
				{
					"category": "other",
					"text": "CSCuw24661",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-5622"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Secure Access Control Server Role-Based Access Control Weak Protection Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20151023-acs_rbac1"
				}
			],
			"release_date": "2015-10-23T17:28:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "Workarounds are not available."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 4,
						"vectorString": "AV:N/AC:L/Au:S/C:P/I:N/A:N/E:F/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-5622"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 4,
						"vectorString": "AV:N/AC:L/Au:S/C:P/I:N/A:N/E:F/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-5622"
					]
				}
			],
			"title": "Cisco ACS Role-Based Access Control Weak Protection Vulnerability"
		}
	]
}
