{
	"document": {
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Cisco Prime Data Center Network Manager (DCNM) contains a file information disclosure vulnerability that could allow an unauthenticated, remote attacker to retrieve arbitrary files from the underlying operating system.\r\n\r\nCisco has released software updates that address this vulnerability.\r\n\r\nWorkarounds that mitigate this vulnerability are not available.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco Prime DCNM releases 6.3(1) and later, prior to release 7.1(1), for both the Microsoft Windows and Linux platforms, are affected by this vulnerability.\r\n\r\nTo determine the Cisco Prime DCNM release that is running, administrators can connect to the computer that runs the Cisco Prime DCNM software using a web browser and HTTPS; the release number will be displayed in the login page, before logging in. The following example shows a device running version 7.0(2):\r\n\r\n\r\nCisco Prime\r\nData Center Network Manager  Version: 7.0(2)",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco DCNM-LAN Server and Cisco DCNM-SAN Server were different products prior to the release of 6.1(1), when both products converged into a single Cisco Prime DCNM product. The original standalone versions of Cisco DCNM-LAN Server and Cisco DCNM-SAN Server and the converged versions prior to 6.3(1) are not affected by this vulnerability.\r\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco Prime DCNM, previously known as Cisco Data Center Network Manager, is a network management application that combines the management of Ethernet and storage networks into a single dashboard to help network and storage administrators manage and troubleshoot health and performance across different families of Cisco products that run Cisco NX-OS Software.\r\n\r\nCisco Prime DCNM is affected by the following vulnerability:\r\n\r\nCisco Prime Data Center Network Manager Directory Traversal Vulnerability\r\n\r\nA vulnerability in the fmserver servlet of Cisco Prime Data Center Network Manager could allow an unauthenticated, remote attacker to retrieve arbitrary files from the filesystem.\r\n\r\nThe vulnerability is due to invalid input validation on the supplied path information. An attacker could exploit this vulnerability by executing a directory traversal attack on an affected system. A successful exploit could allow the attacker to disclose arbitrary file contents on the underlying operating system that hosts the Cisco Prime DCNM application. The file contents must be readable by the System user for Cisco Prime DCNM running on Microsoft Windows, or the root user for Cisco Prime DCNM running on Linux for the attacker to exploit them.\r\n\r\nThis vulnerability has been documented in Cisco bug ID CSCus00241 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCus00241\"] (registered [\"http://sec.cloudapps.cisco.com/RPF/register/register.do\"] customers only) and has been assigned Common Vulnerabilities and Exposures (CVE) identifier CVE-2015-0666.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that mitigate this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Notices archive at http://www.cisco.com/go/psirt [\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nThis vulnerability was first resolved in Cisco DCNM Software version 7.1(1).\r\n\r\nCisco Prime DCNM can be downloaded from the Software Center on Cisco.com by visiting http://www.cisco.com/cisco/software/navigator.html [\"http://www.cisco.com/cisco/software/navigator.html\"] and navigating to Products > Cloud and Systems Management > Data Center Infrastructure Management > Cisco Prime Data Center Network Manager or via direct link https://software.cisco.com/download/release.html?mdfid=281722751&softwareid=282088134 [\"https://software.cisco.com/download/release.html?mdfid=281722751&softwareid=282088134\"]",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "In March 2022, the Cisco Product Security Incident Response Team (PSIRT) became aware of additional attempted exploitation of this vulnerability in the wild. Cisco continues to strongly recommend that customers upgrade to a fixed software release to remediate this vulnerability.\r\n\r\nThis vulnerability was reported to Cisco by Andrea Micalizzi (rgod) working with HP's Zero Day Initiative.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Prime Data Center Network Manager File Information Disclosure Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150401-dcnm"
			},
			{
				"category": "external",
				"summary": "Cisco Data Center Network Manager Directory Traversal Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/viewAlert.x?alertId=37810"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "CSCus00241",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCus00241"
			},
			{
				"category": "external",
				"summary": "registered",
				"url": "http://sec.cloudapps.cisco.com/RPF/register/register.do"
			},
			{
				"category": "external",
				"summary": "http://www.cisco.com/go/psirt",
				"url": "http://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "http://www.cisco.com/cisco/software/navigator.html",
				"url": "http://www.cisco.com/cisco/software/navigator.html"
			},
			{
				"category": "external",
				"summary": "https://software.cisco.com/download/release.html?mdfid=281722751&amp;softwareid=282088134",
				"url": "https://software.cisco.com/download/release.html?mdfid=281722751&amp;softwareid=282088134"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco Prime Data Center Network Manager File Information Disclosure Vulnerability",
		"tracking": {
			"current_release_date": "2023-01-12T15:18:43+00:00",
			"generator": {
				"date": "2023-01-12T15:18:45+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20150401-dcnm",
			"initial_release_date": "2015-04-01T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2015-04-01T15:45:40+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				},
				{
					"date": "2023-01-12T15:18:43+00:00",
					"number": "1.1.0",
					"summary": "Updated exploitation information."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Prime Data Center Network Manager (DCNM)",
						"product": {
							"name": "Cisco Prime Data Center Network Manager (DCNM) ",
							"product_id": "CSAFPID-185359"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2015-0666",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCus00241"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-185359"
				]
			},
			"release_date": "2015-02-09T05:45:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-185359"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:C/I:N/A:N/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-185359"
					]
				}
			],
			"title": "Cisco Prime Data Center Network Manager File Information Disclosure Vulnerability"
		}
	]
}
