{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "On March 9, 2015, new research was published that takes advantage of a flaw in double data rate type 3 (DDR3) synchronous dynamic random-access memory (SDRAM) to perform privilege escalation attacks on systems that contain the affected hardware. The flaw is known as Row Hammer. To attempt an attack, the attacker must execute a malicious binary on an affected system.\n\r\n\n\r\nIn addition, the research focused on consumer hardware that did not have a number of mitigations and memory protections that have been integrated into chipsets and memory modules used in Cisco server-class products. Of note in the paper is that the researchers were unable, in their testing, to exploit devices that use Error-Correcting Code (ECC) memory.\n\r\n\n\r\nCisco offers a limited number of products that allow an unprivileged user to load and execute binaries.\n\r\n\n\r\nThe research report is at the following link:\n\r\nhttp://googleprojectzero.blogspot.com/2015/03/exploiting-dram-rowhammer-bug-to-gain.html[\"http://googleprojectzero.blogspot.com/2015/03/exploiting-dram-rowhammer-bug-to-gain.html\"]\n\r\n\n\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150309-rowhammer[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150309-rowhammer\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco offers a limited number of products that allow an unprivileged user to load and execute binaries. The products in the following list allow users to load and execute binaries and are currently under investigation. Each of the following products contains a number of hardware protections against Row Hammer events, including ECC memory modules. Based on the initial research report, there is no reason to believe any Cisco products would be affected. However, Cisco is testing against the following products to confirm.\n\r\n\n\r\nUpdate (March 30th, 2015): The evaluation of Cisco devices has shown that this issue is not exploitable on devices that are equipped with ECC DDRAM and have the ECC checking options enabled in their BIOS. This is the default state on all evaluated products.  All Cisco UCS computing devices have been found to be not affected by the Row Hammer Privilege Escalation attack as shipped from Cisco.  Validation has been performed on all Cisco UCS devices utilizing Cisco qualified Dual-Inline Memory Modules.  DIMM devices that have been installed in a UCS computing device that are not Cisco qualified parts may be affected.",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "No Cisco products are known to be affected by the Row Hammer Privilege Escalation Attack.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Exploitation of this vulnerability requires an attacker to execute arbitrary code on the affected device. The following devices have been confirmed to not allow the local execution of arbitrary code by design:\n\r\n\r\n    Devices running Cisco IOS Software\r\n    Devices running Cisco IOS XE Software\r\n    Devices running Cisco IOS XR Software\r\n    Devices running Cisco ASA Software\r\n    Cisco Web Security Appliances (WSA)\r\n    Cisco Email Security Appliances (ESA)\r\n    Cisco Nexus 2000 Series devices running Cisco NX-OS Software\r\n    Cisco Nexus 4000 Series devices running Cisco NX-OS Software\r\n    Cisco Nexus 5000 Series devices running Cisco NX-OS Software\r\n    Cisco Nexus 6000 Series devices running Cisco NX-OS Software\r\n    Cisco Nexus 7000 Series devices running Cisco NX-OS Software\r\n    Cisco MDS 9000 Series devices running Cisco NX-OS Software\r\n\r\n\n\r\nThe following products have been evaluated and are not affected:\r\n\r\n    Cisco Nexus 3000 Series devices running Cisco NX-OS Software\r\n    Cisco Nexus 9000 Series devices running Cisco NX-OS Software\r\n    Cisco Unified Computing System B-Series Blade Servers\r\n    Cisco Unified Computing System E-Series ISR Blade Servers\r\n    Cisco Unified Computing System C-Series Rack Servers\r\n\r\n\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Row Hammer DDR3 Privilege Escalation Vulnerability\r\nOn March 9, 2015, new research and findings related to a previously known issue discovered in the DDR3 memory specification were released. The new research takes advantage of a class of DDR3 memory limitations called Row Hammer. The Row Hammer issue was first recognized in the industry on a large scale in 2012 when high-performance computing was increasing demands on DDR3-based systems and triggering failures. The typical failure case at the time involved memory corruption and subsequent device crashes. Both memory manufacturers and chipset vendors began building mitigations for Row Hammer into their parts.\n\r\n\n\r\nThe research report is here:\n\r\nhttp://googleprojectzero.blogspot.com/2015/03/exploiting-dram-rowhammer-bug-to-gain.html[\"http://googleprojectzero.blogspot.com/2015/03/exploiting-dram-rowhammer-bug-to-gain.html\"]\n\r\n\n\r\nThe latest research shows that these types of errors can be introduced in a predictable manner. A proof of concept that runs on the Linux operating system has been released that uses the predictability of these errors to modify the memory of affected devices from an unprivileged context. This capability may be used by an authenticated, local attacker who can execute an attacker-supplied binary to elevate the attacker's privileges to that of a superuser or root account.\n\r\n\n\r\nBecause the attacker must execute a binary to trigger this issue, only Cisco products that allow unprivileged local user access as well as the ability to execute a binary may be affected.\n\r\n\n\r\nThe research specifies that researchers were unable to demonstrate an impact on ECC-equipped products.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "No direct workarounds or remediations are available to mitigate this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Notices archive at http://www.cisco.com/go/psirt and review subsequent advisories to determine exposure and a complete upgrade solution.\n\r\n\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.\r\n",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Row Hammer Privilege Escalation Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150309-rowhammer"
			},
			{
				"category": "external",
				"summary": "Row Hammer Memory Error Privilege Escalation Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAlert.x?alertId=37780"
			}
		],
		"title": "Row Hammer Privilege Escalation Vulnerability",
		"tracking": {
			"current_release_date": "2016-09-08T19:07:00+00:00",
			"generator": {
				"date": "2022-07-15T00:30:49+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20150309-rowhammer",
			"initial_release_date": "2015-03-09T21:50:00+00:00",
			"revision_history": [
				{
					"date": "2015-03-09T21:51:32+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2015-03-09T23:08:32+00:00",
					"number": "1.1.0",
					"summary": "Minor change to Exploitation and Public Announcements Section."
				},
				{
					"date": "2015-03-11T20:23:04+00:00",
					"number": "1.2.0",
					"summary": "Updated Product Status."
				},
				{
					"date": "2015-03-17T21:25:08+00:00",
					"number": "1.3.0",
					"summary": "Added product evaluation status update to the Affected Products section."
				},
				{
					"date": "2015-03-30T19:49:03+00:00",
					"number": "1.4.0",
					"summary": "Confirmed all Cisco UCS Devices as Not Vulnerable. Document State moved to Final."
				}
			],
			"status": "final",
			"version": "1.4.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Row Hammer Privilege Escalation Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150309-rowhammer"
				}
			],
			"release_date": "2015-03-09T19:44:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "No direct workarounds or remediations are available to mitigate this vulnerability."
				}
			],
			"title": "Row Hammer Privilege Escalation Vulnerability"
		}
	]
}
