{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the parsing of malformed IP version 6 (IPv6) packets in Cisco IOS XR Software for Cisco Network Convergence System 6000 (NCS 6000) and Cisco Carrier Routing System (CRS-X) could allow an unauthenticated, remote attacker to cause a reload of a line card that is processing traffic.\n\r\n\n\r\nThe vulnerability is due to improper processing of malformed IPv6 packets carrying extension headers. An attacker could exploit this vulnerability by sending a malformed IPv6 packet, carrying extension headers, through an affected Cisco IOS XR device line card. An exploit could allow the attacker to cause a reload of the line card on the affected Cisco IOS XR device.\n\n\r\n\n\r\nCisco has released software updates that address this vulnerability. \n\r\n\n\r\nThere are no workarounds that address this vulnerability.\n\r\n\n\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150220-ipv6[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150220-ipv6\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "\n\r\nCisco Network Convergence System 6000 (NCS 6000) and Cisco Carrier Routing System X (CRS-X) running an affected version of Cisco IOS XR Software are affected by this vulnerability.\n\r\n\n\r\nAll flavors of Cisco CRS-X line cards are affected by this vulnerability, including Cisco CRS-X 400-Gbps Modular Services Card (MSC-X) and Cisco CRS-X 400-Gbps Forwarding Processor Cards (FP-X).\n\r\n\n\r\n\r\nConsult the \"Software Versions and Fixes\" section of this advisory for the details of affected releases.\n\r\n\n\r\nA device running an affected version of Cisco IOS XR Software release that has IPv6 enabled will display interfaces with assigned IPv6 addresses when the show ipv6 interface brief command is issued.\n\r\n\n\r\nThe show ipv6 interface brief command will produce an error message if the running version of Cisco IOS XR Software does not support IPv6, or will not show any interfaces with IPv6 addresses if IPv6 is disabled. The system is not vulnerable in either scenario.\n\r\n\n\r\nThe following example shows the output from the show ipv6 interface brief command issued on a device running Cisco IOS XR Software with IPv6 enabled:\n\r\n\n\r\n\r\nRP/0/RP0/CPU0:router# show ipv6 interface brief\n\n <!output omitted> \r\n GigabitEthernet0/2/0/0 [Up/Up]\n fe80::212:daff:fe62:c150 \n 202::1 \n\n\r\nThe IPv6 protocol is enabled if the interface configuration command ipv6 enable is present in the configuration. The following examples show a vulnerable configuration:\n\r\n\n\r\n\r\nRP/0/RP0/CPU0:router(config)# interface GigabitEthernet0/2/0/0\n\t\n  RP/0/RP0/CPU0:router(config-if)# ipv6 enable\n\n\r\n\n\r\nTo determine the Cisco IOS XR Software release and the exact name of the product on which it runs, administrators can log in to the device and issue the show version command to display the system banner. The system banner confirms that the device is running Cisco IOS XR Software by displaying \"Cisco IOS XR Software\" or similar text. \n\r\n\n\r\nThe location and name of the system image file currently running on the router are displayed under the \"System image file is\" text.\r\nThe hardware product is indicated in the line following the name of the system image file.\n\r\n\n\r\nThe following example identifies a Cisco product that is running Cisco IOS XR Software Release 4.1.0 with an installed image name of mbihfr-rp.vm:\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\nRP/0/RP0/CPU0:router# show version\n Mon May 31 02:14:12.722 DST\n\n Cisco IOS XR Software, Version 4.1.0\n Copyright (c) 2010 by Cisco Systems, Inc.\n\n ROM: System Bootstrap, Version 2.100(20100129:213223) [CRS-1 ROMMON],  \n\n router uptime is 1 week, 6 days, 4 hours, 22 minutes\n System image file is \"bootflash:disk0/hfr-os-mbi-4.1.0/mbihfr-rp.vm\"\n\n cisco CRS-8/S (7457) processor with 4194304K bytes of memory.\n 7457 processor at 1197Mhz, Revision 1.2\r\n\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only the following products are affected by this vulnerability: \n\r\n\r\n    Cisco NCS 6000 \r\n    All flavors of Cisco CRS-X line cards, including Cisco CRS-X Modular Services Card (MSC-X) and Cisco CRS-X 400-Gbps Forwarding Processor Cards (FP-X).\r\n\r\n\n\r\nCisco 12000 Series Routers, Cisco ASR 9000 Series Aggregation Services Routers, Cisco Carrier Routing System 1 (CRS-1) or Cisco Carrier Routing System 3 (CRS-3) running Cisco IOS XR Software are not affected by this vulnerability.\n\r\n\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "A vulnerability in the parsing of malformed IP version 6 (IPv6) packets in Cisco IOS XR Software for Cisco Network Convergence System 6000 (NCS 6000) and Cisco Carrier Routing System (CRS-X) could allow an unauthenticated, remote attacker to cause a reload of a line card that is processing traffic.\n\r\n\n\r\nThe vulnerability is due to improper processing of malformed IPv6 packets carrying extension headers. An attacker could exploit this vulnerability by sending a malformed IPv6 packet, carrying extension headers, through an affected Cisco IOS XR device line card. An exploit could allow the attacker to cause a reload of the line card on the affected Cisco IOS XR device.\n\n\r\n\n\r\nThis vulnerability could be exploited repeatedly to cause an extended DoS condition.\n\r\n\n\r\nA device is vulnerable only if it is configured to process IPv6 traffic passing through the device. \n\r\n\n\r\nThis vulnerability can be exploited using only IPv6 packets. A crafted IPv6 packet carrying extension headers can trigger the vulnerability.\n\r\n\n\r\nThis vulnerability can only be triggered by the traffic transiting an affected device. IPv4 traffic, or IPv6 traffic destined to an affected device cannot be used to exploit this vulnerability on an affected device.\n\r\n\n\r\nWhile certain intermediate devices may block malformed IPv6 packets, the possibility still exists for a malformed packet to originate from a remote network and exploit this vulnerability on an affected device.\n\r\n\n\r\nThis vulnerability has been documented in Cisco bug ID CSCuq95241[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuq95241\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned the Common Vulnerabilities and Exposures (CVE) CVE-2015-0618.\r\n\n\r\n\r\n\n",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Notices archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers. \n\r\n\n\r\nCisco IOS XR release version 5.2.3 for Cisco NCS 6000 is not affected by this vulnerability. All other releases of Cisco IOS XR for Cisco NCS 6000 are affected by this vulnerability.\n\r\n\n\r\nCisco IOS XR release version 5.3.0 for CRS-X is not affected by this vulnerability. All other releases of Cisco IOS XR for CRS-X that have a support for Cisco CRS-X line cards, including Cisco CRS-X 400-Gbps Modular Service Card (MSC-X) and Cisco CRS-X 400-Gbps Forwarding Processor Cards (FP-X) are affected by this vulnerability.\n\r\n\n\r\n\n\r\nThis vulnerability is corrected in the following Cisco IOS XR Software software maintenance updates (SMUs):\n\r\n\n\r\n\r\nncs6k-5.0.1.CSCuq95241.smu for version 5.0.1 for NCS 6000\n\r\n\r\nncs6k-5.2.1.CSCuq95241.smu for version 5.2.1 for NCS 6000\n\r\n\n\r\nhfr-px-5.1.1.CSCus54167.pie for versions 5.1.1 for CRS-X\n\r\nhfr-px-5.1.2.CSCus54167.pie for versions 5.1.2 for CRS-X\n\r\n\r\nhfr-px-5.1.3.CSCuq95241.pie for version 5.1.3 for CRS-X\n\r\n\r\nhfr-px-5.1.4.CSCuq95241.pie for version 5.1.4 for CRS-X\n\r\n\n\r\nNote: Cisco IOS XR Software SMUs for additional versions will be published when available.\r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \r\n\r\nThis vulnerability was discovered during internal testing.\r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS XR Software IPv6 Malformed Packet Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150220-ipv6"
			},
			{
				"category": "external",
				"summary": "Cisco IOS XR Software IPv6 Malformed Packet Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAlert.x?alertId=37510"
			}
		],
		"title": "Cisco IOS XR Software IPv6 Malformed Packet Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2015-02-24T01:19:00+00:00",
			"generator": {
				"date": "2022-07-15T00:30:43+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20150220-ipv6",
			"initial_release_date": "2015-02-20T16:30:00+00:00",
			"revision_history": [
				{
					"date": "2015-02-20T16:30:18+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				},
				{
					"date": "2015-02-24T01:19:14+00:00",
					"number": "1.1.0",
					"summary": "Software Versions and Fixes updated"
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco IOS XR Software",
						"product": {
							"name": "Cisco IOS XR Software ",
							"product_id": "CSAFPID-5834"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2015-0618",
			"notes": [
				{
					"category": "other",
					"text": "CSCuq95241",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-5834"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco IOS XR Software IPv6 Malformed Packet Denial of Service Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150220-ipv6"
				}
			],
			"release_date": "2015-02-20T16:30:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-5834"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-5834"
					]
				}
			],
			"title": "Cisco IOS XR Software IPv6 Malformed Packet Denial of Service Vulnerability"
		}
	]
}
