{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the code handling the reassembly of fragmented IP version 4 (IPv4) or IP version 6 (IPv6) packets of Cisco IOS XE Software for Cisco ASR 1000 Series Aggregation Services Routers could allow an unauthenticated, remote attacker to cause a crash of the Embedded Services Processor (ESP) processing the packet.\n\r\n\n\r\nThe vulnerability is due to improper processing of crafted, fragmented packets. An attacker could exploit this vulnerability by sending a crafted sequence of fragmented packets. An exploit could allow the attacker to cause a reload of the affected platform.\n\r\n\n\r\nCisco has released software updates that address this vulnerability.\n\r\n\n\r\nThere are no workarounds to mitigate this vulnerability. \n\r\n\n\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150730-asr1k[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150730-asr1k\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "All Cisco ASR 1000 Series Aggregation Services Routers models are affected by this vulnerability when running an affected version of Cisco IOS XE Software. This vulnerability does not depend on any specific combination of ESP and Route Processor (RP) installed on the chassis. Any combination of ESP and RP is affected.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only Cisco ASR 1000 Series Aggregation Services Routers running an affected version of Cisco IOS XE Software are affected by this vulnerability.\n\r\n\n\r\nCisco 4000 Series Integrated Services Routers and Cisco Cloud Services Router 1000V Series are not affected by this vulnerability.\n\r\n\n\r\nNo other Cisco devices running Cisco IOS XE Software are affected by this vulnerability.\n\r\n\n\r\nCisco IOS Software is not affected by this vulnerability.\n\r\n\n\r\nCisco IOS XR Software is not affected by this vulnerability.\n\r\n\n\r\nCisco NX-OS Software is not affected by this vulnerability.\n\r\n\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.\n",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "A vulnerability in the code handling the reassembly of fragmented IP version 4 (IPv4) or IP version 6 (IPv6) packets of Cisco IOS XE Software for Cisco ASR 1000 Series Aggregation Services Routers could allow an unauthenticated, remote attacker to cause a crash of the Embedded Services Processor (ESP) processing the packet.\n\r\n\n\r\nThe vulnerability is due to improper processing of crafted, fragmented packets. An attacker could exploit this vulnerability by sending a crafted sequence of fragmented packets. An exploit could allow the attacker to cause a reload of the affected platform.\n\r\n\n\r\nThis vulnerability can be triggered by IPv4 or IPv6 crafted, fragmented packets destined to the device itself. It cannot be triggered by transit traffic.\n\r\n\n\r\nThis vulnerability could be repeatedly exploited to cause an extended DoS condition.\r\n\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCtd72617[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCtd72617\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only), and has been assigned Common Vulnerabilities and Exposures (CVE) ID CVE-2015-4291.\n",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds for this vulnerability.\r\n",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Alerts archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution.\n\r\n\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nThis vulnerability has been fixed in the following Cisco IOS XE Software versions:\n\r\n\n\r\n\r\n    \r\n        \r\n             Cisco IOS XE Software Train  \r\n             First Fixed Release    \r\n        \r\n        \r\n             2.1 \r\n            Vulnerable; migrate to 2.5.1 or later. (1)[\"#note1\"] \r\n        \r\n        \r\n             2.2 \r\n            Vulnerable; migrate to 2.5.1 or later.  (1)[\"#note1\"] \r\n        \r\n        \r\n             2.3 \r\n            Vulnerable; migrate to 2.5.1 or later.  (1)[\"#note1\"] \r\n        \r\n        \r\n             2.4 \r\n            2.4.3 (1)[\"#note1\"]  \r\n        \r\n        \r\n             2.5   \r\n            2.5.1 (1)[\"#note1\"] \r\n        \r\n        \r\n             2.6 \r\n             Not vulnerable \r\n        \r\n        \r\n             Any 3.x train. \r\n             Not vulnerable  (2)[\"#note2\"]   \r\n        \r\n    \r\n\r\n\n\r\nNotes\n\r\n\n\r\n\r\n1. Cisco encourages customers migrating to a Cisco IOS XE Software train different from the one currently running on the device to select one of the Cisco IOS XE Software extended support trains including, but not limited to, Cisco IOS XE Software trains 3.4S, 3.7S, and 3.10S. Consult your support provider for the most appropriate software train to migrate to, based on the specific device hardware configuration and feature requirements.\n\r\n\n\r\n\r\n2. No Cisco IOS XE Software trains with a major version number starting with the number 3 (such as 3.xS, 3.xSE, and 3.xSQ) are affected by the vulnerability described in this Cisco Security Advisory.\n\r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \n\r\n\n\r\n Cisco PSIRT is aware of disruption for some\r\nCisco customers with Cisco ASR 1000 Series Aggregation Services Routers devices affected by this vulnerability. Traffic causing the disruption was isolated to a\r\nspecific source IPv4 address. Cisco has engaged the owner\r\nof that address and determined that the traffic was sent with no\r\nmalicious intent. Cisco strongly recommends that customers upgrade to a\r\nfixed Cisco IOS XE Software release to remediate this issue. \r\n\r\nThis vulnerability was found internally by Cisco.\r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco ASR 1000 Series Aggregation Services Routers Fragmented Packet Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150730-asr1k"
			},
			{
				"category": "external",
				"summary": "Cisco IOS XE Software Fragmented Packet Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAlert.x?alertId=40212"
			}
		],
		"title": "Cisco ASR 1000 Series Aggregation Services Routers Fragmented Packet Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2015-07-30T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:48:14+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20150730-asr1k",
			"initial_release_date": "2015-07-30T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2015-07-30T15:31:12+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco IOS XE Software",
						"product": {
							"name": "Cisco IOS XE Software ",
							"product_id": "CSAFPID-93036"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2015-4291",
			"notes": [
				{
					"category": "other",
					"text": "CSCtd72617",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-93036"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco ASR 1000 Series Aggregation Services Routers Fragmented Packet Denial of Service Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150730-asr1k"
				}
			],
			"release_date": "2015-07-30T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for this vulnerability.\r\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-93036"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-93036"
					]
				}
			],
			"title": "Cisco IOS XE Software Fragmented Packet Denial of Service Vulnerability"
		}
	]
}
