{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Cisco Unity Connection contains multiple vulnerabilities, when it is configured with  Session Initiation Protocol (SIP) trunk integration. The vulnerabilities described in this advisory are denial of service vulnerabilities impacting the availability of Cisco Unity Connection for processing SIP messages.\n\r\n \n\r\nCisco has released software updates that address these vulnerabilities. Workarounds that mitigate these vulnerabilities are not available.\n\r\n\n\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150401-cuc[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150401-cuc\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco Unity Connection is affected by all the vulnerabilities listed in this advisory if the implementation is integrated with SIP.   \n\r\n\n\r\nImplementations that use Skinny Call Control Protocol (SCCP) integration are not affected by any of the vulnerabilities described in this advisory.\n\r\n\n\r\nIntegrations over either IP version 4 (IPv4) or IP version 6 (IPv6) are affected.\n",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "The following table shows the major Cisco Unity Connection versions affected by each individual vulnerability:\n\r\n\n\r\n\r\n    \r\n        \r\n            Major Version\r\n            Major Train Affected by Vulnerability\r\n        \r\n        \r\n            CSCul28089\r\n            CSCul26267\r\n            CSCul20444\r\n            CSCuh25062\r\n            CSCul69819\r\n        \r\n        \r\n            Prior to 8.5\r\n            Y\n\r\n            \r\n            Y\r\n            Y \r\n            Y \r\n            Y \r\n        \r\n        \r\n            8.5\r\n            Y\r\n            Y \r\n            Y \r\n            Y \r\n            Y \r\n        \r\n        \r\n            8.6\r\n            Y\r\n            Y\r\n            Y \r\n            Y \r\n            Y \r\n        \r\n        \r\n            9.0\r\n            Y\r\n            Y\r\n            Y \r\n            Y \r\n            Y \r\n        \r\n        \r\n            9.1\r\n            Y\r\n            Y\r\n            Y \r\n            Y \r\n            Y \r\n        \r\n        \r\n            10.0\r\n            Y\r\n            Y\r\n            Y \r\n            N \r\n            N \r\n        \r\n        \r\n            10.5\r\n            N\r\n            N\r\n            N \r\n            N \r\n            N \r\n        \r\n    \r\n\r\n\n\r\nAlthough each vulnerability is independent from the other, given they all impact SIP communications, it is recommended to upgrade to a version that contains the fixes for all five vulnerabilities.\n\r\n\n\r\nNote: Cisco Unity Connection versions prior to 8.5 have reached end of software maintenance. Customers running versions prior to 8.5 should contact their Cisco support team for assistance in upgrading to a supported version of Cisco Unity Connection.\n\r\n\n\r\n\r\nInformation About Cisco Business Edition\n\r\n\n\r\nCisco Business Edition 7000 and Cisco Business Edition 6000 are affected by these vulnerabilities if the Cisco Unity Connection version that is used is among the affected versions in the tables in the \"Vulnerable Products\" section of the security advisory.\r\n\n\r\n\n\r\nDetermine the Software Version\r\n\n\r\n\n\r\nTo determine the Cisco Unity Connection software version that an appliance is running, administrators can access the Cisco Unity Connection web interface and click the About link at the top right.\r\nOptionally, administrators can log in to the command-line interface and access the main menu. The software version can be identified by using the show version active command. The following example shows Cisco Unity Connection running version 8.6.2:\r\n\n\r\n\r\nWelcome to the Platform Command Line Interfaceadmin:show version activeActive Master Version: 8.6.2.10000-30\r\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "The following products are not affected:\n\r\n\r\n    Cisco IOS Software SIP implementation\r\n    Cisco Unified Communications Manager\r\n    Cisco Unity Express\r\n\r\nNo other Cisco products are currently known to be affected by these vulnerabilities.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco Unity Connection is a feature-rich voice messaging platform that runs on the same Linux-based Cisco Unified Communications Operating System that is used by Cisco Unified Communications Manager. Cisco Unity Connection scales to support enterprise organizations with up to 100,000 users. \n\r\n\n\r\nCisco Unity Connection can be integrated into the voice infrastructure using either SIP or SCCP. Only SIP integrations are affected by the following vulnerabilities:\n\r\n\n\r\nNote: All the following vulnerabilities can be exploited by either IPv4 or IPv6 communications.\n\r\n\n\r\nCisco Unity Connection SIP Trunk Integration Port UDP 5060 Denial of Service Vulnerability\n\r\n\n\r\nA vulnerability in the Connection Conversation Manager (CuCsMgr) process of Cisco Unity\r\nConnection could allow an unauthenticated, remote attacker to cause the\r\nSIP network port UDP 5060 to close on the affected device.\r\n\n\r\n\n\r\nThe vulnerability is due to incorrect processing of specific UDP packets.\r\nAn attacker could exploit this vulnerability by sending a specific UDP\r\npacket to the configured SIP trunk of the affected device. A successful exploit could\r\nallow the attacker to cause the SIP port to close, rendering Cisco\r\nUnity Connection unable to process any further calls.\n\r\n\n\r\nUDP port 5060 is bound to the CuCsMgr process on Unity Connection and that it closed permanently receiving specific UDP packets.  This vulnerability is known to be exploitable with publicly available network scanners.\n\r\n\n\r\nThis vulnerability can be exploited using UDP packets only.\n\r\n\n\r\nWhen the vulnerability is exploited, the Cisco Unity Connection administrator must restart the CuCsMgr process.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCuh25062[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuh25062\"] (registered customers only[\"http://tools.cisco.com/RPF/register/register.do\"]) and has been assigned Common Vulnerabilities and Exposures (CVE) ID CVE-2015-0612.\n\r\n\n\r\nCisco Unity Connection SIP Trunk Integration Crafted INVITE Message Denial of Service Vulnerability\n\r\nA vulnerability in the Connection Conversation Manager (CuCsMgr) process of Cisco Unity Connection could allow an unauthenticated, remote attacker to cause the CuCsMgr process to core dump and restart.\r\n\n\r\n\n\r\nThe vulnerability is due to incorrect processing of crafted SIP INVITE messages. An attacker could exploit this vulnerability by sending crafted SIP INVITE messages to the Cisco Unity Connection server. An exploit could allow the attacker to trigger a core dump of the CuCsMgr process and create a denial of service condition.This vulnerability is independent of the transport protocols that are used and can be exploited with UDP, TCP, or TLS connections.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCul20444[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCul20444\"] (registered customers only[\"http://tools.cisco.com/RPF/register/register.do\"]) and has been assigned CVE ID CVE-2015-0613.\n\r\n\n\r\nCisco Unity Connection SIP Trunk Integration Crafted INVITE Message Denial of Service Vulnerability\n\r\nA vulnerability in the Connection Conversation Manager (CuCsMgr) process of Cisco Unity Connection could allow an unauthenticated, remote attacker to cause the CuCsMgr process to core dump and restart.\r\n\r\nThe vulnerability is due to incorrect processing of crafted SIP INVITE messages. An attacker could exploit this vulnerability by sending crafted SIP INVITE messages to the Cisco Unity Connection server. An exploit could allow the attacker to trigger a core dump of the CuCsMgr process and create a DoS condition.\r\nWhilst this vulnerability is similar to the previous vulnerability, it is a different part of the SIP Invite message that is incorrectly processed.\n\r\n\n\r\nThis vulnerability is independent of the transport protocols that are used and can be exploited with UDP, TCP, or TLS connections.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCul26267[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCul26267\"] (registered customers only[\"http://tools.cisco.com/RPF/register/register.do\"]) and has been assigned CVE ID CVE-2015-0614.\n\r\n\n\r\n\r\nNote: The difference between the vulnerability documented in CVE ID CVE-2015-0613 and  CVE ID CVE-2015-0614 is that each vulnerability is exploited by using different fields in the SIP INVITE messages.\n\r\n\n\r\nCisco Unity Connection SIP Trunk Integration Ports Busy Denial of Service Vulnerability\n\r\nA vulnerability in the SIP call handling code of Cisco Unity Connection could allow an unauthenticated, remote attacker to cause all the SIP connection lines (ports) to be consumed.\r\n\n\r\n\n\r\nThe vulnerability is due to not releasing allocated resources under specific connection scenarios. An attacker could exploit this vulnerability by abnormally terminating a SIP session. An exploit could allow the attacker to consume all available SIP ports on Unity Connection, preventing any further connections.When this vulnerability is exploited all the SIP lines (known as ports) on Cisco Unity Connection will respond with a 503 error indicating all ports are busy. The only way to recover is for the Cisco Unity Connection administrator to restart the conversation manager.\n\r\n\n\r\nThis vulnerability is independent of the transport protocols that are used and can be exploited with UDP, TCP, or TLS connections.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCul28089[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCul28089\"] (registered customers only[\"http://tools.cisco.com/RPF/register/register.do\"]) and has been assigned CVE ID CVE-2015-0615.\n\r\n\n\r\nCisco Unity Connection SIP Trunk Integration CuCsMgr Denial of Service Vulnerability\n\r\n\n\r\nA vulnerability in the Connection Conversation Manager (CuCsMgr) process of Cisco Unity Connection could allow an unauthenticated, remote attacker to cause the CuCsMgr process to core dump and restart.\r\n\n\r\n\n\r\nThe vulnerability is due to incorrect handling of incorrectly terminated SIP conversations. An attacker could exploit this vulnerability by abnormal termination of SIP connections to the Cisco Unity Connection server. An exploit could allow the attacker to trigger a core dump of the CuCsMgr process and create a DoS condition.\n\r\n\n\r\nThis vulnerability can be exploited with TCP SIP connections only.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCul69819[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCul69819\"] (registered customers only[\"http://tools.cisco.com/RPF/register/register.do\"]) and has been assigned CVE ID CVE-2015-0616.\n",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that mitigate these vulnerabilities.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Alerts archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers. \n\r\n\n\r\nThe following table contains the first fixed releases, which include the fixes for all the vulnerabilities described in this advisory:\r\n\r\n\r\n    \r\n        \r\n            Version \r\n            First Fixed Release \r\n        \r\n        \r\n            8.5\r\n            8.5(1)SU7\n\r\n            \r\n        \r\n        \r\n            8.6\r\n            8.6(2a)SU4\r\n        \r\n        \r\n            9.0\r\n            Vulnerable; Migrate to 9.1(2)SU2 or later.\r\n        \r\n        \r\n            9.1\r\n            9.1(2)SU2\r\n        \r\n        \r\n            10.0\r\n            10.0(1)SU1\r\n        \r\n        \r\n            10.5\r\n            Not Affected\r\n        \r\n    \r\n\r\nThe following table contains the first fixed release per vulnerability:\r\n\r\n\r\n    \r\n        \r\n            Version\r\n            First Fixed Release\r\n        \r\n        \r\n            CSCul28089\r\n            CSCul26267\r\n            CSCul20444\r\n            CSCuh25062\r\n            CSCul69819\r\n        \r\n        \r\n            8.5\r\n            8.5(1)SU7\r\n            8.5(1)SU7\r\n            8.5(1)SU7\r\n            8.5(1)SU6\r\n            8.5(1)SU7\r\n        \r\n        \r\n            8.6\r\n            8.6(2a)SU4\r\n            8.6(2a)SU4\r\n            8.6(2a)SU4\r\n            8.6(2a)SU4\r\n            8.6(2a)SU4\r\n        \r\n        \r\n            9.0\r\n            Vulnerable\r\n            Vulnerable\r\n            Vulnerable\r\n            Vulnerable\r\n            Vulnerable\r\n        \r\n        \r\n            9.1\r\n            9.1(2)SU2\r\n            9.1(2)SU2\r\n            9.1(2)SU2\r\n            9.1(2)SU2\r\n            9.1(2)SU2\r\n        \r\n        \r\n            10.0\r\n            10.0(1)SU1\r\n            10.0(1)SU1\r\n            10.0(1)SU1\r\n            Not Affected \r\n            Not Affected \r\n        \r\n        \r\n            10.5\r\n            Not Affected \r\n            Not Affected \r\n            Not Affected \r\n            Not Affected \r\n            Not Affected\r\n        \r\n    \r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerabilities that are described in this advisory. \r\n\r\nThese vulnerabilities were discovered by internal testing and during the handling of customer service requests.\n\r\n\n\r\nSome network scanners have been known to exploit Cisco bug ID CSCuh25062 (CVE-ID-2015-0612).\r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Multiple Vulnerabilities in Cisco Unity Connection",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150401-cuc"
			},
			{
				"category": "external",
				"summary": "Cisco Unity Connection SIP Trunk Integration Port UDP 5060 Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAlert.x?alertId=37806"
			},
			{
				"category": "external",
				"summary": "Cisco Unity Connection SIP Trunk Integration Crafted INVITE Message Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAlert.x?alertId=37807"
			},
			{
				"category": "external",
				"summary": "Cisco Unity Connection SIP Trunk Integration Ports Busy Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAlert.x?alertId=37808"
			},
			{
				"category": "external",
				"summary": "Cisco Unity Connection SIP Trunk Integration CuCsMgr Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAlert.x?alertId=37809"
			},
			{
				"category": "external",
				"summary": "Cisco Unity Connection SIP Trunk Integration Crafted INVITE Message Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAlert.x?alertId=37834"
			}
		],
		"title": "Multiple Vulnerabilities in Cisco Unity Connection",
		"tracking": {
			"current_release_date": "2015-04-01T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:24:39+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20150401-cuc",
			"initial_release_date": "2015-04-01T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2015-04-01T15:47:53+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Unity Connection",
						"product": {
							"name": "Cisco Unity Connection ",
							"product_id": "CSAFPID-73608"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2015-0612",
			"notes": [
				{
					"category": "other",
					"text": "CSCuh25062",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-73608"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unity Connection",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150401-cuc"
				}
			],
			"release_date": "2015-04-01T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that mitigate these vulnerabilities."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-73608"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-73608"
					]
				}
			],
			"title": "Cisco Unity Connection SIP Trunk Integration Port UDP 5060 Denial of Service Vulnerability"
		},
		{
			"cve": "CVE-2015-0613",
			"notes": [
				{
					"category": "other",
					"text": "CSCul20444",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-73608"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unity Connection",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150401-cuc"
				}
			],
			"release_date": "2015-04-01T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that mitigate these vulnerabilities."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-73608"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-73608"
					]
				}
			],
			"title": "Cisco Unity Connection SIP Trunk Integration Crafted INVITE Message Denial of Service Vulnerability"
		},
		{
			"cve": "CVE-2015-0614",
			"notes": [
				{
					"category": "other",
					"text": "CSCul26267",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-73608"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unity Connection",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150401-cuc"
				}
			],
			"release_date": "2015-04-01T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that mitigate these vulnerabilities."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-73608"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-73608"
					]
				}
			],
			"title": "Cisco Unity Connection SIP Trunk Integration Crafted INVITE Message Denial of Service Vulnerability"
		},
		{
			"cve": "CVE-2015-0615",
			"notes": [
				{
					"category": "other",
					"text": "CSCul28089",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-73608"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unity Connection",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150401-cuc"
				}
			],
			"release_date": "2015-04-01T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that mitigate these vulnerabilities."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-73608"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-73608"
					]
				}
			],
			"title": "Cisco Unity Connection SIP Trunk Integration Ports Busy Denial of Service Vulnerability"
		},
		{
			"cve": "CVE-2015-0616",
			"notes": [
				{
					"category": "other",
					"text": "CSCul69819",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-73608"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unity Connection",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150401-cuc"
				}
			],
			"release_date": "2015-04-01T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that mitigate these vulnerabilities."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-73608"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.1,
						"vectorString": "AV:N/AC:M/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-73608"
					]
				}
			],
			"title": "Cisco Unity Connection SIP Trunk Integration CuCsMgr Denial of Service Vulnerability"
		}
	]
}
