{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "\r\n\r\nCisco Secure Access Control System (ACS) prior to version 5.5 patch 8 is vulnerable to a SQL injection\r\nattack in the ACS View reporting interface pages. A\r\nsuccessful attack could allow an authenticated, remote attacker to access and modify information such as RADIUS accounting records stored in one of the ACS View databases or to access information in the underlying file system. A previous version of this advisory indicated that a product running version 5.5 patch 7 was not vulnerable; however, customers running version 5.5 patch 7 should upgrade to patch 8 to completely mitigate the vulnerability described in this advisory.\r\n\r\n\r\n\r\n\r\nCisco has released software updates that address this vulnerability.\r\n\r\nThis advisory is available at the following link:\r\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150211-csacs[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150211-csacs\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "All versions\r\nof Cisco Secure ACS prior to version 5.5 patch 8 are affected by the SQL injection vulnerability in this advisory.\n\r\n\r\n\r\nUse the following methods to determine the version of Cisco Secure ACS that is running:\r\n\r\n\r\n    \r\n    From the Cisco Secure ACS command-line interface (CLI), issue the\r\n    show version command, as shown in the following\r\n    example:\n\r\n    \r\n    acs55/admin# show version\n\nCisco Application Deployment Engine OS Release: 2.1\nADE-OS Build Version: 2.1.1.129\nADE-OS System Architecture: i386\n\nCopyright (c) 2005-2013 by Cisco Systems, Inc.\nAll rights reserved.\nHostname: acs55\n\n\nVersion information of installed applications\n---------------------------------------------\n\n\nCisco ACS VERSION INFORMATION\n-----------------------------\nVersion : 5.5.0.46.5\nInternal Build ID : B.723\nPatches : \n5-5-0-46-5\n\nacs55/admin\r\n    \r\n    \r\n    \r\n    \r\n    On the main login page of the Cisco Secure ACS web-based interface,\r\n    the version information is displayed on the left side of the screen.\r\n    \r\n    From the Cisco Secure ACS web-based interface, log in and click the\r\n    About link at the top right corner of the screen.\r\n\r\nThe following table maps each Cisco Secure ACS version to its official build number.\r\n\r\n\r\n    \r\n        \r\n             Version \r\n             Build \r\n        \r\n        \r\n             5.0\r\n             5.0.0.21\r\n        \r\n        \r\n             5.1\r\n             5.1.0.44\n\r\n            \r\n        \r\n        \r\n             5.2\r\n             5.2.0.26\r\n        \r\n        \r\n             5.3\r\n             5.3.0.40\r\n        \r\n        \r\n             5.4\r\n             5.4.0.46\r\n        \r\n        \r\n             5.5\r\n             5.5.0.46\r\n        \r\n    \r\n\r\nThe presence of an additional\r\ndigit after the version number indicates the highest patch level installed. For\r\nexample, a version number of 5.5.0.46.6 indicates Cisco Secure\r\nACS version 5.5 with up to patch 6 installed. The absence of an additional\r\ndigit after the version string indicates a Cisco Secure ACS version that does not have any\r\npatches installed. The preceding show version output example above shows a Cisco Secure ACS running version 5.5 Patch 5 (5.5.0.46.5).\r\n\r\n\r\n\r\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco Secure ACS versions 5.6 and later are not affected by this vulnerability.\n\r\n\n\r\nThe following Cisco Secure ACS products are not affected by this vulnerability:\n\r\n\r\n    Cisco Secure Access Control Server for Windows\r\n    Cisco Secure Access Control Server Express\r\n    Cisco Secure Access Control Server View\r\n    Cisco Secure Access Control Server Solution Engine\r\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "A core component of the Cisco TrustSec solution, Cisco Secure ACS is a highly sophisticated policy platform providing RADIUS and TACACS+ services. It supports the increasingly complex policies needed to meet today's new demands for access control management and compliance. Cisco Secure ACS provides central management of access policies for device administration and wireless, wired 802.1x, and remote VPN network access scenarios. The identity stores can be internal or external. An internal identity store has user credential information stored in an internal database. With an external identity store, Cisco Secure ACS will retrieve information from an external database.\r\n\r\n\r\n\r\n\r\n\r\n\r\nA vulnerability in the web framework code of Cisco ACS could allow an authenticated, remote attacker to execute arbitrary SQL queries on one of the two ACS View databases. The authentication requires access to an ACS administrator account.\n\r\n\n\r\nThe vulnerability is due to a failure to properly sanitize user-supplied input passed to the reporting application. An attacker could exploit this vulnerability by sending crafted requests to the web server using the HTTPS\r\nprotocol. \n\r\n\n\r\nThis vulnerability has been documented in Cisco bug ID CSCuq79027[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuq79027\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned the Common Vulnerabilities and Exposures (CVE)  ID CVE-2015-0580.\r\n",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There is no known workaround for this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Notices archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers. \r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \r\n\r\nThis vulnerability was reported to Cisco by Lukasz Plonka from ING Services Polska.\r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Secure Access Control System SQL Injection Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150211-csacs"
			},
			{
				"category": "external",
				"summary": "Cisco Secure Access Control System SQL Injection Vulnerability",
				"url": "http://tools.cisco.com/security/center/viewAlert.x?alertId=37354"
			}
		],
		"title": "Cisco Secure Access Control System SQL Injection Vulnerability",
		"tracking": {
			"current_release_date": "2015-03-19T20:24:00+00:00",
			"generator": {
				"date": "2022-07-15T00:27:21+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20150211-csacs",
			"initial_release_date": "2015-02-11T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2015-02-11T15:31:34+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				},
				{
					"date": "2015-03-11T19:34:59+00:00",
					"number": "2.0.0",
					"summary": "Updated vulnerable version number"
				},
				{
					"date": "2015-03-19T20:24:39+00:00",
					"number": "2.1.0",
					"summary": "Updated version number in Products Confirmed Not Vulnerable"
				}
			],
			"status": "final",
			"version": "2.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Secure Access Control System (ACS)",
						"product": {
							"name": "Cisco Secure Access Control System (ACS) ",
							"product_id": "CSAFPID-2074"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2015-0580",
			"notes": [
				{
					"category": "other",
					"text": "CSCuq79027",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-2074"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Secure Access Control System SQL Injection Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20150211-csacs"
				}
			],
			"release_date": "2015-02-11T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There is no known workaround for this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 9,
						"vectorString": "AV:N/AC:L/Au:S/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-2074"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 9,
						"vectorString": "AV:N/AC:L/Au:S/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-2074"
					]
				}
			],
			"title": "Cisco Secure Access Control System SQL Injection Vulnerability"
		}
	]
}
