{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was discovered as part of handling customer support requests."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the SSL/TLS functions of the Cisco ACE30 Application Control Engine Module and the Cisco ACE 4700 Series Application Control Engine Appliances could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on the affected device.\n\r\n\n\r\nThe vulnerability is due to incomplete input validation checks in the SSL/TLS code. An attacker could exploit this vulnerability by sending specific SSL/TLS packets to the affected device. An exploit could allow the attacker to trigger a reload of the affected device.\n\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\n\r\n\n\r\nThis advisory is available at the following link:\n\r\n\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160908-ace[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160908-ace\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects all software versions running on the Cisco ACE30 Application Control Engine Module and Cisco ACE 4710 Application Control Engine prior to A5(3.5).",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.\n\r\n\n\r\nCisco has confirmed that this vulnerability does not affect the following Cisco products:\r\n\r\n    Cisco ACE XML Gateway\r\n    Cisco ACE Web Application Firewall\r\n    Cisco ACE GSS 4400 Series Global Site Selector Appliances\r\n    Cisco ACE10 Application Control Engine Module\r\n    Cisco ACE20 Application Control Engine Module\r\n",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The Cisco ACE 4710 Application Control Engine appliance and the Cisco ACE30 Application Control Engine Module for Cisco Catalyst 6500 Series Switches and Cisco 7600 Series Routers are a load-balancing and application-delivery solution for data centers.  \n\r\n\n\r\nThese products entered end-of-life cycle on July 26, 2013. For reference please see End-of-Sale and End-of-Life Announcement for the Cisco ACE Application Control Engine ACE30 Module[\"http://www.cisco.com/c/en/us/products/collateral/interfaces-modules/services-modules/eol_C51-728979.html\"] and End-of-Sale and End-of-Life Announcement for the Cisco ACE 4710 Application Control Engine Hardware[\"http://www.cisco.com/c/en/us/products/collateral/application-networking-services/ace-4700-series-application-control-engine-appliances/eol_C51-728976.html\"].\n\r\n\n\r\nThe vulnerability is triggered by specific SSL/TLS protocol packets. This vulnerability affects all ACE30 and ACE 4710 devices with SSL Termination, SSL End-to-End, or SSL Initiation configurations.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "Exploitation of this vulnerability could cause an affected device to reload and generate a Network Process (NP) core file. To view the core file, administrators can issue the dir core: command in the ACE command-line interface (CLI). \n\r\n\n\r\nThe following system log messages may be observed when the ACE reloads:\n\r\n\r\n\r\n\r\n\r\n%ACE-6-199008: DC controller:Ch1 asserts back pressure” and\r\n%ACE-2-199006: Orderly reload started at  by System. \r\nReload reason: DC Counter exceeds threshold : DC0_COUNTER = 1 | DC1_COUNTER = 0#012#012.”\r\n\r\nContact the Cisco Technical Assistance Center (TAC) to review the NP core file and determine whether the device has been compromised by exploitation of this vulnerability.",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco will release free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license: http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html[\"http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html\"].\n\r\n\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized re-seller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\n\r\n\n\r\nWhen considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution.\n\r\n\n\r\nIn all cases, customers should ensure that the devices to upgrade contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\n\r\n\n\r\n\r\nCustomers Without Service Contracts\n\r\n\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco Technical Assistance Center (TAC): http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html[\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"].\n\r\n\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\n\r\n\n\r\nFixed Software\n\r\n\n\r\n\r\n    \r\n        \r\n            Cisco ACE Major Release \r\n            \r\n            First Fixed Release \r\n            \r\n        \r\n        \r\n            A1(x)\r\n            Affected; Migrate to A5(3.5)\r\n        \r\n        \r\n            A3(x)\r\n            Affected; Migrate to A5(3.5)\n\r\n            \r\n        \r\n        \r\n            A4(x)\r\n            Affected; Migrate to A5(3.5)\n\r\n            \r\n        \r\n        \r\n            A5(x)\r\n            A5(3.5)\n\r\n            \r\n        \r\n    \r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.  \n\r\n\n\r\nCisco PSIRT has observed impact to customers due to an Internet research project that was scanning SSL/TLS servers that had the consequence of triggering the vulnerability on the Cisco ACE30 and Cisco ACE 4710.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was discovered as part of handling customer support requests.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME. CISCO EXPECTS TO UPDATE THIS DOCUMENT AS NEW INFORMATION BECOMES AVAILABLE.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco ACE30 Application Control Engine Module and Cisco ACE 4710 Application Control Engine Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160908-ace"
			}
		],
		"title": "Cisco ACE30 Application Control Engine Module and Cisco ACE 4710 Application Control Engine Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2016-10-26T18:16:00+00:00",
			"generator": {
				"date": "2022-07-15T01:39:31+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20160908-ace",
			"initial_release_date": "2016-09-08T16:30:00+00:00",
			"revision_history": [
				{
					"date": "2016-09-08T16:42:22+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2016-09-15T12:20:31+00:00",
					"number": "1.1.0",
					"summary": "Updated the first fixed available software details."
				},
				{
					"date": "2016-10-26T18:16:28+00:00",
					"number": "1.2.0",
					"summary": "Updated the summary and replaced A5(x) with A5(3.5) in the Fixed Software table."
				}
			],
			"status": "interim",
			"version": "1.2.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco ACE Application Control Engine Module",
						"product": {
							"name": "Cisco ACE Application Control Engine Module ",
							"product_id": "CSAFPID-7365"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco ACE 4700 Series Application Control Engine Appliances",
						"product": {
							"name": "Cisco ACE 4700 Series Application Control Engine Appliances ",
							"product_id": "CSAFPID-80725"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2016-6399",
			"notes": [
				{
					"category": "other",
					"text": "CSCvb16317",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-7365",
					"CSAFPID-80725"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco ACE30 Application Control Engine Module and Cisco ACE 4710 Application Control Engine Denial of Service Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160908-ace"
				}
			],
			"release_date": "2016-09-08T16:30:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-7365",
						"CSAFPID-80725"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-7365",
						"CSAFPID-80725"
					]
				}
			],
			"title": "Cisco Application Control Engine and Modules Denial of Service Vulnerability"
		}
	]
}
