{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was discovered when handling customer service requests.\r\n"
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the Transaction Language 1 (TL1) code of Cisco ASR 900 Series routers could allow an unauthenticated, remote attacker to cause a reload of, or remotely execute code on, the affected system.\n\r\n\n\r\nThe vulnerability exists because the affected software performs incomplete bounds checks on input data. An attacker could exploit this vulnerability by sending a malicious request to the TL1 port, which could cause the device to reload. An exploit could allow the attacker to execute arbitrary code and obtain full control of the system or cause a reload of the affected system.\n\r\n\n\r\nCisco has released software updates that address this vulnerability. There are workarounds that address this vulnerability.\n\r\n \n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects Cisco ASR 900 Series Aggregation Services Routers (ASR902, ASR903, and ASR907) that are running the following releases of Cisco IOS XE Software:\n\r\n\r\n    3.17.0S\r\n    3.17.1S\r\n    3.17.2S\r\n    3.18.0S\r\n    3.18.1S\r\n\r\nDetermining the Cisco IOS XE Software Release\r\nTo determine which Cisco IOS XE Software release is running on a device, administrators can log in to the device, use the show version command in the CLI, and then refer to the system banner that appears. If the device is running Cisco IOS XE Software, the system banner displays Cisco IOS XE Software or similar text.\r\n\r\nThe following example shows the output of the show version command on a device that is running Cisco IOS XE Software Release 3.17.01.S:\r\n\r\n\r\nRouter>show version\r\n\r\nCisco IOS XE Software, Version 03.17.01.S - Standard Support Release\nCisco IOS Software, ASR903 Software (PPC_LINUX_IOSD-UNIVERSALK9_NPE-M), Version 15.6(1)S1, RELEASE SOFTWARE (fc3)\nTechnical Support: http://www.cisco.com/techsupport\nCopyright (c) 1986-2016 by Cisco Systems, Inc.\nCompiled Wed 09-Mar-16 06:34 by mcpre\n\n\nCisco IOS-XE software, Copyright (c) 2005-2016 by cisco Systems, Inc.\nAll rights reserved.  Certain components of Cisco IOS-XE software are\nlicensed under the GNU General Public License (\"GPL\") Version 2.0.  The\nsoftware code licensed under GPL Version 2.0 is free software that comes\nwith ABSOLUTELY NO WARRANTY.  You can redistribute and/or modify such\nGPL code under the terms of GPL Version 2.0.  For more details, see the\ndocumentation or \"License Notice\" file accompanying the IOS-XE software,\nor the applicable URL provided on the flyer accompanying the IOS-XE\nsoftware.\n\n\r\n\r\nFor information about the naming and numbering conventions for Cisco IOS XE Software releases, see White Paper: Cisco IOS and NX-OS Software Reference Guide[\"http://www.cisco.com/c/en/us/about/security-center/ios-nx-os-reference-guide.html\"].\r\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.\n\r\n\n\r\nCisco has confirmed that this vulnerability does not affect the following products:\n\r\n\r\n    Cisco ASR 901 Series Aggregation Services Routers\r\n    Cisco ASR 901 10G Series Aggregation Services Routers\r\n    Cisco ASR 901S Series Aggregation Services Routers\r\n    Cisco ASR 920 Series Aggregation Services Routers\r\n",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Exploitation of this vulnerability could cause potential remote code execution or a reload of the device. The exploit could be confirmed by a decode of the stack trace, indicating that the device crashed in the TL1 Helper Process. An error message similar to the following example could be found in the device logs:\n\r\n\r\nException to IOS Thread:\r\nFrame pointer 0x348D3D18, PC = 0x150255E4\r\n\r\nUNIX-EXT-SIGNAL: Segmentation fault(11), Process = TL1 Helper Process\r\n-Traceback= 1#c2f8cd10bbd769d41be54f5792c0ec33  :10000000+50255E4 :10000000+33DEED0 :10000000+33DEED0 :10000000+33D6718 :10000000+33D5444\r\n\r\n",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "There are workarounds for this vulnerability. The following mitigation may help protect an infrastructure until an upgrade to a fixed version of Cisco IOS XE software can be scheduled:\r\nInfrastructure Access Control Lists \r\nTo protect infrastructure devices and minimize the risk, impact, and effectiveness of direct infrastructure attacks, administrators are advised to deploy infrastructure access control lists (iACLs) to perform policy enforcement of traffic sent to infrastructure equipment. Administrators can construct an iACL by explicitly permitting only authorized traffic sent to infrastructure devices in accordance with existing security policies and configurations. For the maximum protection of infrastructure devices, deployed iACLs should be applied in the ingress direction on all interfaces to which an IP address has been configured. An iACL workaround cannot provide complete protection against this vulnerability when the attack originates from a trusted source address.\r\n\n\r\n\n\r\nThe iACL policy denies unauthorized TL1 packets on TCP and UDP ports 3082 and 3083 that are sent to affected devices. In the following example, 192.168.60.0/24 is the IP address space that is used by the affected devices, and the host at 192.168.100.1 is considered a trusted source that requires access to the affected devices. Care should be taken to allow required traffic for routing and administrative access prior to denying all unauthorized traffic. Whenever possible, infrastructure address space should be distinct from the address space used for user and services segments. Using this addressing methodology will assist with the construction and deployment of iACLs.\r\n\r\nip access-list extended Infrastructure-ACL-Policy\n \n remark - permit trusted TL1 traffic - won't prevent exploitation from these hosts.\r\n remark - The exploit has only been seen on TCP port 3083, others are included for completeness.\n remark - Do not use these four lines if not using TL1 feature.\n permit tcp host 192.168.100.1 192.168.60.0 0.0.0.255 eq 3082\n permit tcp host 192.168.100.1 192.168.60.0 0.0.0.255 eq 3083\n permit udp host 192.168.100.1 192.168.60.0 0.0.0.255 eq 3082\n permit udp host 192.168.100.1 192.168.60.0 0.0.0.255 eq 3083\n\n!-- The following vulnerability-specific access control entry \n!-- (ACE) can aid in identification of attacks.\n\n remark deny all other traffic to TL1 port.\n deny tcp any 192.168.60.0 0.0.0.255 eq 3082 log\n deny tcp any 192.168.60.0 0.0.0.255 eq 3083 log\n deny udp any 192.168.60.0 0.0.0.255 eq 3082 log\n deny udp any 192.168.60.0 0.0.0.255 eq 3083 log\n \n!-- Permit or deny all other Layer 3 and Layer 4 traffic in accordance \n!-- with existing security policies and configurations \n!-- Apply iACL to interfaces in the ingress direction\n\n permit ip any any\n\ninterface GigabitEthernet0\n ip access-group Infrastructure-ACL-Policy in\r\n",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\n\r\nhttp://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html[\"http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page[\"http://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n\r\nCustomers Without Service Contracts\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco Technical Assistance Center (TAC):\n\r\nhttp://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html[\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n\r\n\r\nFixed Releases\r\nThis vulnerability affects the 3.17S and 3.18S release trains running on affected products.\n\r\n\n\r\n\r\n    \r\n        \r\n            Cisco IOS XE Major Affected Release \r\n            \r\n            First Fixed Release \r\n            \r\n        \r\n        \r\n            3.17S\r\n            3.17.3S; Scheduled for 30th November\r\n        \r\n        \r\n            3.18S\r\n            3.18.2S\r\n        \r\n    \r\n\r\nAdditionally to help customers determine their exposure to vulnerabilities in Cisco IOS XE Software, Cisco provides a tool, the Cisco IOS Software Checker[\"https://sec.cloudapps.cisco.com/security/center/selectIOSVersion.x\"], that identifies any Cisco Security Advisories that impact a specific Cisco IOS XE Software release and the earliest release that fixes the vulnerabilities described in each advisory (“First Fixed”). If applicable, the tool also returns the earliest release that fixes all the vulnerabilities described in all the advisories identified (“Combined First Fixed”).\r\n\r\nCustomers can use this tool to perform the following tasks:\r\n\r\n\r\n    Initiate a search by choosing one or more releases from a drop-down menu or uploading a file from a local system for the tool to parse\r\n    Enter the output of the show version command for the tool to parse \r\n    Create a custom search by including all previously published Cisco Security Advisories, a specific advisory, or all advisories in the most recent bundled publication\r\n\r\nTo determine whether a release is affected by any published Cisco Security Advisory, use the Cisco IOS Software Checker[\"https://sec.cloudapps.cisco.com/security/center/selectIOSVersion.x\"] on Cisco.com or enter a Cisco IOS XE Software release—for example, 3.17.0S—in the following field:\r\n\r\n\r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n\r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.\r\n",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was discovered when handling customer service requests.\r\n",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco ASR 900 Series Aggregation Services Routers Buffer Overflow Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20161102-tl1"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "White Paper: Cisco IOS and NX-OS Software Reference Guide",
				"url": "http://www.cisco.com/c/en/us/about/security-center/ios-nx-os-reference-guide.html"
			},
			{
				"category": "external",
				"summary": "http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html",
				"url": "http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html"
			},
			{
				"category": "external",
				"summary": "Cisco Security Advisories and Alerts page",
				"url": "http://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html",
				"url": "http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;IOS Software Checker",
				"url": "https://sec.cloudapps.cisco.com/security/center/selectIOSVersion.x"
			}
		],
		"title": "Cisco ASR 900 Series Aggregation Services Routers Buffer Overflow Vulnerability",
		"tracking": {
			"current_release_date": "2016-11-02T16:00:00+00:00",
			"generator": {
				"date": "2023-11-16T06:04:04+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20161102-tl1",
			"initial_release_date": "2016-11-02T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2016-11-02T15:42:47+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"branches": [
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "3.18.0S",
										"product": {
											"name": "3.18.0S",
											"product_id": "CSAFPID-217271"
										}
									},
									{
										"category": "service_pack",
										"name": "3.18.1S",
										"product": {
											"name": "3.18.1S",
											"product_id": "CSAFPID-217272"
										}
									}
								],
								"category": "product_version",
								"name": "3.18S"
							}
						],
						"category": "product_family",
						"name": "Cisco IOS XE Software"
					},
					{
						"category": "product_family",
						"name": "Cisco ASR 900 Series Aggregation Services Routers",
						"product": {
							"name": "Cisco ASR 900 Series Aggregation Services Routers ",
							"product_id": "CSAFPID-211571"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2016-6441",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCuy15175"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-211571",
					"CSAFPID-217271",
					"CSAFPID-217272"
				]
			},
			"release_date": "2016-11-02T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-211571",
						"CSAFPID-217271",
						"CSAFPID-217272"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 10,
						"vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-211571"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-217271",
						"CSAFPID-217272"
					]
				}
			],
			"title": "Cisco ASR 900 Series Aggregation Services Routers Denial of Service Vulnerability"
		}
	]
}
