{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during the resolution of a support case.\r\n"
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the management of system timer resources in Cisco IOS XR for Cisco Network Convergence System 6000 (NCS 6000) Series Routers could allow an unauthenticated, remote attacker to cause a leak of system timer resources, leading to a nonoperational state and an eventual reload of the Route Processor (RP) on the affected platform.\n\r\n\n\r\nThe vulnerability is due to improper management of system timer resources. An attacker could exploit this vulnerability by sending a number of  Secure Shell (SSH), Secure Copy Protocol (SCP), and Secure FTP (SFTP) management connections to an affected device. An exploit could allow the attacker to cause a leak of system timer resources, leading to a nonoperational state and an eventual reload of the RP on the affected platform.\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that mitigate this vulnerability.\n\r\n\n\r\nThis advisory is available at the following link: http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160713-ncs6k[\"https://tvce.cisco.com/security/AIMS/http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160713-ncs6k\"]\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "\t",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "Cisco NCS 6000 running an affected version of Cisco IOS XR is vulnerable when configured to process SSH, SCP, and SFTP management connections to the device. For information about which Cisco IOS XR Software releases for Cisco NCS 6000 are vulnerable, see the \"Fixed Software\" section of this advisory.\n\r\n\n\r\nThis vulnerability can be exploited using both IPv4 and IPv6 packets. The vulnerability can be triggered by SSH, SCP, or SFTP management connections destined to TCP listening port 22 or other TCP ports configured for those services, and using an IPv4 or IPv6 unicast address of any interface configured on a device. An attacker must establish a TCP three-way handshake, but the management connection to a vulnerable device does not have to be authenticated.\n\r\n\n\r\nThis vulnerability can be triggered only by traffic destined to an affected device and cannot be exploited with traffic transiting an affected device.\n\r\n\n\r\nTo determine whether SSH, SCP, or SFTP is configured for management access, use the show running-config | include ssh server command and verify that the ssh server v2 command is present.\n\r\n\n\r\nThe following example shows a Cisco IOS XR router with an SSHv2 server enabled:\n\r\n\n\r\n\r\n\r\nRP/0/RP0/CPU0:router#sho run | in ssh server\nThu Jun 16 06:44:34.256 CEST\nBuilding configuration...\nssh server v2\r\nssh server vrf default\r\n\n\r\nDetermining the Cisco IOS XR Software Release\n\r\n\n\r\nTo determine which Cisco IOS XR Software release is running on a device and the name of the device on which it is running, administrators can log in to the device and use the show version command in the command-line interface (CLI). If the device is running Cisco IOS XR Software, Cisco IOS XR Software or similar text appears in the system banner. The name of the hardware product appears on the line after the location of the system image file.\n\r\n\n\r\nThe following example shows the output of the show version command on a device that is running Cisco IOS XR Software Release 5.2.5:\n\r\n\n\r\n\n\r\n\r\nRP/0/RP0/CPU0:ios#show version\nWed Jun 15 16:08:37.966 UTC\n\nCisco IOS XR Software, Version 5.2.5\nCopyright (c) 2013-2014 by Cisco Systems, Inc.\n\nBuild Information:\n Built By     : ahoang\n Built On     : Thu Mar 17 19:26:37 PDT 2016\n Build Host   : iox-lnx-006\n Workspace    : /auto/srcarchive16/production/5.2.5/all/workspace\n Version      : 5.2.5\n Location     : /opt/cisco/XR/packages/\n\ncisco NCS-6000 () processor \nSystem uptime is 6 weeks, 6 days, 19 hours, 32 minutes\r\n\n\r\n\r\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco 12000 Series Routers, Cisco ASR 9000 Series Aggregation Services Routers, Cisco Carrier Routing System, and Cisco Network Convergence System 4000 Series running Cisco IOS XR are not affected by this vulnerability.\n\r\n\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "On devices where this vulnerability is exploited, a Route Processor (RP) may not be able to create new processes, may freeze, and may start to drop routing protocol packets and management connections, eventually leading to a reload. All traffic destined to a device, as well as pass-through traffic depending on information learned from routing protocols, would be dropped during the reload process, causing a denial of service (DoS) condition.",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license\n\r\n\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\n\r\n\n\r\nWhen considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \n\r\n\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\n\r\n\n\r\nCustomers Without Service Contracts\n\r\n\r\n\n\r\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco Technical Assistance Center (TAC):\n\r\n\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\n\r\n\n\r\nFixed Releases\r\n\n\r\n This vulnerability has been corrected in the following Software Maintenance Updates (SMUs) for Cisco IOS XR Software:\n\r\n\n\r\n\r\n    ncs6k-5.2.5.CSCux76819.smu\r\n    ncs6k-5.2.4.CSCux76819.smu\r\n    ncs6k-5.2.3.CSCux76819.smu\r\n    ncs6k-5.2.1.CSCux76819.smu\r\n    ncs6k-5.0.1.CSCux76819.smu\r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.\r\n",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during the resolution of a support case.\r\n",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS XR for NCS 6000 Packet Timer Leak Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160713-ncs6k"
			}
		],
		"title": "Cisco IOS XR for NCS 6000 Packet Timer Leak Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2016-07-13T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T01:37:27+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20160713-ncs6k",
			"initial_release_date": "2016-07-13T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2016-07-13T15:20:28+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco IOS XR Software",
						"product": {
							"name": "Cisco IOS XR Software ",
							"product_id": "CSAFPID-5834"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2016-1426",
			"notes": [
				{
					"category": "other",
					"text": "CSCux76819",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-5834"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco IOS XR for NCS 6000 Packet Timer Leak Denial of Service Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160713-ncs6k"
				}
			],
			"release_date": "2016-07-13T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-5834"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-5834"
					]
				}
			],
			"title": "Cisco IOS XR for NCS 6000 Packet Timer Leak Denial of Service Vulnerability"
		}
	]
}
