{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was reported to Cisco by Francis Provencher, COSIG."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in Cisco WebEx Meetings Player could allow an unauthenticated, remote attacker to execute arbitrary code.\n\r\n\n\r\nThe vulnerability is due to improper handling of user-supplied files. An attacker could exploit this vulnerability by persuading a user to open a malicious WRF file by using the affected software. A successful exploit could allow the attacker to execute arbitrary code on the system with the privileges of the user.\n\r\n\n\r\nCisco has released software updates that address this vulnerability. Workarounds that address this vulnerability are not available.\n\r\n\n\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160831-meetings-player[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160831-meetings-player\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects Cisco WebEx Meetings Player. For information about fixed releases, refer to the \"Fixed Software\" section of this advisory.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\n\r\nhttp://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html[\"http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html\"]\n\r\n\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\n\r\n\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page[\"http://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\n\r\n\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\nCustomers Without Service Contracts\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco Technical Assistance Center (TAC):\n\r\nhttp://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html[\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"]\n\r\n\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\n\r\nFixed Software\r\nIn the following table, the left column lists major releases of Cisco WebEx Meetings Software. The right column indicates the first releases that include the fix for this vulnerability.\n\r\n\n\r\n\r\n    \r\n        \r\n             Cisco WebEx Meetings Major Release\r\n            \r\n            First Fixed Release\r\n            \r\n        \r\n        \r\n            T31R2\r\n            T31R2 or later\r\n        \r\n        \r\n            T31\r\n            T31.5.20 or later\r\n        \r\n        \r\n            T30\r\n            T30.12.1 or later\r\n        \r\n        \r\n            T29\r\n            T29.13.112 or later\r\n        \r\n    \r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.\r\n",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was reported to Cisco by Francis Provencher, COSIG.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco WebEx Meetings Player Arbitrary Code Execution Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160831-meetings-player"
			}
		],
		"title": "Cisco WebEx Meetings Player Arbitrary Code Execution Vulnerability",
		"tracking": {
			"current_release_date": "2016-10-25T15:16:00+00:00",
			"generator": {
				"date": "2022-07-15T01:39:08+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20160831-meetings-player",
			"initial_release_date": "2016-08-31T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2016-08-31T15:18:16+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2016-10-22T14:37:28+00:00",
					"number": "1.1.0",
					"summary": "Added table of fixed software releases. Updated Vulnerable Products section to refer to the new table in the Fixed Software section."
				},
				{
					"date": "2016-10-25T15:16:51+00:00",
					"number": "1.2.0",
					"summary": "Changed \"malicious file\" to \"malicious WRF file.\""
				}
			],
			"status": "final",
			"version": "1.2.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco WebEx Meeting Center",
						"product": {
							"name": "Cisco WebEx Meeting Center ",
							"product_id": "CSAFPID-97151"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2016-1464",
			"notes": [
				{
					"category": "other",
					"text": "CSCva09375",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-97151"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco WebEx Meetings Player Arbitrary Code Execution Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160831-meetings-player"
				}
			],
			"release_date": "2016-08-31T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:POC/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97151"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:POC/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97151"
					]
				}
			],
			"title": "Cisco WebEx Meetings Player Arbitrary Code Execution Vulnerability"
		}
	]
}
