{
	"document": {
		"acknowledgments": [
			{
				"summary": "The vulnerability was discovered by Cisco TAC during resolution of a support case."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the Common Internet File System (CIFS) optimization feature of the Cisco Wide Area Application Service (WAAS) device could allow an unauthenticated, remote attacker to perform a resource consumption attack which, could result in a complete denial of service (DoS) condition.\n\r\n \n\r\nThe vulnerability is due to insufficient flow handling of incoming CIFS traffic. An attacker could exploit this vulnerability by sending malicious traffic designed to trigger the vulnerability. An exploit could allow the attacker to cause a DoS condition by exhausting system buffering resources, resulting in a reload of the affected device.\n\r\n\n\r\n\n\r\nThis advisory is available at the following link: http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160127-waascifs[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160127-waascifs\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "The following Cisco WAAS products are affected by this vulnerability:\n\r\n\r\n    Cisco WAAS appliances\r\n    Cisco Virtual WAAS (vWAAS)\r\n    Cisco WAAS modules\r\n\r\nThe vulnerability was introduced in WAAS version 5.1.1d. Administrators can use the  show version command from the WAAS command-line interface (CLI) to determine whether a vulnerable version of Cisco WAAS Software is running. The following example shows the results for a WAAS device running Software Version 5.5.5 Build 16:\n\r\n\n\r\n\r\n# show version\n\r\nCisco Wide Area Application Services Software (WAAS) Copyright (c) 1999-2015 by Cisco Systems, Inc.\n\r\nCisco Wide Area Application Services (accelerator-k9) Software Release 5.5.5 (build b16 Aug  4 2015)\n\r\nVersion: oe594-5.5.5.16\n\r\n...\r\n\r\n\r\nSee the \"Fixed Software\" section of this security advisory for more information about the affected versions.\r\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "The following products running Cisco WAAS software are not affected by this vulnerability:\r\n\r\n\r\n    \r\n    Cisco WAAS Express (WAASx)\r\n    Cisco WAAS Mobile\r\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.\r\n",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Exploitation of this vulnerability could cause an affected device to reload and generate a core file. To view the core file, administrators can use the dir crash command in the WAAS CLI. To determine whether a device was affected by this vulnerability, the core file should be reviewed by the Cisco Technical Assistance Center (TAC).",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "The workaround for this vulnerability is to configure the following command at the WAAS CLI:\r\n\r\n\r\n# accelerator cifs expert RxCIFS IOCTLHandling true\r\n\r\n\r\nThis command disables part of the cifs-ao optimization process. The workaround causes some requests to be sent without being locally processed, which may cause a minor performance impact in the optimization of CIFS traffic.\r\n",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\n\r\nhttp://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html[\"http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\nWhen considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution.\n\r\n\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\n\r\n\n\r\nCustomers Without Service Contracts\n\r\n\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco Technical Assistance Center (TAC):\r\n\r\n\r\n\r\nhttp://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html[\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"]\r\n\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\n\r\n\n\r\nIn the following table, the left column lists major releases of Cisco WAAS software. The right column indicates whether a major release is affected by the vulnerability described in this advisory and the first minor release that includes the fix for this vulnerability.\n\r\n \n\r\nCustomers should upgrade to an appropriate release as indicated in the following table:\n\r\n\n\r\n\r\n    \r\n        \r\n            WAAS Major Release \r\n            \r\n            First Fixed Release for This Advisory \r\n            \r\n        \r\n        \r\n            Prior to 5.0\n\r\n            \r\n            Not affected\n\r\n            \r\n        \r\n        \r\n            5.0 \n\r\n            \r\n            Not affected\n\r\n            \r\n        \r\n        \r\n            5.1\r\n            Releases prior to 5.1.1d not affected, all other releases affected; migrate to 5.3.5d or later.\n\r\n            \r\n        \r\n        \r\n            5.2\r\n            Affected; migrate to 5.3.5d\r\n        \r\n        \r\n            5.3\r\n            5.3.5d \r\n        \r\n        \r\n            5.4\r\n            Affected; migrate to 5.5.3\n\r\n            \r\n        \r\n        \r\n            5.5\r\n            5.5.3 \r\n        \r\n        \r\n            6.0\r\n            Not affected\r\n        \r\n    \r\n\r\n\n\r\nSoftware Download\n\r\n\n\r\nThe latest Cisco WAAS software can be downloaded from the Software Center on Cisco.com by visiting http://www.cisco.com/cisco/software/navigator.html[\"http://www.cisco.com/cisco/software/navigator.html\"] and selecting:\n\r\n\r\n\r\nDownloads Home > Products > Application Networking Services > Wide Area Application Services > Wide Area Application Services (WAAS) Software \r\n\r\n\r\n\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "The vulnerability was discovered by Cisco TAC during resolution of a support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Wide Area Application Service CIFS Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160127-waascifs"
			}
		],
		"title": "Cisco Wide Area Application Service CIFS Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2016-01-27T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:48:16+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20160127-waascifs",
			"initial_release_date": "2016-01-27T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2016-01-27T15:20:54+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Wide Area Application Services (WAAS)",
						"product": {
							"name": "Cisco Wide Area Application Services (WAAS) ",
							"product_id": "CSAFPID-7367"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2015-6421",
			"notes": [
				{
					"category": "other",
					"text": "CSCus85330",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-7367"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Wide Area Application Service CIFS Denial of Service Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160127-waascifs"
				}
			],
			"release_date": "2016-01-27T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "The workaround for this vulnerability is to configure the following command at the WAAS CLI:\r\n\r\n\r\n# accelerator cifs expert RxCIFS IOCTLHandling true\r\n\r\n\r\nThis command disables part of the cifs-ao optimization process. The workaround causes some requests to be sent without being locally processed, which may cause a minor performance impact in the optimization of CIFS traffic.\r\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-7367"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-7367"
					]
				}
			],
			"title": "Cisco Wide Area Application Service CIFS DoS Vulnerability"
		}
	]
}
