{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during the resolution of a support case."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in Cisco IronPort AsyncOS for Cisco Email Security Appliances (ESA) could allow an unauthenticated, remote attacker to obtain complete control of an affected device.\n\r\n\n\r\nThe vulnerability is due to the presence of a Cisco internal testing and debugging interface (intended for use during product manufacturing only) on customer-available software releases. An attacker could exploit this vulnerability by connecting to this testing and debugging interface. An exploit could allow an attacker to obtain complete control of an affected device with root-level privileges.\n\r\n\n\r\nCisco has released software updates that address this vulnerability. A workaround that mitigates this vulnerability is available.\n\r\n\n\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160922-esa[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160922-esa\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco ESA physical and virtual devices running any of the following software releases are affected by this vulnerability:\n\r\n\r\n    9.1.2-023\r\n    9.1.2-028\r\n    9.1.2-036\r\n    9.7.2-046\r\n    9.7.2-047\r\n    9.7-2-054\r\n    10.0.0-124\r\n    10.0.0-125\r\n\r\nTo determine whether a vulnerable version of Cisco AsyncOS Software is running on a Cisco ESA, administrators can use the version command in the ESA command-line interface (CLI). The following example shows the results for a device running Cisco AsyncOS Software version 8.5.7-044:\n\r\n\n\r\nciscoesa> version\n\r\nCurrent Version\n\r\n===============\n\r\nProduct: Cisco IronPort X1070 Messaging Gateway(tm) Appliance\n\r\nModel: X1070\n\r\nVersion: 8.5.7-044\n\r\n.\n\r\n.\n\r\n.\n\r\n\n\r\nCisco Cloud Email Security (CES) includes the ESA and the Security Management Appliance (SMA) as part of the service solution. Cisco provides regular maintenance of the products included in this solution. Customers can also request a software upgrade by contacting Cisco CES support.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.\n\r\n\n\r\nCisco has confirmed that this vulnerability does not affect the following products:\n\r\n\r\n    Cloud Email Security (CES) service \r\n    Content Security Management Appliance (SMA) - virtual and physical devices\r\n    Web Security Appliance (WSA) - virtual and physical devices\r\n",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "A vulnerability in Cisco IronPort AsyncOS for Cisco Email Security Appliances (ESA) could allow an unauthenticated, remote attacker to obtain complete control of an affected device.\n\r\n\n\r\nThe vulnerability is due to the presence of a Cisco internal testing and debugging interface (intended for use during product manufacturing only) on customer-available software releases. An attacker could exploit this vulnerability by connecting to this testing and debugging interface. An exploit could allow an attacker to obtain complete control of an affected device with root-level privileges.\n\r\n\n\r\nOnly Cisco ESA devices that meet all of the following conditions are affected by this vulnerability:\n\r\n\r\n    The device is running one of the previously listed affected software releases, and\r\n    The device has been rebooted at most once since one of the previously listed affected software releases was installed, and\r\n    The device's Enrollment Client component version is earlier than version 1.0.2-065 \r\n\r\nA device that has been rebooted two or more times after installation of an affected software release is not affected by this vulnerability, as the interface becomes disabled and unavailable after the second device reboot.\n\r\n\n\r\nOn Friday, September 15, 2016, Cisco Systems made available an Enrollment Client update for ESA devices. This update, once installed, disabled the internal testing interface. Any ESA device running one of the previously listed affected software releases but with this update installed is not affected by this vulnerability.\n\r\n\n\r\nIn order to verify if an ESA device downloaded and installed the update, execute the ecstatus command. The following example shows an ESA appliance with an Enrollment Client version of 1.0.2-062:\n\r\n\r\nciscoesa> ecstatus\r\n\r\nComponent                 Version    Last Updated\r\nEnrollment Client         1.0.2-062  30 Aug 2016 12:21 (GMT +00:00)\r\n\r\nciscoesa>\r\n\r\n\r\nESA devices with an Enrollment Client component version 1.0.2-065 or later are not vulnerable, as the internal testing interface has been disabled. The previous example shows an ESA appliance that has not installed the required update, as the version displayed is below 1.0.2-065.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "No customer-accessible indicators of compromise are available for this vulnerability.",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "The debugging and testing interface can be disabled by rebooting an affected device. In order to reboot an ESA device, issue the reboot command from the CLI. The interface will be permanently disabled and unavailable once the device has finished rebooting.\n\r\n\n\r\nCustomers concerned about the effectiveness of the workaround should open a support case with their support organization to verify the testing interface has effectively been disabled.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license: http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html[\"http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html\"].\r\n\n\r\n\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\n\r\n\n\r\nWhen considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution.\n\r\n\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\n\r\n\n\r\nCustomers Without Service Contracts\r\n\n\r\n\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco Technical Assistance Center (TAC): http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html[\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"].\r\n\n\r\n\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n\n\r\n\n\r\nFixed Releases\n\r\n\n\r\nCustomers are advised to upgrade to an appropriate release as indicated in the following table:\r\n\n\r\n\n\r\n\r\n    \r\n        \r\n            AsyncOS ESA Major Release\r\n            First Fixed Release\r\n        \r\n        \r\n            9.1.2\r\n            9.1.2-041\r\n        \r\n        \r\n            9.7.2\r\n            9.7.2-065\r\n        \r\n        \r\n            10.0.0\r\n            10.0.0-203\r\n        \r\n    \r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.\r\n",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during the resolution of a support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Email Security Appliance Internal Testing Interface Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160922-esa"
			}
		],
		"title": "Cisco Email Security Appliance Internal Testing Interface Vulnerability",
		"tracking": {
			"current_release_date": "2016-10-04T13:26:00+00:00",
			"generator": {
				"date": "2022-07-15T01:39:34+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20160922-esa",
			"initial_release_date": "2016-09-22T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2016-09-22T15:45:48+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				},
				{
					"date": "2016-09-28T19:08:25+00:00",
					"number": "1.1.0",
					"summary": "Added fixed software information"
				},
				{
					"date": "2016-10-04T13:26:31+00:00",
					"number": "1.2.0",
					"summary": "Added fixed software information"
				}
			],
			"status": "final",
			"version": "1.2.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Email Security Appliance (ESA)",
						"product": {
							"name": "Cisco Email Security Appliance (ESA) ",
							"product_id": "CSAFPID-189790"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2016-6406",
			"notes": [
				{
					"category": "other",
					"text": "CSCvb26017",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-189790"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Email Security Appliance Internal Testing Interface Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160922-esa"
				}
			],
			"release_date": "2016-09-22T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "The debugging and testing interface can be disabled by rebooting an affected device. In order to reboot an ESA device, issue the reboot command from the CLI. The interface will be permanently disabled and unavailable once the device has finished rebooting.\n\r\n\n\r\nCustomers concerned about the effectiveness of the workaround should open a support case with their support organization to verify the testing interface has effectively been disabled."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 10,
						"vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C/E:F/RL:W/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-189790"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 10,
						"vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C/E:F/RL:W/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-189790"
					]
				}
			],
			"title": "Cisco Email Security Appliance (ESA) Internal Testing Interface Vulnerability"
		}
	]
}
