{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during the resolution of a support case."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the email message filtering feature of Cisco AsyncOS Software for Cisco Email Security Appliances could allow an unauthenticated, remote attacker to cause an affected device to stop scanning and forwarding email messages due to a denial of service (DoS) condition.\n\r\n\n\r\nThe vulnerability is due to improper input validation of email attachments that have corrupted fields. An attacker could exploit this vulnerability by sending a crafted email message, which has an attachment with corrupted fields, through an affected device. When the affected software filters the attachment, the filtering process could crash and restart, resulting in a DoS condition. After the filtering process restarts, the software resumes filtering for the same attachment, causing the filtering process to crash and restart again. A successful exploit could allow the attacker to cause a repeated DoS condition.\n\r\n\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\n\r\n\n\r\nThis advisory is available at the following link:\r\n\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20161026-esa3[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20161026-esa3\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects all releases prior to the first fixed release of Cisco AsyncOS Software for Cisco Email Security Appliances, both virtual and hardware appliances, if the software is configured to apply a message filter or content filter to incoming email attachments. The vulnerability is not limited to any specific rules or actions for a message filter or content filter.\n\r\n\n\r\nTo determine which message filters are configured for a Cisco Email Security Appliance (ESA), administrators can use the filters detail all command in the command-line interface (CLI). The following example shows the output of the filters detail all command for an ESA that is configured to use a generic message filter:\r\n\r\nesa.prompt> filters detail all\r\n\nNum Active Valid Names\r\n  1   Y      Y    example_filter\r\nexample_filter: if body-contains(\"example\", 1) {\r\n                    quarantine(\"Policy\");\r\n                   }\r\n\r\nTo determine which rules and actions are defined for a message filter, administrators can use the Cisco AsyncOS System Administration GUI. The following example shows the settings for a message filter, named Test_Attachment_Rules, that identifies attachments with .docx in the filename and quarantines those files:\r\n\r\nTest_Attachment_Rules:\r\nif attachment-filename == '\\\\.docx$' {\r\n      quarantine('Policy');   \r\n}\r\n\r\nTo determine which content filters are configured for an ESA, administrators can use the policyconfig command in the CLI or the Cisco AsyncOS System Administration GUI. In the System Administration GUI, do the following:\n\r\n\r\n    To see filter settings for incoming email messages, choose Mail Policies > Incoming Content Filters.\r\n    To see filter settings for outgoing email messages, choose Mail Policies > Outgoing Content Filters.\r\n    \r\n\r\nTo determine which release of Cisco AsyncOS Software is running on an ESA, administrators can use the version command in the CLI. The following example shows the output of the version command for an ESA running Cisco AsyncOS Software Release 8.5.7-044:\n\r\n\r\nciscoesa> version\r\n\r\nCurrent Version\r\n===============\r\nProduct: Cisco IronPort X1070 Messaging Gateway(tm) Appliance\r\nModel: X1070\r\nVersion: 8.5.7-044\r\n.\r\n.\r\n.\r\n\r\nNote that Cisco provides regular maintenance of products in the Cisco Cloud Email Security (CES) service solution, which includes Cisco Email Security Appliances and Cisco Content Security Management Appliances. Customers can also request a software upgrade by contacting Cisco CES support.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.\n\r\n\n\r\nCisco has confirmed that this vulnerability does not affect the following products:\n\r\n\r\n    Cisco Content Security Management Appliance, virtual and hardware versions\r\n    Cisco Web Security Appliance, virtual and hardware versions\r\n",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\n\r\nhttp://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html[\"http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html\"]\n\r\n\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\n\r\n\n\r\nWhen considering software upgrades, customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories and Alerts page[\"http://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\n\r\n\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\n\r\n\n\r\nCustomers Without Service Contracts\n\r\n\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco Technical Assistance Center (TAC):\n\r\nhttp://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html[\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"]\n\r\n\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\n\r\n\n\r\nFixed Releases\n\r\n\n\r\nCustomers should upgrade to an appropriate release as indicated in this section. To help ensure a complete upgrade solution, consider that this advisory is part of a collection that includes the following advisories:\r\n\r\n    cisco-sa-20161026-esa1[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20161026-esa1\"]: Cisco Email Security Appliance Malformed DGN File Attachment Denial of Service Vulnerability\r\n    cisco-sa-20161026-esa2[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20161026-esa2\"]: Cisco Email Security Appliance Advanced Malware Protection Attachment Scanning Denial of Service Vulnerability\r\n    cisco-sa-20161026-esa3[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20161026-esa3\"]: Cisco Email Security Appliance Corrupted Attachment Fields Denial of Service Vulnerability\r\n\r\nIn the following table, the left column lists major releases of Cisco AsyncOS Software for Cisco Email Security Appliances. The center column indicates whether a major release is affected by the vulnerability described in this advisory and the first minor release that includes the fix for this vulnerability. The right column indicates whether a major release is affected by all the vulnerabilities described in this collection of advisories and which release includes fixes for those vulnerabilities.\n\r\n\n\r\nCustomers should upgrade to an appropriate release as indicated in the following table:\n\r\n\n\r\n\r\n    \r\n        \r\n            Cisco AsyncOS Software Major Release\r\n            First Fixed Release for This Vulnerability\r\n            Recommended Release for All Vulnerabilities Described in the Collection of Advisories\r\n        \r\n        \r\n            Prior to 8.0\n\r\n            \r\n            Affected; migrate to 9.1.1-038\n\r\n            \r\n            9.1.2-041\n\r\n            \r\n        \r\n        \r\n            8.0\n\r\n            \r\n            Affected; migrate to 9.1.1-038\n\r\n            \r\n            9.1.2-041\n\r\n            \r\n        \r\n        \r\n            8.5\r\n            Affected; migrate to 9.1.1-038\n\r\n            \r\n            9.1.2-041\r\n        \r\n        \r\n            9.0\r\n            Affected; migrate to 9.1.1-038\n\r\n            \r\n            9.1.2-041\r\n        \r\n        \r\n            9.1\r\n            Affected; migrate to 9.1.1-038\n\r\n            \r\n            9.1.2-041\r\n        \r\n        \r\n            9.5\r\n            Affected; migrate to 9.7.2-047\r\n            9.7.2-065\r\n        \r\n        \r\n            9.6\r\n            Affected; migrate to 9.7.2-047\n\r\n            \r\n            9.7.2-065\r\n        \r\n        \r\n            9.7\r\n            Affected; migrate to 9.7.2-047\n\r\n            \r\n            9.7.2-065\r\n        \r\n        \r\n            10.0\r\n            Affected; migrate to 10.0.0-125\r\n            10.0.0-203\r\n        \r\n    \r\n\r\n\n\r\nNote: In the preceding table, the recommended release also includes the fix for a critical vulnerability that was recently disclosed for Cisco AsyncOS Software releases 9.1.2 through 10.0.0. For more information, see the Cisco Email Security Appliance Internal Testing Interface Vulnerability[\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160922-esa\"] security advisory.\n\r\n\n\r\nIn most cases, administrators can upgrade ESA software over the network by doing the following in the Cisco AsyncOS System Administration GUI:\n\r\n\r\n    Choose System Administration > System Upgrade.\r\n    Click Upgrade Options.\r\n    Click Download.\r\n    Choose the Cisco AsyncOS Software release to upgrade to.\r\n    In the Upgrade Preparation area, choose the appropriate options.\r\n    To begin the upgrade, click Proceed. A progress bar displays the status of the upgrade.\r\n\r\nAfter the upgrade is complete, the ESA reboots.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during the resolution of a support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Email Security Appliance Corrupted Attachment Fields Denial of Service Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20161026-esa3"
			}
		],
		"title": "Cisco Email Security Appliance Corrupted Attachment Fields Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2016-10-26T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T01:39:19+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20161026-esa3",
			"initial_release_date": "2016-10-26T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2016-10-26T15:30:14+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Email Security Appliance (ESA)",
						"product": {
							"name": "Cisco Email Security Appliance (ESA) ",
							"product_id": "CSAFPID-189790"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2016-6356",
			"notes": [
				{
					"category": "other",
					"text": "CSCuz63143",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-189790"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Email Security Appliance Corrupted Attachment Fields Denial of Service Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20161026-esa3"
				}
			],
			"release_date": "2016-10-26T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-189790"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-189790"
					]
				}
			],
			"title": "Cisco Email Security Appliance Corrupted Attachment Fields Denial of Service Vulnerability"
		}
	]
}
