{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during internal quality assurance security testing."
			}
		],
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the IPv6 packet decode function of the Cisco Network Analysis Module (NAM) could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition. \n\r\n\n\r\nThe vulnerability is due to an improper calculation of the IPv6 payload length of certain IPv6 packets. An attacker could exploit this vulnerability by sending crafted IPv6 packets on the network where the NAM is collecting and monitoring traffic. An exploit could allow the attacker to cause a DoS condition and the NAM could cease to collect and monitor traffic for a short time.\n\r\n\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\n\r\n\n\r\nThis advisory is available at the following link:\n\r\n\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160601-prime3[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160601-prime3\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco Prime NAM software versions prior to release 6.2(1-b). \n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Exploitation of this vulnerability could cause gaps in traffic monitoring along with a crash of the mond process. The crash of the mond process can be indicated by the following error logs:\n\r\n\n\r\nmond is not responding\n\r\nRD_WD: mond () is dead!\n\r\n\n\r\nTo view the core file and associated system log files, administrators can use the following commands:\n\r\n\n\r\n\r\n    Log in to Cisco NAM GUI\r\n    Navigate to Administration > Diagnostics > Tech Support\r\n    At the top of the page, find the Download log files link\r\n    Click the link and download the zip file\r\n    To download core files from the Tech Support page, scroll down to the Core Files section and click on the filename\r\n\r\n\n\r\nContact the Cisco Technical Assistance Center (TAC) to review the core file and system log files to determine whether the device has been compromised by exploitation of this vulnerability.",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license: http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html[\"http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html\"].\n\r\n\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\n\r\n\n\r\nWhen considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution.\n\r\n\n\r\nIn all cases, customers should ensure that the devices to upgrade contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\n\r\n\n\r\nCustomers Without Service Contracts\n\r\n\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco Technical Assistance Center (TAC): http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html[\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"].\n\r\n\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\n\r\n\n\r\nFixed Releases\n\r\n\n\r\nCustomers should upgrade to an appropriate release as indicated in this section. To help ensure a complete upgrade solution, consider that this advisory is part of a collection that includes the following advisories:\n\r\n\n\r\ncisco-sa-20160525-prime[\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160525-prime\"]: Cisco Prime Network Analysis Module Unauthenticated Remote Code Execution Vulnerability\n\r\ncisco-sa-20160525-prime3[\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160525-prime3\"]: Cisco Prime Network Analysis Module IPv6 Denial of Service Vulnerability\n\r\n\n\r\nThis vulnerability is fixed in software version 6.2(1-b) or later, which can be downloaded from:\n\r\n\n\r\nProducts > Cloud and Systems Management > Network Analysis Module (NAM) Products",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during internal quality assurance security testing.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Prime Network Analysis Module IPv6 Denial of Service Vulnerability ",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160601-prime3"
			}
		],
		"title": "Cisco Prime Network Analysis Module IPv6 Denial of Service Vulnerability ",
		"tracking": {
			"current_release_date": "2016-06-01T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T01:29:32+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20160601-prime3",
			"initial_release_date": "2016-06-01T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2016-06-01T15:24:58+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Network Analysis Module (NAM) Software",
						"product": {
							"name": "Cisco Network Analysis Module (NAM) Software ",
							"product_id": "CSAFPID-96689"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2016-1370",
			"notes": [
				{
					"category": "other",
					"text": "CSCuy37324",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-96689"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Prime Network Analysis Module IPv6 Denial of Service Vulnerability ",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160601-prime3"
				}
			],
			"release_date": "2016-03-11T19:38:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 5,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:P/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-96689"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 5,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:P/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-96689"
					]
				}
			],
			"title": "Cisco Prime Network Analysis Module IPv6 Packet Decode Vulnerability "
		}
	]
}
