{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the web-based GUI of the Cisco Cloud Services Platform 2100 could allow an authenticated, remote attacker to execute arbitrary commands on the underlying operating system with the privileges of the root user.\n\r\n\n\r\nThe vulnerability is due to insufficient sanitization of user-supplied input. An attacker could exploit this vulnerability by authenticating to the affected system with administrative privileges and inserting arbitrary commands. An exploit could allow the attacker to execute arbitrary commands on the host operating system with the privileges of root.\n\r\n\n\r\nCisco has released software updates that address this vulnerability. Workarounds that address this vulnerability are not available.\n\r\n\n\r\nThis advisory is available at the following link: http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160921-csp2100-1[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160921-csp2100-1\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco Cloud Services Platform 2100 version 2.0 is affected.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerability\r\ndescribed in this advisory. Customers may only install and expect\r\nsupport for software versions and feature sets for which they have\r\npurchased a license. By installing, downloading, accessing, or otherwise\r\nusing such software upgrades, customers agree to follow the terms of\r\nthe Cisco software license: http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html[\"http://www.cisco.com/en/US/docs/general/warranty/English/EU1KEN_.html\"]\n\r\n\n\r\nAdditionally, customers may only download software for which they have a\r\nvalid license, procured from Cisco directly, or through a Cisco\r\nauthorized reseller or partner. In most cases this will be a maintenance\r\nupgrade to software that was previously purchased. Free security\r\nsoftware updates do not entitle customers to a new software license,\r\nadditional software feature sets, or major revision upgrades.\n\r\n\n\r\nWhen considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution.\n\r\n\n\r\nIn all cases, customers should ensure that the devices to upgrade\r\ncontain sufficient memory and confirm that current hardware and software\r\nconfigurations will continue to be supported properly by the new\r\nrelease. If the information is not clear, customers are advised to\r\ncontact the Cisco Technical Assistance Center (TAC) or their contracted\r\nmaintenance providers.\n\r\n\n\r\nCustomers Without Service Contracts\n\r\n\n\r\nCustomers who purchase directly from Cisco but do not hold a Cisco\r\nservice contract and customers who make purchases through third-party\r\nvendors but are unsuccessful in obtaining fixed software through their\r\npoint of sale should obtain upgrades by contacting the Cisco Technical\r\nAssistance Center (TAC): http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\n\r\n\n\r\n[\"http://www.cisco.com/en/US/support/tsd_cisco_worldwide_contacts.html\"]Customers should have the product serial number available and be\r\nprepared to provide the URL of this advisory as evidence of entitlement\r\nto a free upgrade.\n\r\n\n\r\nFixed Releases\r\n\r\nThis vulnerability is fixed in Cisco Cloud Services Platform (CSP) 2100 release 2.1.0 and later.\n\r\n\n\r\nTo download a release of Cisco Cloud Services Platform Software, visit the Software Center on Cisco.com and navigate to Products > Switches > Virtual Networking > Cloud Services Platform 2100\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.\r\n",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Cloud Services Platform 2100 Command Injection Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160921-csp2100-1"
			}
		],
		"title": "Cisco Cloud Services Platform 2100 Command Injection Vulnerability",
		"tracking": {
			"current_release_date": "2016-09-21T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T01:39:28+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20160921-csp2100-1",
			"initial_release_date": "2016-09-21T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2016-09-21T15:01:15+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Cloud Services Platform 2100 ",
						"product": {
							"name": "Cisco Cloud Services Platform 2100  ",
							"product_id": "CSAFPID-220301"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2016-6373",
			"notes": [
				{
					"category": "other",
					"text": "CSCva00541",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-220301"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Cloud Services Platform 2100 Command Injection Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20160921-csp2100-1"
				}
			],
			"release_date": "2016-09-21T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that address this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 9,
						"vectorString": "AV:N/AC:L/Au:S/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-220301"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 9,
						"vectorString": "AV:N/AC:L/Au:S/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-220301"
					]
				}
			],
			"title": "Cisco Cloud Services Platform 2100 Command Injection Vulnerability"
		}
	]
}
