{
	"document": {
		"acknowledgments": [
			{
				"summary": "CVE-2020-26085, CVE-2020-27127, CVE-2020-27132: Cisco would like to thank Olav Sortland Thoresen of Watchcom for reporting these vulnerabilities.\r\n\r\nCVE-2020-27133, CVE-2020-27134: These vulnerabilities were found during internal security testing."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Multiple vulnerabilities in Cisco Jabber for Windows, Jabber for MacOS, and Jabber for mobile platforms could allow an attacker to execute arbitrary programs on the underlying operating system (OS) with elevated privileges or gain access to sensitive information.\r\n\r\nFor more information about these vulnerabilities, see the Details [\"#details\"] section of this advisory.\r\n\r\nCisco has released software updates that address these vulnerabilities. There are no workarounds that address these vulnerabilities.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "These vulnerabilities affect Cisco Jabber for Windows, Jabber for MacOS and Jabber for mobile platforms.\r\n\r\nFor information about which Cisco software releases are vulnerable, see the Fixed Software [\"#fs\"] section of this advisory.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by these vulnerabilities.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The vulnerabilities are not dependent on one another. Exploitation of one of the vulnerabilities is not required to exploit another vulnerability. In addition, a software release that is affected by one of the vulnerabilities may not be affected by the other vulnerabilities.\r\n\r\nDetails about the vulnerabilities are as follows:\r\n  Cisco Jabber Message Handling Vulnerabilities\r\nTo exploit the two following message handling vulnerabilities, an attacker must be able to send Extensible Messaging and Presence Protocol (XMPP) messages to end-user systems running Cisco Jabber. Attackers may require access to the same XMPP domain or another method of access to be able to send messages to clients.\r\n\r\nAs a result of exploitation, an attacker could cause the application to run an arbitrary executable that already exists within the local file path of the application. The executable would run on the end-user system with the privileges of the user who initiated the Cisco Jabber client application.\r\n\r\nSystems using Cisco Jabber in phone-only mode without XMPP messaging services enabled are not vulnerable to exploitation. In addition, the vulnerability is not exploitable when Cisco Jabber is configured to use messaging services other than XMPP messaging.\r\nCisco Jabber Message Handling Arbitrary Program Execution Vulnerability\r\n\r\nA vulnerability in Cisco Jabber for Windows and Cisco Jabber for MacOS could allow an authenticated, remote attacker to execute programs on a targeted system.\r\n\r\nThe vulnerability is due to improper validation of message contents. An attacker could exploit this vulnerability by sending specially crafted XMPP messages to the affected software. A successful exploit could allow the attacker to cause the application to execute arbitrary programs on the targeted system with the privileges of the user account that is running the Cisco Jabber client software, possibly resulting in arbitrary code execution.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\nCVE ID: CVE-2020-26085\r\nBug ID(s): CSCvv88490 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvv88490\"]\r\nSecurity Impact Rating (SIR): Critical\r\nCVSS Base Score: 9.9\r\nCVSS Vector: CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H [\"https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&vector=CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H\"]\r\n\r\nCisco Jabber Message Handling Script Injection Vulnerability\r\n\r\nA vulnerability in Cisco Jabber for Windows, MacOS, and mobile platforms could allow an authenticated, remote attacker to inject arbitrary script and potentially execute arbitrary commands on some platforms.\r\n\r\nThe vulnerability is due to improper validation of message contents. An attacker could exploit this vulnerability by sending specially crafted XMPP messages to the affected software. By convincing a targeted user to interact with a message, an attacker could inject arbitrary script code within the Jabber message window interface. A successful exploit could allow the attacker to cause the application on MacOS or Windows platforms to execute arbitrary programs on the targeted system with the privileges of the user account that is running the Cisco Jabber client software, possibly resulting in arbitrary code execution. A successful exploit on mobile platforms could allow the attacker to run a script to modify the application interface or obtain information from the Jabber application.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\nCVE ID: CVE-2020-27134\r\nBug ID(s): CSCvw38030 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvw38030\"]\r\nSecurity Impact Rating (SIR): High\r\nCVSS Base Score: 8.0\r\nCVSS Vector: CVSS:3.0/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H [\"https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&vector=CVSS:3.0/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H\"]\r\n\r\nCisco Jabber for Windows Custom Protocol Handler Command Injection Vulnerability\r\n\r\nA vulnerability in the application protocol handling features of Cisco Jabber for Windows could allow an unauthenticated, remote attacker to execute arbitrary commands.\r\n\r\nThe vulnerability is due to improper handling of input to the application protocol handlers. An attacker could exploit this vulnerability by convincing a user to click a link within a message sent by email or other messaging platform. A successful exploit could allow the attacker to execute arbitrary commands on a targeted system with the privileges of the user account that is running the Cisco Jabber client software.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nCVE ID: CVE-2020-27133\r\nBug ID(s): CSCvw39224 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvw39224\"]\r\nSecurity Impact Rating (SIR): High\r\nCVSS Base Score: 8.8\r\nCVSS Vector: CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H [\"https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&vector=CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H\"]\r\n\r\nCisco Jabber Information Disclosure Vulnerability\r\n\r\nA vulnerability in Cisco Jabber for Windows and Cisco Jabber for MacOS could allow an authenticated, remote attacker to gain access to sensitive information.\r\n\r\nThe vulnerability is due to improper validation of message contents. An attacker could exploit this vulnerability by sending specially crafted messages to a targeted system. A successful exploit could allow the attacker to cause the application to return sensitive authentication information to another system, possibly for use in further attacks.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\nCVE ID: CVE-2020-27132\r\nBug ID(s): CSCvv88491 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvv88491\"]\r\nSecurity Impact Rating (SIR): Medium\r\nCVSS Base Score: 6.5\r\nCVSS Vector: CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N [\"https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&vector=CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N\"]\r\n\r\nCisco Jabber for Windows Custom Protocol Handler Unauthorized Access Vulnerability\r\n\r\nA vulnerability in the application protocol handling features of Cisco Jabber for Windows could allow an unauthenticated, remote attacker to modify the application configuration.\r\n\r\nThe vulnerability is due to improper handling of input to the application protocol handlers. An attacker could exploit this vulnerability by convincing a user to click a link within a message sent by email or other messaging platform. A successful exploit could allow the attacker to send arbitrary input to the Cisco Jabber client software, possibly allowing the attacker to modify the application configuration.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\nCVE ID: CVE-2020-27127\r\nBug ID(s): CSCvv88492 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvv88492\"]\r\nSecurity Impact Rating (SIR): Medium\r\nCVSS Base Score: 4.3\r\nCVSS Vector: CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N [\"https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&vector=CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N\"]",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address these vulnerabilities.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerabilities described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n  Customers Without Service Contracts\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC: https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n      Fixed Releases\r\nCustomers are advised to upgrade to an appropriate fixed software release as indicated in the following tables:\r\n        Cisco Jabber for Windows Release  First Fixed Release          Earlier than 12.1.  Migrate to a fixed release.      12.1  12.1.4      12.5  12.5.3      12.6  12.6.4      12.7  12.7.3      12.8  12.8.4      12.9  12.9.3\r\n\r\n        Cisco Jabber for MacOS Release  First Fixed Release          12.7 and earlier.  Migrate to a fixed release.      12.8  12.8.5      12.9  12.9.4\r\n\r\n        Cisco Jabber for Android and iOS Release  First Fixed Release          12.8 and earlier.  Migrate to a fixed release.      12.9  12.9.4\r\nThis table lists platforms affected by each Cisco Jabber security defect described in this advisory.\r\n        Cisco Jabber Release Platform  Affected Defects          Cisco Jabber for Windows  Affected by all defects.      Cisco Jabber for MacOS  Affected by defects CSCvw38030, CSCvv88490, and CSCvv88491.      Cisco Jabber for Android and iOS  Affected by defect CSCvw38030.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerabilities that are described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "CVE-2020-26085, CVE-2020-27127, CVE-2020-27132: Cisco would like to thank Olav Sortland Thoresen of Watchcom for reporting these vulnerabilities.\r\n\r\nCVE-2020-27133, CVE-2020-27134: These vulnerabilities were found during internal security testing.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Jabber Desktop and Mobile Client Software Vulnerabilities",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-jabber-ZktzjpgO"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "CSCvv88490",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvv88490"
			},
			{
				"category": "external",
				"summary": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H",
				"url": "https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&amp;vector=CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H"
			},
			{
				"category": "external",
				"summary": "CSCvw38030",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvw38030"
			},
			{
				"category": "external",
				"summary": "CVSS:3.0/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H",
				"url": "https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&amp;vector=CVSS:3.0/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H"
			},
			{
				"category": "external",
				"summary": "CSCvw39224",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvw39224"
			},
			{
				"category": "external",
				"summary": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
				"url": "https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&amp;vector=CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H"
			},
			{
				"category": "external",
				"summary": "CSCvv88491",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvv88491"
			},
			{
				"category": "external",
				"summary": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
				"url": "https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&amp;vector=CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N"
			},
			{
				"category": "external",
				"summary": "CSCvv88492",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvv88492"
			},
			{
				"category": "external",
				"summary": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
				"url": "https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&amp;vector=CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			}
		],
		"title": "Cisco Jabber Desktop and Mobile Client Software Vulnerabilities",
		"tracking": {
			"current_release_date": "2020-12-10T16:00:00+00:00",
			"generator": {
				"date": "2024-05-10T22:56:58+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-jabber-ZktzjpgO",
			"initial_release_date": "2020-12-10T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2020-12-07T19:03:57+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Jabber",
						"product": {
							"name": "Cisco Jabber ",
							"product_id": "CSAFPID-278016"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2020-26085",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvv88490"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-278016"
				]
			},
			"release_date": "2020-12-10T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-278016"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 9.9,
						"baseSeverity": "CRITICAL",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-278016"
					]
				}
			],
			"title": "Cisco Jabber for Windows Message Handling Arbitrary Code Execution Vulnerability"
		},
		{
			"cve": "CVE-2020-27127",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvv88492"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-278016"
				]
			},
			"release_date": "2020-12-10T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-278016"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 8.8,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-278016"
					]
				}
			],
			"title": "Cisco Jabber for Windows Custom Protocol Handler Command Injection Vulnerability"
		},
		{
			"cve": "CVE-2020-27133",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvw39224"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-278016"
				]
			},
			"release_date": "2020-12-10T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-278016"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 8.8,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-278016"
					]
				}
			],
			"title": "Cisco Jabber for Windows Protocol Handler Command Injection Vulnerability"
		},
		{
			"cve": "CVE-2020-27134",
			"notes": [
				{
					"category": "other",
					"text": "Not available.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"release_date": "2020-12-10T16:00:00+00:00",
			"title": "Cisco Jabber for Windows Message Handling Arbitrary Code Execution Vulnerability"
		},
		{
			"cve": "CVE-2020-27132",
			"notes": [
				{
					"category": "other",
					"text": "Not available.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"release_date": "2020-12-10T16:00:00+00:00",
			"title": "Cisco Jabber for Windows Information Disclosure Vulnerability"
		}
	]
}
