{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Cisco Unified MeetingPlace Web Conferencing is affected by two vulnerabilities:\n\r\n\r\n    Cisco Unified MeetingPlace Web Conferencing SQL Injection Vulnerability\r\n    Cisco Unified MeetingPlace Web Conferencing Buffer Overrun Vulnerability\r\n\r\n\n\r\nExploitation of the Cisco Unified MeetingPlace Web Conferencing SQL Injection Vulnerability may allow an unauthenticated, remote attacker to send Structured Query Language (SQL) commands to manipulate the MeetingPlace database stores information about server\r\nconfiguration, meetings, and users. These commands may be used to create,\r\ndelete, or alter some of the information in the Cisco Unified\r\nMeetingPlace Web Conferencing database.\n\r\n\n\r\nExploitation of the Cisco Unified MeetingPlace Web Conferencing Buffer Overrun Vulnerability may allow an unauthenticated, remote attacker to create a buffer overrun condition that may cause the Web Conferencing server to become unresponsive.\n\r\n\n\r\nCisco has released software updates that address these vulnerabilities. There are no workarounds that mitigate these vulnerabilities.\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121031-mp[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121031-mp\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "The following versions of Cisco Unified MeetingPlace Web Conferencing are vulnerable to Cisco Unified MeetingPlace Web Conferencing SQL Injection Vulnerability:\n\r\n\n\r\n\r\n    \r\n        \r\n            Version\r\n            \r\n            \r\n            Affected \r\n        \r\n        \r\n            \r\n            Prior to 7.0 \r\n            No \r\n        \r\n        \r\n            7.0 \r\n            Yes\r\n        \r\n        \r\n            7.1\r\n            Yes\r\n        \r\n        \r\n            8.0\r\n            Yes \r\n        \r\n        \r\n            8.5\r\n            Yes \r\n        \r\n    \r\n\r\n\n\r\n\n\r\nThe following versions of Cisco Unified MeetingPlace Web Conferencing are vulnerable to Cisco Unified MeetingPlace Web Conferencing Buffer Overrun Vulnerability:\n\r\n\n\r\n\r\n    \r\n        \r\n            Version\r\n            \r\n            \r\n            Affected \r\n        \r\n        \r\n            \r\n            Prior to 7.0 \r\n            Yes \r\n        \r\n        \r\n            7.0 \r\n            Yes\r\n        \r\n        \r\n            7.1\r\n            Yes\r\n        \r\n        \r\n            8.0\r\n            Yes \r\n        \r\n        \r\n            8.5\r\n            Yes \r\n        \r\n    \r\n\r\n\n\r\nNote: Cisco Unified MeetingPlace Web Conferencing versions prior to 7.0\r\nreached end of software maintenance. Customers running versions prior to\r\n7.0 should contact their Cisco support team for assistance in\r\nupgrading to a supported version of Cisco Unified MeetingPlace.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by these vulnerabilities.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The Cisco Unified MeetingPlace conferencing solution provides functionality that allows organizations to host integrated voice, video, and web conferencing. The solution is deployed on network and integrated directly into an organization's private voice/data networks and enterprise applications. Cisco Unified MeetingPlace servers can be deployed so that the server is accessible from the Internet, allowing external parties to participate in meetings.\n\r\n\n\r\nWeb Conferencing is a core component of the Cisco\r\nUnified MeetingPlace conferencing solution that allows users to share\r\napplications and presentations and manage meetings.\n\r\n\n\r\nCisco Unified MeetingPlace Web Conferencing SQL Injection Vulnerability\n\r\n\n\r\nThe Cisco Unified MeetingPlace Web Conferencing service contains a vulnerability that could allow an unauthenticated, remote attacker to inject Structured Query Language (SQL) commands, that may affect the integrity and availability of the data stored in the MeetingPlace Web Conferencing internal database. This data may include server configurations, meetings, and users. \n\r\nThe vulnerability is due to insufficient validation of some of the parameters passed through the HTTP POST method. An attacker could exploit this vulnerability by inserting malicious SQL commands in the HTTP POST request directed to the affected system. An exploit could allow the attacker to modify or delete data from the Web Conferencing database.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCtx08939[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCtx08939\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned Common Vulnerabilities and Exposures (CVE) ID CVE-2012-0337\n\r\n\n\r\nCisco Unified MeetingPlace Web Conferencing Buffer Overrun Vulnerability\n\r\n\n\r\nThe Cisco Unified MeetingPlace Web Conferencing service contains a vulnerability that could allow an unauthenticated, remote attacker to create a buffer overrun condition that may cause the Web Conferencing server to become unresponsive.\n\r\nThe vulnerability is due to insufficient validation of some parameter values of an HTTP POST request. An attacker may be able to exploit this vulnerability by crafting the value of the vulnerable parameters in an HTTP POST request directed to the affected system. An exploit could allow the attacker to cause the Web Conferencing server to become unresponsive.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCua66341[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCua66341\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned Common Vulnerabilities and Exposures (CVE) ID CVE-2012-5416",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "No workarounds are available to mitigate these vulnerabilities.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released software updates that address these vulnerabilities.\n\r\n\n\r\nThe following table contains the first fixed releases of software:\n\r\n\n\r\nCisco Unified MeetingPlace Web Conferencing SQL Injection Vulnerability\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n    \r\n        \r\n             Vulnerability\n\r\n            \r\n            Major Release\r\n            \r\n            \r\n            First Fix In \r\n        \r\n        \r\n             Cisco Unified MeetingPlace Web Conferencing SQL Injection Vulnerability - CSCtx08939\n\r\n            \r\n            \r\n            7.0 \r\n            7.1MR1\n\r\n            \r\n        \r\n        \r\n            7.1 \r\n            7.1MR1\r\n        \r\n        \r\n            8.0 \r\n             8.0MR1 Patch 1\n\r\n            \r\n        \r\n        \r\n            8.5 \r\n             8.5MR3\n\r\n            \r\n        \r\n    \r\n\r\n\r\n\n\r\nCisco Unified MeetingPlace Web Conferencing Buffer Overrun Vulnerability\r\n\r\n\r\n    \r\n        \r\n             Vulnerability\n\r\n            \r\n            Major Release\r\n            \r\n            \r\n            First Fix In \r\n        \r\n        \r\n             Cisco Unified MeetingPlace Web Conferencing Buffer Overrun Vulnerability - CSCua66341\n\r\n            \r\n            \r\n            7.0 \r\n            7.1MR1 Patch 1\n\r\n            \r\n        \r\n        \r\n            7.1 \r\n            7.1MR1 Patch 1\n\r\n            \r\n        \r\n        \r\n            8.0 \r\n             8.0MR1 Patch 1 \r\n        \r\n        \r\n            8.5 \r\n             8.5MR3 \r\n        \r\n    \r\n\r\n\r\n\r\n\r\n \r\nRecommended Releases\r\nThe following table lists all recommended releases. These recommended\r\nreleases contain the fixes for all vulnerabilities in this advisory.\r\nCisco recommends upgrading to a release that is equal to or later than\r\nthese recommended releases.\r\n\r\n\r\n    \r\n    \r\n    \r\n    \r\n        \r\n            \r\n            Major Release\r\n\r\n            \r\n            \r\n            Recommended Release\r\n\r\n            \r\n        \r\n        \r\n            7.0 \r\n            Migrate to 7.1MR1 Patch 1 \r\n        \r\n        \r\n            7.1 \r\n            7.1MR1 Patch 1\r\n        \r\n        \r\n            8.0\n\r\n            \r\n            8.0MR1 Patch 1 \r\n        \r\n        \r\n            8.5 \r\n            8.5MR3 \r\n        \r\n    \r\n\r\n\n\r\n\n\r\nWhen considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution.\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers. \n\r\n\n\r\n\r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \r\n\r\nCisco Unified MeetingPlace Web Conferencing SQL Injection Vulnerability was reported to Cisco by Daniel Mende from ERNW GmbH.\n\r\nCisco Unified MeetingPlace Web Conferencing Buffer Overrun Vulnerability was found during internal tests.\r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Multiple Vulnerabilities in Cisco Unified MeetingPlace Web Conferencing",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121031-mp"
			}
		],
		"title": "Multiple Vulnerabilities in Cisco Unified MeetingPlace Web Conferencing",
		"tracking": {
			"current_release_date": "2012-11-27T14:29:00+00:00",
			"generator": {
				"date": "2022-07-15T00:19:53+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20121031-mp",
			"initial_release_date": "2012-10-31T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2012-10-31T14:32:18+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2012-11-27T14:16:40+00:00",
					"number": "1.1.0",
					"summary": "Updated the \"Vulnerable Products\" section to indicate that versions prior to 7.0 are not affected by the SQL injection vulnerability."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Unified MeetingPlace Web Conferencing",
						"product": {
							"name": "Cisco Unified MeetingPlace Web Conferencing ",
							"product_id": "CSAFPID-186354"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2012-0337",
			"notes": [
				{
					"category": "other",
					"text": "CSCtx08939",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-186354"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified MeetingPlace Web Conferencing",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121031-mp"
				}
			],
			"remediations": [
				{
					"category": "workaround",
					"details": "No workarounds are available to mitigate these vulnerabilities."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 8.5,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:P/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-186354"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 8.5,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:P/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-186354"
					]
				}
			],
			"title": "Cisco Unified MeetingPlace Web Conferencing SQL Injection Vulnerability"
		},
		{
			"cve": "CVE-2012-5416",
			"notes": [
				{
					"category": "other",
					"text": "CSCua66341",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-186354"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified MeetingPlace Web Conferencing",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121031-mp"
				}
			],
			"release_date": "2012-09-11T12:13:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "No workarounds are available to mitigate these vulnerabilities."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-186354"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-186354"
					]
				}
			],
			"title": "Cisco Unified MeetingPlace Web Conferencing Buffer Overrun Vulnerability"
		}
	]
}
