{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "The Cisco WebEx Recording Format (WRF) player contains six buffer overflow vulnerabilities. In some cases, exploitation of the vulnerabilities could allow a remote attacker to execute arbitrary code on the system with the privileges of a targeted user. \n\r\n\n\r\nThe Cisco WebEx WRF Player is an application used to play back WRF WebEx meeting recordings that have been recorded on a WebEx meeting site or on the computer of an online meeting attendee. The Cisco WebEx WRF Player can be automatically installed when the user accesses a recording file that is hosted on a WebEx meeting site. The Cisco WebEx WRF Player can also be manually installed for offline playback after downloading the application from http://www.webex.com/play-webex-recording.html[\"http://www.webex.com/play-webex-recording.html\"].\n\r\n\n\r\nIf the Cisco WebEx WRF Player was automatically installed, it will be automatically upgraded to the latest, nonvulnerable version when users access a recording file that is hosted on a WebEx meeting site. If the Cisco WebEx WRF Player was manually installed, users will need to manually install a new version of the Cisco WebEx WRF Player after downloading the latest version from http://www.webex.com/play-webex-recording.html[\"http://www.webex.com/play-webex-recording.html\"].\n\r\n\n\r\nCisco has updated affected versions of the WebEx meeting sites and Cisco WebEx WRF Player to address these vulnerabilities. \n\r\n\n\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121010-webex[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121010-webex\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "\n",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "The vulnerabilities disclosed in this advisory affect the Cisco WebEx WRF Player. The following client builds of Cisco WebEx Business Suite (WBS 27 and WBS 28) are affected by at least one of the vulnerabilities that are described in this advisory:\n\r\n\r\n    T28 client builds prior to T28.4 (28.4)\r\n    T27 client builds prior to T27LDSP32EP10 (27.32.10)\r\n\r\nTo determine the WebEx client build, users can log in to their Cisco WebEx meeting site and navigate to the Support > Downloads section via the links on the left side of the page. The version of the WebEx client build will be displayed on the right side of the page. Cisco WebEx software updates are cumulative in client builds. For example, if client build 27.32.10 is fixed, build 27.32.11 will also contain the software update. Cisco WebEx site administrators have access to secondary version nomenclature, such as T27 SP32 EP10. Such an example indicates that the server is running client build 27.32.10.\n\r\n\n\r\n\r\nNote: Customers who do not receive automatic software updates may be running versions of Cisco WebEx that have reached end of software maintenance and should contact customer support.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by these vulnerabilities.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The WebEx meeting service is a hosted multimedia conferencing solution that is managed and maintained by Cisco WebEx. The WRF file format is used to store WebEx meeting recordings that have been recorded on a WebEx meeting site or on the computer of an online meeting attendee. The Cisco WebEx WRF Player is the application used to play back and edit WebEx WRF recording files, which use the .wrf extension. The Cisco WebEx WRF Player can be automatically installed when the user accesses a recording file that is hosted on a WebEx meeting site (for stream playback mode). The Cisco WebEx WRF Player can also be manually installed after downloading the application from http://www.webex.com/play-webex-recording.html[\"http://www.webex.com/play-webex-recording.html\"] to play back recording files locally (for offline playback mode).\n\r\n\n\r\nThe following table provides the Cisco bug IDs and Common Vulnerabilities and Exposures (CVE) identifiers that have been assigned for the vulnerabilities in this advisory:\n\r\n\n\r\n\r\n    \r\n        \r\n            Title\n\r\n            \r\n            CVE ID\n\r\n            \r\n            Cisco Bug ID\n\r\n            \r\n        \r\n        \r\n            Cisco WebEx Recording Format Player Buffer Overflow Vulnerability\r\n            CVE-2012-3936\n\r\n            \r\n            CSCua40962\n\r\n            \r\n        \r\n        \r\n            Cisco WebEx Recording Format Player Buffer Overflow Vulnerability\r\n            CVE-2012-3937\n\r\n            \r\n            CSCtz72967\n\r\n            \r\n        \r\n        \r\n            Cisco WebEx Recording Format Player Buffer Overflow Vulnerability\r\n            CVE-2012-3938\n\r\n            \r\n            CSCtz73583\n\r\n            \r\n        \r\n        \r\n            Cisco WebEx WRF Player Memory Corruption Vulnerability\r\n            CVE-2012-3939\n\r\n            \r\n            CSCua61331\n\r\n            \r\n        \r\n        \r\n            Cisco WebEx Recording Format Player Buffer Overflow Vulnerability\r\n            CVE-2012-3940\n\r\n            \r\n            CSCtz72958\n\r\n            \r\n        \r\n        \r\n            Cisco WebEx Recording Format Player Heap Overflow Vulnerability\n\r\n            \r\n            CVE-2012-3941\n\r\n            \r\n            CSCtz72850\r\n        \r\n    \r\n\r\n\n\r\n\r\nExploitation of the vulnerabilities may cause the Cisco WebEx WRF Player application to crash or, in some cases, result in remote code execution.\n\r\n\n\r\nTo exploit one of these vulnerabilities, the Cisco WebEx WRF Player application must open a malicious WRF file. An attacker may be able to accomplish this exploit by providing the malicious recording file directly to users (for example, by using e-mail) or by directing a user to a malicious web page. Users who are attending a WebEx meeting cannot trigger the vulnerabilities.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "While there are no workarounds for the vulnerabilities detailed in this advisory, it is possible to remove all WebEx software completely from a system using the Meeting Services Removal Tool (for Microsoft Windows users) or Mac Cisco-WebEx Uninstaller (for Apple Mac users) available at http://support.webex.com/support/downloads.html[\"http://support.webex.com/support/downloads.html\"]. Removal of WebEx software from a Linux or UNIX-based system can be accomplished by following the steps in the WebEx knowledge base help article at the following link: https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#[\"https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#\"].\n\r\n",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, contact the Cisco Technical Assistance Center (TAC) or your contracted maintenance providers. \n\r\n\n\r\nThe following client builds of Cisco WebEx Business Suite (WBS 27 and WBS 28) correct the vulnerabilities described in this advisory:\r\n\r\n\r\n    Client builds 28.4 (T28.4)\r\n    Client builds 27.32.10 (T27LDSP32EP10)\r\n\r\nClient builds prior to T27 SP32 have reached end of support; to obtain fixed software please upgrade to the latest version.\r\n\r\nTo determine the WebEx client build, users can log in to their Cisco WebEx meeting site and navigate to the Support > Downloads section via the links on the left side of the page. The version of the WebEx client build will be displayed on the right side of the page. Cisco WebEx software updates are cumulative in client builds. For example, if client build 27.32.10 is fixed, build 27.32.11 will also contain the software update.\r\n\r\nThe Microsoft Windows, Apple Mac OS X, and Linux versions of the Cisco WebEx WRF Player are all affected. If the Cisco WebEx WRF Player was automatically installed, it will be automatically upgraded to the latest, nonvulnerable version when users access a recording file that is hosted on a WebEx meeting site. If the Cisco WebEx WRF Player was manually installed, users must download the latest version from http://www.webex.com/play-webex-recording.html[\"http://www.webex.com/play-webex-recording.html\"] and install it. \r\n\r\nUsers can determine whether a Cisco WebEx WRF Player is affected by these vulnerabilities by manually verifying the installed version. To do so, users can examine the file version and determine whether it contains the fixed code.\r\n\r\nMicrosoft Windows\r\n\r\nFive dynamic link libraries (DLLs) were updated on the Microsoft Windows platform to address the vulnerabilities that are described in this advisory. These files are in the C:\\Program Files\\WebEx\\Record Playback folder or the C:\\Program Files (x86)\\Webex\\Record Player folder. The version number of a DLL can be obtained by browsing the Record Playback directory in Windows Explorer, right-clicking the filename, and choosing Properties. The Version or Details tab of the Properties page provides details on the library version. The following table provides the first fixed version for each DLL. If the installed versions are equal to or greater than the versions provided in the table, the system is not vulnerable.\r\n\r\n\r\n    \r\n        \r\n            Client Build\r\n            Cisco DLL Filename\r\n            DLL File Versions\r\n        \r\n        \r\n            28.4\r\n            atas32.dll\n\r\n            \r\n            28,400,12,629\n\r\n            \r\n        \r\n        \r\n            28.4\r\n            atas32_lite.dll\n\r\n            \r\n            28,400,112,629\n\r\n            \r\n        \r\n        \r\n            28.4\r\n            atrecply.dll\n\r\n            \r\n            2028,1204,600,700\n\r\n            \r\n        \r\n        \r\n            28.4\r\n            atrpui.dll\n\r\n            \r\n            2028,1204,700,1300\n\r\n            \r\n        \r\n        \r\n            28.4\r\n            atdl2006\n\r\n            \r\n            1028,1204,500,2400\n\r\n            \r\n        \r\n        \r\n            27.32.10\r\n            atas32.dll\n\r\n            \r\n            2,6,32,4\n\r\n            \r\n        \r\n        \r\n            27.32.10\n\r\n            \r\n            atas32_lite.dll\n\r\n            \r\n            2,6,32,104\n\r\n            \r\n        \r\n        \r\n            27.32.10\n\r\n            \r\n            atrecply.dll\n\r\n            \r\n            2027,1232,610,2600\n\r\n            \r\n        \r\n        \r\n            27.32.10\n\r\n            \r\n            atrpui.dll\n\r\n            \r\n            2027,1232, 610,2600\n\r\n            \r\n        \r\n        \r\n            27.32.10\n\r\n            \r\n            atdl2006\n\r\n            \r\n            1027,1232,710,1200\n\r\n            \r\n        \r\n    \r\n\r\nApple Mac\r\n\r\nFour package bundles were updated on the Apple Mac OS platform to address the vulnerabilities that are described in this advisory. This file is in each user's home directory and can be accessed from ~/Library/Application Support/WebEx Folder/924. The version can be obtained by browsing to the appropriate folder in Finder and control-clicking the filename. When the menu is displayed, choose show package contents and then double-click the Info.plist file. The version number is shown at the bottom of the displayed table. The following table provides the first fixed version for each package bundle. If the installed versions are equal to or greater than the versions provided in the table, the system is not vulnerable.\r\n\r\n\r\n    \r\n        \r\n            Client Build\r\n            Cisco Bundle Filename\r\n            Bundle File Versions\r\n        \r\n        \r\n            28.4\r\n            atas.bundle\n\r\n            \r\n            1207,25,2804,0\n\r\n            \r\n        \r\n        \r\n            28.4\t\n\r\n            \r\n            asplayback.bundle\n\r\n            \r\n            1206,26,2804,0\n\r\n            \r\n        \r\n        \r\n            28.4\t\n\r\n            \r\n            as.bundle\n\r\n            \r\n            1206,29,2804,0\n\r\n            \r\n        \r\n        \r\n            28.4\r\n            WebEx Player.app\r\n            1206,20,2804,0\n\r\n            \r\n        \r\n        \r\n            27.32.10\r\n            atas.bundle\n\r\n            \r\n            1206.28.2732.10\n\r\n            \r\n        \r\n        \r\n            27.32.10\r\n            asplayback.bundle \r\n            1206.28.2732.10\n\r\n            \r\n        \r\n        \r\n            27.32.10\r\n            as.bundle\n\r\n            \r\n            1206.28.2732.10 \r\n        \r\n        \r\n            27.32.10\r\n            WebEx Player.app\n\r\n            \r\n            1206.28.2732.10\n\r\n            \r\n        \r\n    \r\n\r\nLinux\r\n\r\nThree shared objects were updated on the Linux platform to address the vulnerabilities that are described in this advisory. These files are in the ~/.webex directory. The version number of the shared objects can be obtained by performing a directory listing with the ls command. The version number is provided after the .so extension. The following table provides the first fixed version for each shared object. If the installed versions are equal to or greater than the versions provided in the table, the system is not vulnerable.\n\r\n\n\r\n\r\n\r\n\r\n    \r\n        \r\n            Client Build\r\n            Cisco Shared Object Filename\r\n            Shared Object File Versions\r\n        \r\n        \r\n            28.4\r\n            atascli.so\n\r\n            \r\n            1,0,28,18\n\r\n            \r\n        \r\n        \r\n            28.4\r\n            libnbrascli.so\n\r\n            \r\n            1.0.28.17\n\r\n            \r\n        \r\n        \r\n            28.4\r\n            atascli.so (used by meeting client)\n\r\n            \r\n            922800025\n\r\n            \r\n        \r\n        \r\n            27.32.10\r\n            atascli.so\n\r\n            \r\n            1.29.27.27\n\r\n            \r\n        \r\n        \r\n            27.32.10\r\n            libnbrascli.so\n\r\n            \r\n            1.29.27.22\n\r\n            \r\n        \r\n        \r\n            27.32.10\r\n            atascli.so (used by meeting client)\n\r\n            \r\n            922729007\r\n        \r\n    \r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerabilities that are described in this advisory. \r\n\r\nThese vulnerabilities were reported to Cisco by Beyond Security, Core Security, Codenomicon, and TELUS.\r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Multiple Vulnerabilities in the Cisco WebEx Recording Format Player",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121010-webex"
			}
		],
		"title": "Multiple Vulnerabilities in the Cisco WebEx Recording Format Player",
		"tracking": {
			"current_release_date": "2012-10-10T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:20:25+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20121010-webex",
			"initial_release_date": "2012-10-10T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2012-10-10T14:04:59+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco WebEx Event Center",
						"product": {
							"name": "Cisco WebEx Event Center ",
							"product_id": "CSAFPID-97148"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Meeting Center",
						"product": {
							"name": "Cisco WebEx Meeting Center ",
							"product_id": "CSAFPID-97151"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Sales Center",
						"product": {
							"name": "Cisco WebEx Sales Center ",
							"product_id": "CSAFPID-97160"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Support Center",
						"product": {
							"name": "Cisco WebEx Support Center ",
							"product_id": "CSAFPID-97163"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco WebEx Training Center",
						"product": {
							"name": "Cisco WebEx Training Center ",
							"product_id": "CSAFPID-97166"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2012-3937",
			"notes": [
				{
					"category": "other",
					"text": "CSCtz72967",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-97148",
					"CSAFPID-97151",
					"CSAFPID-97160",
					"CSAFPID-97163",
					"CSAFPID-97166"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in the Cisco WebEx Recording Format Player",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121010-webex"
				}
			],
			"release_date": "2012-09-12T22:08:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "While there are no workarounds for the vulnerabilities detailed in this advisory, it is possible to remove all WebEx software completely from a system using the Meeting Services Removal Tool (for Microsoft Windows users) or Mac Cisco-WebEx Uninstaller (for Apple Mac users) available at http://support.webex.com/support/downloads.html[\"http://support.webex.com/support/downloads.html\"]. Removal of WebEx software from a Linux or UNIX-based system can be accomplished by following the steps in the WebEx knowledge base help article at the following link: https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#[\"https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#\"].\n\r\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				}
			],
			"title": "Cisco WebEx Recording Format Player Buffer Overflow Vulnerability"
		},
		{
			"cve": "CVE-2012-3936",
			"notes": [
				{
					"category": "other",
					"text": "CSCua40962",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-97148",
					"CSAFPID-97151",
					"CSAFPID-97160",
					"CSAFPID-97163",
					"CSAFPID-97166"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in the Cisco WebEx Recording Format Player",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121010-webex"
				}
			],
			"release_date": "2012-09-12T22:25:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "While there are no workarounds for the vulnerabilities detailed in this advisory, it is possible to remove all WebEx software completely from a system using the Meeting Services Removal Tool (for Microsoft Windows users) or Mac Cisco-WebEx Uninstaller (for Apple Mac users) available at http://support.webex.com/support/downloads.html[\"http://support.webex.com/support/downloads.html\"]. Removal of WebEx software from a Linux or UNIX-based system can be accomplished by following the steps in the WebEx knowledge base help article at the following link: https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#[\"https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#\"].\n\r\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:POC/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:POC/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				}
			],
			"title": "Cisco WebEx Recording Format Player Buffer Overflow Vulnerability"
		},
		{
			"cve": "CVE-2012-3938",
			"notes": [
				{
					"category": "other",
					"text": "CSCtz73583",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-97148",
					"CSAFPID-97151",
					"CSAFPID-97160",
					"CSAFPID-97163",
					"CSAFPID-97166"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in the Cisco WebEx Recording Format Player",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121010-webex"
				}
			],
			"release_date": "2012-09-12T22:56:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "While there are no workarounds for the vulnerabilities detailed in this advisory, it is possible to remove all WebEx software completely from a system using the Meeting Services Removal Tool (for Microsoft Windows users) or Mac Cisco-WebEx Uninstaller (for Apple Mac users) available at http://support.webex.com/support/downloads.html[\"http://support.webex.com/support/downloads.html\"]. Removal of WebEx software from a Linux or UNIX-based system can be accomplished by following the steps in the WebEx knowledge base help article at the following link: https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#[\"https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#\"].\n\r\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				}
			],
			"title": "Cisco WebEx Recording Format Player Buffer Overflow Vulnerability"
		},
		{
			"cve": "CVE-2012-3939",
			"notes": [
				{
					"category": "other",
					"text": "CSCua61331",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-97148",
					"CSAFPID-97151",
					"CSAFPID-97160",
					"CSAFPID-97163",
					"CSAFPID-97166"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in the Cisco WebEx Recording Format Player",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121010-webex"
				}
			],
			"release_date": "2012-09-12T23:11:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "While there are no workarounds for the vulnerabilities detailed in this advisory, it is possible to remove all WebEx software completely from a system using the Meeting Services Removal Tool (for Microsoft Windows users) or Mac Cisco-WebEx Uninstaller (for Apple Mac users) available at http://support.webex.com/support/downloads.html[\"http://support.webex.com/support/downloads.html\"]. Removal of WebEx software from a Linux or UNIX-based system can be accomplished by following the steps in the WebEx knowledge base help article at the following link: https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#[\"https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#\"].\n\r\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				}
			],
			"title": "Cisco WebEx WRF Player Memory Corruption Vulnerability"
		},
		{
			"cve": "CVE-2012-3940",
			"notes": [
				{
					"category": "other",
					"text": "CSCtz72958",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-97148",
					"CSAFPID-97151",
					"CSAFPID-97160",
					"CSAFPID-97163",
					"CSAFPID-97166"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in the Cisco WebEx Recording Format Player",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121010-webex"
				}
			],
			"release_date": "2012-09-12T23:38:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "While there are no workarounds for the vulnerabilities detailed in this advisory, it is possible to remove all WebEx software completely from a system using the Meeting Services Removal Tool (for Microsoft Windows users) or Mac Cisco-WebEx Uninstaller (for Apple Mac users) available at http://support.webex.com/support/downloads.html[\"http://support.webex.com/support/downloads.html\"]. Removal of WebEx software from a Linux or UNIX-based system can be accomplished by following the steps in the WebEx knowledge base help article at the following link: https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#[\"https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#\"].\n\r\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				}
			],
			"title": "Cisco WebEx Recording Format Player Buffer Overflow Vulnerability"
		},
		{
			"cve": "CVE-2012-3941",
			"notes": [
				{
					"category": "other",
					"text": "CSCtz72850",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-97148",
					"CSAFPID-97151",
					"CSAFPID-97160",
					"CSAFPID-97163",
					"CSAFPID-97166"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in the Cisco WebEx Recording Format Player",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121010-webex"
				}
			],
			"release_date": "2012-09-12T23:42:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "While there are no workarounds for the vulnerabilities detailed in this advisory, it is possible to remove all WebEx software completely from a system using the Meeting Services Removal Tool (for Microsoft Windows users) or Mac Cisco-WebEx Uninstaller (for Apple Mac users) available at http://support.webex.com/support/downloads.html[\"http://support.webex.com/support/downloads.html\"]. Removal of WebEx software from a Linux or UNIX-based system can be accomplished by following the steps in the WebEx knowledge base help article at the following link: https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#[\"https://support.webex.com/MyAccountWeb/knowledgeBase.do?root=Tools&parent=Knowledge&articleId=WBX28548&txtSearchQuery=uninstall%20linux#\"].\n\r\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 9.3,
						"vectorString": "AV:N/AC:M/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-97148",
						"CSAFPID-97151",
						"CSAFPID-97160",
						"CSAFPID-97163",
						"CSAFPID-97166"
					]
				}
			],
			"title": "Cisco WebEx Recording Format Player Heap Overflow Vulnerability"
		}
	]
}
