{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Cisco Secure Access Control System (ACS) contains a vulnerability that could allow an\r\nunauthenticated, remote attacker to bypass TACACS+ based authentication\r\nservice offered by the affected product. The vulnerability is due to improper validation of the user-supplied password when TACACS+ is the authentication protocol and Cisco Secure ACS is configured with a Lightweight Directory Access Protocol (LDAP) external identity store.\n\r\n\n\r\nAn attacker may exploit this vulnerability by sending a special sequence of\r\ncharacters when prompted for the user password. The attacker would need to know a valid username stored in the LDAP external identity store to exploit this\r\nvulnerability, and the exploitation is limited to impersonate only that user. An exploit could allow the attacker to successfully authenticate to any system using TACACS+ in combination with an affected Cisco Secure ACS.\n\r\n\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds for this vulnerability.\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121107-acs[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121107-acs\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": " The following Cisco Secure ACS versions are affected by this\r\nvulnerability:\r\n\r\n\r\n\r\n\r\n    \r\n        \r\n            Cisco Secure ACS Version \r\n            Affected\r\n        \r\n        \r\n            5.0\r\n            Yes\r\n        \r\n        \r\n            5.1\n\r\n            \r\n            Yes\r\n        \r\n        \r\n            5.2\n\r\n            \r\n            Yes \r\n        \r\n        \r\n            5.3 \n\r\n            \r\n            Yes\r\n        \r\n        \r\n            5.4 \n\r\n            \r\n            No \n\r\n            \r\n        \r\n    \r\n\r\n\n\r\nThe previous list applies to both the hardware appliance and the\r\nsoftware-only versions of the product.\r\n\r\nThe following methods can be used to determine which version of the\r\nCisco Secure ACS is installed:\r\n\r\n\r\n    \r\n    From the Cisco Secure ACS command-line interface (CLI), issue the\r\n    show version command, as shown in the following\r\n    example:\n\r\n    \r\n    acs51a/admin# show version\r\n\r\nCisco Application Deployment Engine OS Release: 1.2\r\nADE-OS Build Version: 1.2.0.152\r\nADE-OS System Architecture: i386\r\n\r\nCopyright (c) 2005-2009 by Cisco Systems, Inc.\r\nAll rights reserved.\r\nHostname: acs51a\r\n\r\n\r\nVersion information of installed applications\r\n---------------------------------------------\r\n\r\n \r\nCisco ACS VERSION INFORMATION\r\n-----------------------------\r\nVersion : 5.1.0.44.6\r\nInternal Build ID : B.2347\r\nPatches : \r\n5-1-0-44-3\r\n5-1-0-44-6\r\n\r\nacs51a/admin#\r\n     \r\n    \r\n    On the main login page of the Cisco Secure ACS web-based interface,\r\n    the version information is displayed on the left side of the screen.\r\n    \r\n    From the Cisco Secure ACS web-based interface, log in and click the\r\n    About link at the top right corner of the screen.\r\n\r\nCisco Secure ACS version 5.1 will identify itself as version\r\n5.1.0.44, Cisco Secure ACS version 5.2 will identify\r\nitself as version 5.2.0.26 and Cisco Secure ACS version 5.3 will identify\r\nitself as version 5.3.0.40. The presence of an additional\r\ndigit after the version number indicates the highest patch level installed. For\r\nexample, a version number of 5.1.0.44.3 indicates Cisco Secure\r\nACS version 5.1 with up to patch 3 installed. The absence of any additional\r\ndigit after the version string indicates a Cisco Secure ACS version with no\r\npatches installed. The example above shows a Cisco Secure ACS running version 5.1 Patch 6.\r\n\r\n\r\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "The following Cisco Secure ACS products are not affected by this vulnerability:\n\r\n\r\n    Cisco Secure Access Control Server for Windows\r\n    Cisco Secure Access Control Server Express\r\n    Cisco Secure Access Control Server View\r\n    Cisco Secure Access Control Server Solution Engine\r\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco Secure Access Control System (ACS) operates as a centralized RADIUS and TACACS+ server,\r\ncombining user authentication, user and administrator device access control,\r\nand policy control into a centralized identity networking solution.\n\r\n\n\r\nCisco Secure ACS provides authentication, authorization, and accounting (AAA) services to network devices and other clients by using the Cisco Secure ACS network resource repositories and identity stores. The identity stores can be internal or external. An internal identity store has user credentials information stored in an internal database. In an external identity store, Cisco Secure ACS will retrieve information from an external database.\n\r\n\n\r\nCisco Secure Access Control System (ACS) contains a vulnerability that could allow an\r\nunauthenticated, remote attacker to bypass the TACACS+ based authentication\r\nservice offered by the affected product.\n\r\n\n\r\nThe vulnerability is due to improper validation of the user-supplied password when TACACS+ is as authentication protocol and Cisco\r\nSecure ACS is configured with a Lightweight Directory Access Protocol\r\n(LDAP) external identity store.\n\r\nAn attacker could exploit this vulnerability by sending a special sequence\r\nof\r\ncharacters when prompted for the user password. The attacker would need to know a valid username stored in the LDAP external\r\nidentity store in order to exploit this\r\nvulnerability, and the exploitation is limited to impersonate only that user. An exploit could allow the attacker to successfully authenticate\r\nto any system using TACACS+ in combination with an affected Cisco Secure\r\nACS.\n\r\n\n\r\nNote: Only a Cisco Secure ACS that is configured for TACACS+ authentication and uses LDAP as the external identity store is vulnerable.\n\r\nA Cisco Secure ACS used for authentication service in combination with other supported protocols, such as RADIUS, or TACACS+ used in combination with an internal identity store or other external stores (for example, RADIUS Identity Server, Active Directory,\r\nand RSA SecurID Token Server),\r\n\r\n\r\nis not vulnerable. \n\r\n\n\r\nSuccessful exploitation of this vulnerability could allow the  attacker to bypass the\r\nauthentication of any system that uses TACACS+ and relies on the authentication service provided by an\r\naffected Cisco Secure ACS. However, the attacker will not be able to gain unauthorized access to the management interface of the Cisco Secure ACS.\n\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCuc65634[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuc65634\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only)\r\n\r\n[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCtl77440\"]and has been assigned\r\nthe CVE identifier CVE-2012-5424.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There is no workaround for this vulnerability. If possible, disable anonymous\r\nbinding on the LDAP external identity store or use Active Directory external\r\nidentity store to help prevent exploitation of this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "The following table provides software upgrade information to mitigate the vulnerability described in this security\r\nadvisory:\n\r\n\n\r\n\r\n    \r\n        \r\n            Cisco Secure ACS Version\n\r\n            \r\n            Fixed Release\n\r\n            \r\n        \r\n        \r\n            5.0\r\n            Migrate to 5.2 Patch 11 \r\n        \r\n        \r\n            5.1\n\r\n            \r\n            Migrate to 5.2 Patch 11 \r\n        \r\n        \r\n            5.2\n\r\n            \r\n            5.2 Patch 11\n\r\n            \r\n        \r\n        \r\n            5.3 \n\r\n            \r\n            5.3 Patch 7 \r\n        \r\n    \r\n\r\n\n\r\nWhen considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \r\n\r\nIn all cases, customers should ensure that the devices to be upgraded\r\ncontain sufficient memory and  confirm that current hardware and\r\nsoftware configurations will continue to be supported properly by the\r\nnew release. If the information is not clear, customers are advised to\r\ncontact the Cisco Technical Assistance Center (TAC) or their contracted\r\nmaintenance providers. \r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \n\r\n\n\r\nThis vulnerability was discovered during the resolution of a support case.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Secure Access Control System TACACS+ Authentication Bypass Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121107-acs"
			}
		],
		"title": "Cisco Secure Access Control System TACACS+ Authentication Bypass Vulnerability",
		"tracking": {
			"current_release_date": "2012-11-07T16:21:00+00:00",
			"generator": {
				"date": "2022-07-15T00:20:29+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20121107-acs",
			"initial_release_date": "2012-11-07T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2012-11-07T15:31:00+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Secure Access Control System (ACS)",
						"product": {
							"name": "Cisco Secure Access Control System (ACS) ",
							"product_id": "CSAFPID-2074"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2012-5424",
			"notes": [
				{
					"category": "other",
					"text": "CSCuc65634",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-2074"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Secure Access Control System TACACS+ Authentication Bypass Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20121107-acs"
				}
			],
			"release_date": "2012-10-19T12:17:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There is no workaround for this vulnerability. If possible, disable anonymous\r\nbinding on the LDAP external identity store or use Active Directory external\r\nidentity store to help prevent exploitation of this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 5,
						"vectorString": "AV:N/AC:L/Au:N/C:P/I:N/A:N/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-2074"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 5,
						"vectorString": "AV:N/AC:L/Au:N/C:P/I:N/A:N/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-2074"
					]
				}
			],
			"title": "Cisco Secure ACS TACACS+ Authentication Bypass Vulnerability"
		}
	]
}
