{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "The Cisco IOS IP Service Level Agreement (IP SLA) feature contains a  denial of service (DoS) vulnerability. The vulnerability is triggered when  malformed UDP packets are sent to a vulnerable device. The vulnerable UDP port  numbers depend on the device configuration. Default ports are not used for the  vulnerable UDP IP SLA operation or for the UDP responder ports.\r\n\r\nCisco has released software updates that address this vulnerability.\r\n\r\nThis advisory is posted at  http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla\"].\r\n\r\n  Note: The September 28, 2011, Cisco IOS Software  Security Advisory bundled publication includes ten Cisco Security Advisories.  Nine of the advisories address vulnerabilities in Cisco IOS Software, and one  advisory addresses vulnerabilities in Cisco Unified Communications Manager.  Each advisory lists the Cisco IOS Software releases that correct the  vulnerability or vulnerabilities detailed in the advisory as well as the Cisco  IOS Software releases that correct all vulnerabilities in the September 2011  Bundled Publication.\r\n\r\n Individual publication links are in \"Cisco Event Response:  Semiannual Cisco IOS Software Security Advisory Bundled Publication\" at the  following link:\r\n\r\n  http://www.cisco.com/web/about/security/intelligence/Cisco_ERP_sep11.html [\"http://www.cisco.com/web/about/security/intelligence/Cisco_ERP_sep11.html\"]\r\n\r\n [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco devices that are running Cisco IOS Software are vulnerable when  they are configured for IP SLA, either as responders or as originators of  vulnerable IP SLA operations.\r\n\r\nTo determine the Cisco IOS Software release that is running on a Cisco  product, administrators can log in to the device and issue the  show version command to display the system banner.  The system banner confirms that the device is running Cisco IOS Software by  displaying text similar to \"Cisco Internetwork Operating System Software\" or  \"Cisco IOS Software.\" The image name displays in parentheses, followed by  \"Version\" and the Cisco IOS Software release name. Other Cisco devices do not  have the show version command or may provide  different output.\r\n\r\nThe following example shows output from a device that runs a Cisco IOS  Software image:\r\n\r\n\r\nRouter> show version\r\nCisco IOS Software, C3900 Software (C3900-UNIVERSALK9-M), Version 15.0(1)M1, RELEASE SOFTWARE (fc1)  Technical Support: http://www.cisco.com/techsupport  Copyright (c) 1986-2009 by Cisco Systems, Inc.  Compiled Wed 02-Dec-09 17:17 by prod_rel_team      !--- output truncated\r\n\r\nAdditional information about Cisco IOS Software release naming  conventions is available in the white paper Cisco IOS and NX-OS  Software Reference Guide available at:    http://www.cisco.com/web/about/security/intelligence/ios-ref.html [\"http://www.cisco.com/web/about/security/intelligence/ios-ref.html\"].",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by these vulnerabilities.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "IP SLA is an embedded agent in Cisco IOS Software designed to measure  and monitor common network performance metrics like jitter, latency (delay),  and packet loss.\r\n\r\nThe vulnerability that is described in this document is triggered by  malformed IP SLA packets sent to the  vulnerable device and port. A vulnerable device can be an IP SLA responder or  the source device of a vulnerable IP SLA operation.\r\n\r\nThis vulnerability is documented in Cisco bug ID    CSCtk67073   [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCtk67073\"]  (  registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)  and has been assigned  Common Vulnerabilities and Exposures (CVE) ID CVE-2011-3272.\r\n  Vulnerable IP SLA Responder Configurations\r\nA device configured either as an IP SLA general responder or a  permanent IP SLA UDP responder is vulnerable.\r\n\r\nThe general responder processes IP SLA control protocol packets on UDP  port 1967 and then may dynamically open vulnerable UDP ports according to the  IP SLA operations requested using the control protocol. The configuration for a  general responder is as follows:\r\n\r\n\r\nip sla responder\r\n\r\n\r\nThe IP SLA UDP permanent responder is also vulnerable. An example  configuration is as follows:\r\n\r\n\r\nip sla responder udp-echo port 300\r\n\r\nThere is no default UDP port number for the UDP permanent responder\r\n\r\nAlternatively, both the general responder and the permanent responder  can be identified with the show ip sla responder  command. The  general responder is vulnerable when it has been enabled. The permanent  responder is vulnerable only when it has been enabled and the \"udpEcho  Responder\" is present. In the Following example, the general responder is not  vulnerable because it has not been enabled but the permanent responder is  vulnerable because it has been enabled with a UDP echo responder:\r\n\r\n\r\nRouter# show ip sla responder\r\n        General IP SLA Responder on Control port 1967  General IP SLA Responder is: Disabled            Permanent Port IP SLA Responder  Permanent Port IP SLA Responder is: Enabled    udpEcho Responder:     IP Address             Port    0.0.0.0                 300\r\n    Vulnerable IP SLA Source Device Configurations\r\nAn IP SLA source device is a Cisco IOS device that has at least one IP  SLA operation configured. To be vulnerable a probe originator needs to have at  least one scheduled probe that uses either of the following IP SLA  operations:\r\n\r\n      udp-jitter probe\r\n      udp-echo\r\n\r\nA vulnerable IP SLA source device configuration includes all the  following commands:\r\n\r\n      An ip sla global configuration command to define an      IP SLA operation\r\n      Either a udp-echo or a udp-jitter      IP SLA configuration command\r\n      An  ip sla schedule global configuration command      that activates one of the probes that uses a vulnerable IP SLA operation\r\n\r\nThe following examples show a source device that is configured for IP  SLA UDP echo and UDP jitter probes:\r\n\r\n\r\nip sla 201\r\n udp-echo 192.168.134.21 201  ip sla schedule 201 start-time now    ip sla 301   udp-jitter 192.168.134.121 122  ip sla schedule 301 start-time now\r\n\r\nThe destination UDP ports for the probes need to be configured. If the  source UDP port is not configured an available port number will be used when  the probe is started. A device that originates a vulnerable operation will be  vulnerable on the source UDP ports of the probe and a responder will be  vulnerable on the destination UDP port used for the probe.\r\n\r\nIP SLA probes can be configured using Simple Network Management  Protocol (SNMP). In that case, by default, the output of the show  running-config command will not include the IP SLA probe  configuration. The show ip sla configuration command can be  used to verify whether a probe has been configured either by the command line  or via SNMP.\r\n\r\nRouter# show ip sla configuration | include operation\r\nType of operation to perform: udp-jitter",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds for this vulnerability, but there are  mitigations that can be deployed on a general IP SLA responder to reduce the  exposure to this vulnerability.\r\n  General IP SLA Responder Mitigation\r\nFor devices that are configured as general responders, a mitigation is  to restrict IP SLA control packets on UDP port 1967 that are addressed to the  vulnerable device to permit only trusted probe originators to open UDP ports  that could be exploited. This can be accomplished using techniques such as  Infrastructure Access list or Control Plane Protection.\r\n\r\nFor devices configured as general responders, mitigation techniques  that can be deployed on Cisco devices within the network are available in the  Cisco Applied Mitigation Bulletin companion document for this advisory:    http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20110928-ipsla. [\"http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20110928-ipsla\"]\r\n\r\n [\"http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20110928-ipsla\"]\r\n  IP SLA Permanent Responder Mitigation\r\nFor the permanent responder, the mitigation is to filter UDP packets  addressed to the configured UDP port of each permanent responder to permit  packets from the IP addresses of trusted devices.\r\n  IP SLA Source Devices Mitigation\r\nFor IP SLA source devices, a mitigation is to allow only UDP packets  from trusted devices (that is, devices that are the target of IP SLA  operations)",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, also consult  http://www.cisco.com/go/psirt [\"http://www.cisco.com/go/psirt\"]  and any subsequent advisories to determine exposure and a complete upgrade  solution.\r\n\r\nIn all cases, customers should exercise caution to be  certain the devices to be upgraded contain sufficient memory and that current  hardware and software configurations will continue to be supported properly by  the new release. If the information is not clear, contact the Cisco Technical  Assistance Center (TAC) or your contracted maintenance provider for assistance.\r\n\r\nAdditionally, the Cisco IOS Software Checker is available on the Cisco  Cisco Security (SIO) portal at  http://tools.cisco.com/security/center/selectIOSVersion.x [\"http://tools.cisco.com/security/center/selectIOSVersion.x\"].  It provides several features for checking which Security Advisories affect  specified versions of Cisco IOS Software.\r\n  Cisco IOS Software\r\nEach row of the following Cisco IOS Software table corresponds to a  Cisco IOS Software train. If a particular train is vulnerable, the earliest  releases that contain the fix are listed in the First Fixed Release For This  Advisory column. The First Fixed Release for All Advisories in the September  2011 Bundled Publication column lists the earliest possible releases that  correct all the published vulnerabilities in the Cisco IOS Software Security  Advisory bundled publication. Cisco recommends upgrading to the latest  available release, where possible.\r\n\r\n               Major Release\r\n\r\n                   Availability of Repaired              Releases\r\n\r\n              Affected 12.0-Based Releases\r\n\r\n              First Fixed Release\r\n\r\n              First Fixed Release for All Advisories in the September              2011 Bundled Publication\r\n\r\nThere are no affected 12.0-based releases\r\n\r\n              Affected 12.1-Based Releases\r\n\r\n              First Fixed Release\r\n\r\n              First Fixed Release for All Advisories in the September              2011 Bundled Publication\r\n\r\nThere are no affected 12.1-based releases\r\n\r\n              Affected 12.2-Based Releases\r\n\r\n              First Fixed Release\r\n\r\n              First Fixed Release for All Advisories in the September              2011 Bundled Publication\r\n\r\nThere are no affected 12.2-based releases\r\n\r\n              Affected 12.3-Based Releases\r\n\r\n              First Fixed Release\r\n\r\n              First Fixed Release for All Advisories in the September              2011 Bundled Publication\r\n\r\nThere are no affected 12.3-based releases\r\n\r\n              Affected 12.4-Based Releases\r\n\r\n              First Fixed Release\r\n\r\n              First Fixed Release for All Advisories in the September              2011 Bundled Publication\r\n\r\nThere are no affected 12.4-based releases\r\n\r\n              Affected 15.0-Based Releases\r\n\r\n              First Fixed Release\r\n\r\n              First Fixed Release for All Advisories in the September              2011 Bundled Publication\r\n\r\nThere are no affected 15.0-based releases\r\n\r\n              Affected 15.1-Based Releases\r\n\r\n              First Fixed Release\r\n\r\n              First Fixed Release for All Advisories in the September              2011 Bundled Publication\r\n\r\n 15.1EY\r\n\r\nNot vulnerable\r\n\r\nVulnerable; contact your support organization per the              instructions in the Obtaining Fixed Software [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla#fixes\"] section              of this advisory.\r\n\r\n 15.1GC\r\n\r\nVulnerable; first fixed in Release              15.1T [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla#15_1T\"]\r\n\r\nVulnerable; first fixed in Release              15.1T [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla#15_1T\"]\r\n\r\n 15.1M\r\n\r\nNot vulnerable\r\n\r\n15.1(4)M2; Available on 30-SEP-11\r\n\r\n 15.1MR\r\n\r\nNot vulnerable\r\n\r\nVulnerable; contact your support organization per the              instructions in the Obtaining Fixed Software [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla#fixes\"] section              of this advisory.\r\n\r\n 15.1S\r\n\r\n15.1(2)S\r\n\r\nCisco IOS XE devices: Please see Cisco IOS-XE              Software Availability [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla#iosxe\"]\r\n\r\n15.1(2)S2\r\n\r\n15.1(3)S\r\n\r\nCisco IOS XE devices: Please see Cisco IOS-XE              Software Availability [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla#iosxe\"]\r\n\r\n 15.1T\r\n\r\n15.1(1)T3\r\n\r\n 15.1(2)T4\r\n\r\n15.1(3)T2\r\n\r\n15.1(1)T4; Available on 08-DEC-11\r\n\r\n 15.1(2)T4\r\n\r\n15.1(3)T2\r\n\r\n 15.1XB\r\n\r\nVulnerable; first fixed in Release              15.1T [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla#15_1T\"]\r\n\r\nVulnerable; first fixed in Release              15.1T [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla#15_1T\"]\r\n\r\n              Affected 15.2-Based Releases\r\n\r\n              First Fixed Release\r\n\r\n              First Fixed Release for All Advisories in the September              2011 Bundled Publication\r\n\r\nThere are no affected 15.2-based releases\r\n\r\n\r\n    Cisco IOS XE Software\r\nCisco IOS XE Software is affected by the vulnerability disclosed in  this document.\r\n\r\n Cisco IOS XE Release\r\n\r\n First Fixed Release\r\n\r\n First Fixed Release for All Advisories in the September 2011              Bundled Publication\r\n\r\n 2.1.x\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n 2.2.x\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n 2.3.x\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n 2.4.x\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n 2.5.x\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n 2.6.x\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n 3.1.xS\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n 3.1.xSG\r\n\r\n Vulnerable; migrate to 3.2.0SG or later\r\n\r\n Vulnerable; migrate to 3.2.0SG or later\r\n\r\n 3.2.xS\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n Vulnerable; migrate to 3.3.2S or later\r\n\r\n 3.2.xSG\r\n\r\n Not vulnerable\r\n\r\n Not vulnerable\r\n\r\n 3.3.xS\r\n\r\n 3.3.0S\r\n\r\n 3.3.2S\r\n\r\n 3.4.xS\r\n\r\n Not vulnerable\r\n\r\n Not vulnerable\r\n\r\n\r\n\r\nFor mapping of Cisco IOS XE to Cisco IOS releases, please refer to the    Cisco IOS XE 2 Release Notes [\"http://www.cisco.com/en/US/docs/ios/ios_xe/2/release/notes/rnasr21.html#wp2310700\"],    Cisco IOS XE 3S Release Notes [\"http://www.cisco.com/en/US/docs/ios/ios_xe/3/release/notes/asr1k_rn_3s_sys_req.html#wp2999052\"], and    Cisco IOS XE 3SG Release Notes [\"http://www.cisco.com/en/US/docs/switches/lan/catalyst4500/release/note/OL_24726.html#wp2570252\"].",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious  use of the vulnerability described in this advisory.\r\n\r\nThis vulnerability was found during Cisco internal  testing.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "external",
				"summary": "Identifying and Mitigating Exploitation of the Cisco IOS Software IP Service Level Agreement Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20110928-ipsla"
			},
			{
				"category": "self",
				"summary": "Cisco IOS Software IP Service Level Agreement Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla"
			}
		],
		"title": "Cisco IOS Software IP Service Level Agreement Vulnerability",
		"tracking": {
			"current_release_date": "2012-09-21T19:19:00+00:00",
			"generator": {
				"date": "2022-07-15T00:18:30+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20110928-ipsla",
			"initial_release_date": "2011-09-28T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2011-10-10T20:20:00+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				}
			],
			"status": "final",
			"version": "2.1.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"cve": "CVE-2011-3272",
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Cisco IOS Software IP Service Level Agreement Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20110928-ipsla"
				}
			],
			"release_date": "2011-09-28T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for this vulnerability, but there are  mitigations that can be deployed on a general IP SLA responder to reduce the  exposure to this vulnerability.\r\n  General IP SLA Responder Mitigation\r\nFor devices that are configured as general responders, a mitigation is  to restrict IP SLA control packets on UDP port 1967 that are addressed to the  vulnerable device to permit only trusted probe originators to open UDP ports  that could be exploited. This can be accomplished using techniques such as  Infrastructure Access list or Control Plane Protection.\r\n\r\nFor devices configured as general responders, mitigation techniques  that can be deployed on Cisco devices within the network are available in the  Cisco Applied Mitigation Bulletin companion document for this advisory:    http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20110928-ipsla. [\"http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20110928-ipsla\"]\r\n\r\n [\"http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20110928-ipsla\"]\r\n  IP SLA Permanent Responder Mitigation\r\nFor the permanent responder, the mitigation is to filter UDP packets  addressed to the configured UDP port of each permanent responder to permit  packets from the IP addresses of trusted devices.\r\n  IP SLA Source Devices Mitigation\r\nFor IP SLA source devices, a mitigation is to allow only UDP packets  from trusted devices (that is, devices that are the target of IP SLA  operations)"
				}
			],
			"title": "IP SLA Memory Corruption Vulnerability"
		}
	]
}
