{
	"document": {
		"category": "csaf_informational_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "An issue in the Password Policy settings of Cisco Identity Services Engine (ISE) could allow an administrator to use expired credentials to gain access to the web management interface.\r\n\r\nWhen the Password Lifetime setting for the administrator password policy is used to set the password to expire, the password does not expire. As a result, an administrator could use expired credentials to log in to the web management interface and have the same level of privileges as before the password expired. No additional privileges would be gained, and valid credentials would be required.\r\n\r\nThis advisory is available at the following link:\r\nhttps://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ise-lifetime-pwd-GpCs76mb [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ise-lifetime-pwd-GpCs76mb\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "At the time of publication, this issue affected Cisco ISE if it had Password Lifetime enabled.\r\n\r\nCisco is tracking this issue in Cisco bug ID CSCvy74919 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvy74919\"].\r\n\r\nFor information about which Cisco software releases were affected at the time of publication, see the Fixed Software [\"#fs\"] section of this advisory. See the Details section in the bug ID(s) for the most complete and current information.\r\n\r\nDetermine Whether Password Lifetime Is Enabled\r\n\r\nTo determine whether Password Lifetime is enabled, do the following:\r\n\r\nLog in to the Cisco ISE web management interface.\r\nFor Cisco ISE releases 3.0 and 3.1, click the menu icon. For earlier versions of Cisco ISE, skip this step.\r\nChoose Administration > System > Admin Access.\r\nClick the Password Policy tab.\r\nScroll to the Password Lifetime section.\r\nIf the Administrator passwords expire n days after creation or last change check box is checked, the Password Lifetime feature is enabled.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "To manually disable an administrative account at the time it expires, do the following:\r\n\r\nLog in to the Cisco ISE web management interface.\r\nFor Cisco ISE releases 3.0 and 3.1, click the menu icon. For earlier versions of Cisco ISE, skip this step.\r\nChoose Administration > System > Admin Access.\r\nChoose Administrators > Admin Users from the menu on the right.\r\nCheck the box next to the appropriate administrator account and click Edit.\r\nIn the Status drop-down menu, choose Disabled.\r\nClick Save.\r\n\r\nWhile this workaround has been deployed and was proven successful in a test environment, customers should determine the applicability and effectiveness in their own environment and under their own use conditions. Customers should be aware that any workaround or mitigation that is implemented may negatively impact the functionality or performance of their network based on intrinsic customer deployment scenarios and limitations. Customers should not deploy any workarounds or mitigations before first evaluating the applicability to their own environment and any impact to such environment.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n Fixed Releases\r\nAt the time of publication, the release information in the following table(s) was accurate. See the Details section in the bug ID(s) for the most complete and current information.\r\n\r\nThe left column lists Cisco software, and the right column indicates whether a release was affected by the issue described in this advisory and which release included the fix for this issue.\r\n    Cisco ISE Release First Fixed Release     2.4 and earlier Not affected.   2.6P9 and earlier Not affected.   2.6P10 and later Migrate to a fixed release.1   2.7 2.7P5   3.0 3.0P3   3.1 Not affected.\r\n1. The hot patch for Cisco ISE Release 2.6P10 is available by request. Contact the Cisco TAC to make the request.\r\n\r\nThe Cisco Product Security Incident Response Team (PSIRT) validates only the affected and fixed release information that is documented in this advisory.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Identity Services Engine Administrator Password Lifetime Expiration Issue",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ise-lifetime-pwd-GpCs76mb"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ise-lifetime-pwd-GpCs76mb",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ise-lifetime-pwd-GpCs76mb"
			},
			{
				"category": "external",
				"summary": "CSCvy74919",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvy74919"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			}
		],
		"title": "Cisco Identity Services Engine Administrator Password Lifetime Expiration Issue",
		"tracking": {
			"current_release_date": "2022-07-20T16:00:00+00:00",
			"generator": {
				"date": "2022-09-03T03:34:54+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-ise-lifetime-pwd-GpCs76mb",
			"initial_release_date": "2022-07-20T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2022-07-20T15:37:12+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {}
}
