{
	"document": {
		"acknowledgments": [
			{
				"summary": "Cisco would like to thank the National Security Agency (NSA) for reporting this vulnerability."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the packet processing functionality of Cisco TelePresence Collaboration Endpoint (CE) Software and Cisco RoomOS Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r\nThis vulnerability is due to insufficient input validation. An attacker could exploit this vulnerability by sending crafted H.323 traffic to an affected device. A successful exploit could allow the attacker to cause the affected device to either reboot normally or reboot into maintenance mode, which could result in a DoS condition on the device.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects Cisco RoomOS Software in Cloud-Aware On-Premises operation, which is cloud based, and Cisco TelePresence CE Software if they are running vulnerable releases and have H.323 Mode enabled.\r\n\r\nNote: H.323 Mode is disabled by default.\r\n\r\nFor information about which Cisco software releases are vulnerable, see the Fixed Software [\"#fs\"] section of this advisory.\r\n\r\nDetermine the Device Configuration\r\n\r\nTo determine whether H.323 Mode is enabled in Cisco TelePresence CE Software, log in to the device and navigate to the Network Services section of the Setup > Configuration interface. If the H.323 Mode option is set to On, the device is vulnerable.\r\n\r\nTo determine whether a device has H.323 Mode enabled in RoomOS Software for Cloud-Aware Devices, log in to Cisco Control Hub and perform the following steps:\r\n\r\nChoose Devices.\r\nSearch for Cloud-Aware devices using the query Calling == Premises Calling on the Devices screen.\r\nSelect a device to check.\r\nSelect All configurations under Configurations.\r\nSelect NetworkServices > H323 > Mode.\r\nVerify H323 Mode. If the setting is off, the device is not vulnerable. If the setting is on, the device is vulnerable.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect Cisco RoomOS Software in Cloud-Only operation because H.323 Mode is not available.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#ssu\"] that address the vulnerability described in this advisory. Customers with service contracts that entitle them to regular software updates should obtain security fixes through their usual update channels.\r\n\r\nCustomers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nThe Cisco Support and Downloads page [\"https://www.cisco.com/c/en/us/support/index.html\"] on Cisco.com provides information about licensing and downloads. This page can also display customer device support coverage for customers who use the My Devices tool.\r\n\r\nWhen considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n  Customers Without Service Contracts\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC: https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n      Fixed Releases\r\nIn the following table(s), the left column lists Cisco software releases. The right column indicates whether a release is affected by the vulnerability described in this advisory and the first release that includes the fix for this vulnerability. Customers are advised to upgrade to an appropriate fixed software release [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"] as indicated in this section.\r\n           Cisco TelePresence CE Software Release  First Fixed Release          Earlier than 9  Migrate to a fixed release.      9  9.15.10.8      10  10.11.2.2\r\nCisco has addressed this vulnerability in Cisco RoomOS, which is cloud based. No user action is required. Customers can determine the current remediation status or software version by using the Help function in the service GUI. Customers who need additional information are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n           Cisco RoomOS Software  First Fixed Release          Earlier than RoomOS January 2022  RoomOS January 2022\r\nThe Cisco Product Security Incident Response Team (PSIRT) validates only the affected and fixed release information that is documented in this advisory.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "Cisco would like to thank the National Security Agency (NSA) for reporting this vulnerability.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco TelePresence Collaboration Endpoint and RoomOS Software H.323 Denial of Service Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ce-roomos-dos-c65x2Qf2"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "free software updates",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#ssu"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Support and Downloads page",
				"url": "https://www.cisco.com/c/en/us/support/index.html"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			}
		],
		"title": "Cisco TelePresence Collaboration Endpoint and RoomOS Software H.323 Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2022-04-20T16:00:00+00:00",
			"generator": {
				"date": "2024-05-10T23:14:49+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-ce-roomos-dos-c65x2Qf2",
			"initial_release_date": "2022-04-20T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2022-04-20T15:29:24+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco RoomOS Software",
						"product": {
							"name": "Cisco RoomOS Software ",
							"product_id": "CSAFPID-265966"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco TelePresence Endpoint Software (TC/CE)",
						"product": {
							"name": "Cisco TelePresence Endpoint Software (TC/CE) ",
							"product_id": "CSAFPID-278404"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2022-20783",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvz55702"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-278404",
					"CSAFPID-265966"
				]
			},
			"release_date": "2022-04-20T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-278404",
						"CSAFPID-265966"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 7.5,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-278404",
						"CSAFPID-265966"
					]
				}
			],
			"title": "Cisco Telepresence CE and RoomOS Software Denial of Service Vulnerability"
		}
	]
}
