{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during the resolution of a Cisco Meraki support case."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the Cisco AnyConnect VPN server of Cisco Meraki MX and Cisco Meraki Z3 Teleworker Gateway devices could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r\nThis vulnerability is due to insufficient validation of client-supplied parameters while establishing an SSL VPN session. An attacker could exploit this vulnerability by crafting a malicious request and sending it to the affected device. A successful exploit could allow the attacker to cause the Cisco AnyConnect VPN server to crash and restart, resulting in the failure of the established SSL VPN connections and forcing remote users to initiate a new VPN connection and re-authenticate. A sustained attack could prevent new SSL VPN connections from being established.\r\n\r\nNote: When the attack traffic stops, the Cisco AnyConnect VPN server recovers gracefully without requiring manual intervention.\r\n\r\nCisco Meraki has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "This vulnerability affects the following Cisco Meraki products if they are running a vulnerable release of Cisco Meraki MX firmware and have Cisco AnyConnect VPN enabled:\r\n\r\nMX64\r\nMX64W\r\nMX65\r\nMX65W\r\nMX67\r\nMX67CW\r\nMX67W\r\nMX68\r\nMX68CW\r\nMX68W\r\nMX75\r\nMX84\r\nMX85\r\nMX95\r\nMX100\r\nMX105\r\nMX250\r\nMX400\r\nMX450\r\nMX600\r\nvMX\r\nZ3C\r\nZ3\r\n\r\nNote: Cisco AnyConnect VPN is supported on Cisco Meraki MX Series and Cisco Meraki Z3 Teleworker Gateway devices that run Cisco Meraki MX firmware releases 16.2 and later, except for Cisco Meraki MX64 and MX65, which support Cisco AnyConnect VPN only if they are running Cisco Meraki MX firmware releases 17.6 and later.\r\n\r\nFor information about which Cisco software releases are vulnerable, see the Fixed Software [\"#fs\"] section of this advisory.\r\n  Determine the Device Configuration\r\nDetermine Whether Cisco AnyConnect VPN Is Enabled on Cisco Meraki MX Devices\r\n\r\nTo determine whether Cisco AnyConnect VPN is enabled on a Cisco Meraki MX device, complete the following steps:\r\n\r\nLog in to the Dashboard.\r\nChoose Security Appliance > Configure > Client VPN in the combined view.\r\nChoose the AnyConnect Settings tab.\r\n\r\nIf the Enabled radio button is selected, the device is configured to support Cisco AnyConnect VPN.\r\n\r\nIf the Cisco AnyConnect Settings tab is not displayed, or if the Disabled radio button is selected, the device is not impacted by the vulnerability described in this advisory.\r\n\r\nDetermine Whether Cisco AnyConnect VPN Is Enabled on Cisco Meraki Z3 Teleworker Gateway Devices\r\n\r\nTo determine whether Cisco AnyConnect VPN is enabled on Cisco Meraki Z3 Teleworker Gateway devices, complete the following steps:\r\n\r\nLog in to the Dashboard.\r\nChoose Teleworker gateway > Configure > Client VPN in the combined view.\r\nChoose the AnyConnect Settings tab.\r\n\r\nIf the Enabled radio button is selected, the device is configured to support Cisco AnyConnect VPN.\r\n\r\nIf the Cisco AnyConnect Settings tab is not displayed, or if the Disabled radio button is selected, the device is not impacted by the vulnerability described in this advisory.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect the following Cisco products:\r\n\r\nMeraki MX 60\r\nMeraki MX 80\r\nMeraki MX 90\r\nMeraki Z1\r\nAdaptive Security Appliance (ASA) Software\r\nFirepower Threat Defense (FTD) Software\r\nIOS Software\r\nIOS XE Software",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco Meraki MX Series and Cisco Meraki Z3 Teleworker Gateway devices support the following two VPN services for remote network access:\r\n\r\nClient VPN, which uses Layer 2 Tunneling Protocol (L2TP) or IPsec tunneling protocols\r\nCisco AnyConnect VPN, which uses Transport Layer Security (TLS) and Datagram TLS (DTLS) protocols and is commonly referred to as SSL VPN\r\n\r\nOn both Cisco Meraki MX Series and Cisco Meraki Z3 Teleworker Gateway devices, Client VPN (L2TP/IPsec) and Cisco AnyConnect VPN (SSL) services can be enabled simultaneously.\r\n\r\nThis vulnerability resides in the processing of TLS and DTLS packets, so it affects only devices that are configured with Cisco AnyConnect VPN. Devices that are configured to provide remote network access exclusively through Client VPN (L2TP/IPsec) are not affected by this vulnerability.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability. Cisco Meraki recommends that administrators upgrade devices to a fixed software release. Disabling Cisco AnyConnect VPN will remove the attack vector for the vulnerability that is described in this advisory.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco Meraki has released free software updates that address the vulnerability that is described in this advisory.\r\n\r\nCustomers may only install and expect support for software releases and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco End User License Agreement and applicable Product Specific Terms:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/about/legal/cloud-and-software/end_user_license_agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco Meraki directly, or through a Cisco Meraki authorized reseller or partner. In most cases, this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nCustomers are advised to regularly consult the advisories for Cisco Meraki products, which are available from the Cisco Security Advisories page [\"https://sec.cloudapps.cisco.com/security/center/publicationListing.x\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. Cisco Meraki recommends utilizing firmware best practices [\"https://documentation.meraki.com/Architectures_and_Best_Practices/Cisco_Meraki_Best_Practice_Design/Best_Practices_for_Meraki_Firmware\"] for firmware updates. If the information is not clear, customers are advised to contact Cisco Meraki Support [\"https://documentation.meraki.com/General_Administration/Support/Contacting_Support\"].\r\n      Fixed Releases\r\nAt the time of publication, the release information in the following table was accurate. Cisco Meraki will update this advisory as required.\r\n\r\nThe left column lists Cisco Meraki MX firmware releases, and the right column indicates whether a release was affected by the vulnerability described in this advisory and which release included the fix for this vulnerability. Both Cisco Meraki MX Series and Cisco Meraki Z3 Teleworker Gateway run Cisco Meraki MX firmware. Therefore, information in the following table applies to both platforms.\r\n        Cisco Meraki MX Firmware Release  Fixed Release for This Vulnerability          Earlier than 16.2  Not affected      16.2 and later  16.16.6      17.x  17.10.1",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "Neither the Cisco Product Security Incident Response Team (PSIRT) nor the Cisco Meraki Incident Response Team is aware of any malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during the resolution of a Cisco Meraki support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Meraki MX and Z3 Teleworker Gateway VPN Denial of Service Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-meraki-mx-vpn-dos-vnESbgBf"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/about/legal/cloud-and-software/end_user_license_agreement.html"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Security Advisories page",
				"url": "https://sec.cloudapps.cisco.com/security/center/publicationListing.x"
			},
			{
				"category": "external",
				"summary": "firmware best practices",
				"url": "https://documentation.meraki.com/Architectures_and_Best_Practices/Cisco_Meraki_Best_Practice_Design/Best_Practices_for_Meraki_Firmware"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Meraki Support",
				"url": "https://documentation.meraki.com/General_Administration/Support/Contacting_Support"
			}
		],
		"title": "Cisco Meraki MX and Z3 Teleworker Gateway VPN Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2022-10-19T19:44:34+00:00",
			"generator": {
				"date": "2024-05-10T23:19:39+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-meraki-mx-vpn-dos-vnESbgBf",
			"initial_release_date": "2022-10-19T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2022-10-19T15:33:48+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2022-10-19T19:44:34+00:00",
					"number": "1.1.0",
					"summary": "Changed advisory status from interim to final."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Meraki MX Firmware",
						"product": {
							"name": "Cisco Meraki MX Firmware ",
							"product_id": "CSAFPID-204724"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2022-20933",
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-204724"
				]
			},
			"release_date": "2022-10-19T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-204724"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 8.6,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-204724"
					]
				}
			],
			"title": "Cisco Meraki MX  VPN Denial of Service Vulnerability"
		}
	]
}
