{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found by Javier Contreras of Cisco during internal security testing."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the client forwarding code of multiple Cisco Access Points (APs) could allow an unauthenticated, adjacent attacker to inject packets from the native VLAN to clients within nonnative VLANs on an affected device.\r\n\r\nThis vulnerability is due to a logic error on the AP that forwards packets that are destined to a wireless client if they are received on the native VLAN. An attacker could exploit this vulnerability by obtaining access to the native VLAN and directing traffic directly to the client through their MAC/IP combination. A successful exploit could allow the attacker to bypass VLAN separation and potentially also bypass any Layer 3 protection mechanisms that are deployed.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "At the time of publication, this vulnerability affected the following Cisco products if they were running a vulnerable release of Cisco Aironet Series Access Points Software in either local or flex local switching modes:\r\n\r\n6300 Series Embedded Services Access Points (ESW6300)\r\nAironet 1540 Series Access Points\r\nAironet 1560 Series Access Points\r\nAironet 1800 Series Access Points\r\nAironet 2800 Series Access Points\r\nAironet 3800 Series Access Points\r\nAironet 4800 Access Points\r\nBusiness 100 Series Access Points\r\nBusiness 200 Series Access Points\r\nCatalyst 9100 Access Points\r\nCatalyst IW 6300 Heavy Duty Series Access Points\r\nIntegrated AP on 1100 Integrated Services Routers\r\n\r\nFor information about which Cisco software releases were vulnerable at the time of publication, see the Fixed Software [\"#fs\"] section of this advisory. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.\r\n\r\nCisco has confirmed that this vulnerability does not affect any Cisco Access Point series that is not listed in the Vulnerable Products [\"#vp\"] section of this advisory.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "In order to exploit this vulnerability, an attacker must be able to inject traffic into the native VLAN of an AP.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n      Fixed Releases\r\nAt the time of publication, the release information in the following table(s) was accurate. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.\r\n\r\nThe left column lists Cisco software releases, and the right column indicates whether a release was affected by the vulnerability that is described in this advisory and which release included the fix for this vulnerability.\r\n\r\nAccess Points Managed by Wireless LAN Controller\r\n           Cisco Wireless LAN Controller Software Release  First Fixed Release          8.5 and earlier  Migrate to a fixed release.      8.10  8.10.181.0\r\nAccess Points Managed by Catalyst 9800 Wireless Controller\r\n        Cisco Catalyst 9800 Wireless Controller Software Release  First Fixed Release          17.2 and earlier  Migrate to a fixed release.      17.3  Migrate to 17.3.6 and apply APSP patch (APSP patch no. TBD)      17.4  Migrate to a fixed release.      17.5  Migrate to a fixed release.      17.6  17.6.2      17.7 and later  Not affected.\r\nThe Cisco Product Security Incident Response Team (PSIRT) validates only the affected and fixed release information that is documented in this advisory.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found by Javier Contreras of Cisco during internal security testing.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Access Points VLAN Bypass from Native VLAN Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-apvlan-TDTtb4FY"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			}
		],
		"title": "Cisco Access Points VLAN Bypass from Native VLAN Vulnerability",
		"tracking": {
			"current_release_date": "2022-10-04T13:22:46+00:00",
			"generator": {
				"date": "2024-05-10T23:18:20+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-apvlan-TDTtb4FY",
			"initial_release_date": "2022-09-27T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2022-09-27T16:38:07+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2022-10-04T13:22:46+00:00",
					"number": "1.1.0",
					"summary": "Updated Fixed Release information for Cisco Wireless LAN Controller Software Release."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Aironet Access Point Software (IOS XE Controller)",
						"product": {
							"name": "Cisco Aironet Access Point Software (IOS XE Controller) ",
							"product_id": "CSAFPID-280019"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2022-20728",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvz99036"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-280019"
				]
			},
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-280019"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 4.7,
						"baseSeverity": "MEDIUM",
						"vectorString": "CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:L/A:N",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-280019"
					]
				}
			],
			"title": "Cisco Aironet Access Points VLAN bypass from Native VLAN Vulnerability"
		}
	]
}
