{
	"document": {
		"acknowledgments": [
			{
				"summary": "This vulnerability was found during the resolution of a Cisco TAC support case."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in authentication mechanism of Cisco Software-Defined Application Visibility and Control (SD-AVC) on Cisco vManage could allow an unauthenticated, remote attacker to access the GUI of Cisco SD-AVC using a default static username and password combination.\r\n\r\nThis vulnerability exists because the GUI is accessible on self-managed cloud installations or local server installations of Cisco vManage. An attacker could exploit this vulnerability by accessing the exposed GUI of Cisco SD-AVC. A successful exploit could allow the attacker to view managed device names, SD-AVC logs, and SD-AVC DNS server IP addresses.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "At the time of publication, this vulnerability affected self-managed cloud installations or local server installations of Cisco vManage that have SD-AVC enabled.\r\n\r\nFor information about which Cisco software releases were vulnerable at the time of publication, see the Fixed Software [\"#fs\"] section of this advisory. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.\r\n\r\nNote: Installations of cloud-based servers that are provided fully configured by the Cisco Cloud Operations Team do not expose the SD-AVC GUI. If, at the request of the customer, the SD-AVC GUI has been exposed, that environment is affected by this vulnerability.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address this vulnerability.\r\n\r\nHowever, as a mitigation for this vulnerability, customers who have enabled the SD-AVC component can ensure that access from northbound networks to TCP port 10502 is restricted.\r\n\r\nWhile this mitigation has been deployed and was proven successful in a test environment, customers should determine the applicability and effectiveness in their own environment and under their own use conditions. Customers should be aware that any workaround or mitigation that is implemented may negatively impact the functionality or performance of their network based on intrinsic customer deployment scenarios and limitations. Customers should not deploy any workarounds or mitigations before first evaluating the applicability to their own environment and any impact to such environment.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n      Fixed Releases\r\nAt the time of publication, the release information in the following table(s) was accurate. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.\r\n\r\nThe left column lists Cisco software releases, and the right column indicates whether a release was affected by the vulnerabilities that are described in this advisory and which release included the fix for these vulnerabilities.\r\n        Cisco vManage Release  First Fixed Release          18.3 and earlier  Not affected.      18.4  Not affected.      19.2  Not affected.      20.1  Not affected.      20.3.2 through 20.3.4  Not affected.      20.3.4.1\r\n20.3.4.2\r\n20.3.5  Migrate to a fixed release.      20.4  Migrate to a fixed release.      20.5  Migrate to a fixed release.      20.6  20.6.31      20.7  20.7.21      20.8  20.8.11      20.9  20.9.1\r\n1. Upgrading to Release 20.6.3, 20.7.2, or 20.8.1 causes the SD-AVC container to shut down. To enable the SD-AVC container, do the following:\r\nEnable SD-AVC.\r\nReboot vManage.\r\nReboot vManage a second time.\r\n\r\nNote: The vulnerability described in this advisory is associated with the vulnerability described in Cisco Security Advisory cisco-sa-sdwan-avc-NddSGB8 [\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-sdwan-avc-NddSGB8\"]. Cisco recommends that administrators take into account both vulnerabilities when planning for a software upgrade.\r\n\r\nThe Cisco Product Security Incident Response Team (PSIRT) validates only the affected and fixed release information that is documented in this advisory.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "This vulnerability was found during the resolution of a Cisco TAC support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Software-Defined Application Visibility and Control on Cisco vManage Static Username and Password Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-sdavc-ZA5fpXX2"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "cisco-sa-sdwan-avc-NddSGB8",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-sdwan-avc-NddSGB8"
			}
		],
		"title": "Cisco Software-Defined Application Visibility and Control on Cisco vManage Static Username and Password Vulnerability",
		"tracking": {
			"current_release_date": "2022-09-28T16:00:00+00:00",
			"generator": {
				"date": "2024-05-10T23:18:30+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-sdavc-ZA5fpXX2",
			"initial_release_date": "2022-09-28T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2022-09-28T15:46:21+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Catalyst SD-WAN Manager",
						"product": {
							"name": "Cisco Catalyst SD-WAN Manager ",
							"product_id": "CSAFPID-271450"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2022-20844",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvz97362"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-271450"
				]
			},
			"release_date": "2022-09-28T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-271450"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 5.3,
						"baseSeverity": "MEDIUM",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-271450"
					]
				}
			],
			"title": "Cisco Software-Defined Application Visibility and Control on Cisco vManage Static Username/Password Vulnerability"
		}
	]
}
