{
	"document": {
		"acknowledgments": [
			{
				"summary": "Cisco would like to thank security researcher Jasper Lievisse Adriaanse for reporting these vulnerabilities."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Multiple vulnerabilities in Cisco Business 220 Series Smart Switches firmware could allow an attacker with Administrator privileges to access sensitive login credentials or reconfigure the passwords on the user account.\r\n\r\nFor more information about these vulnerabilities, see the Details [\"#details\"] section of this advisory.\r\n\r\nCisco has released software updates that address these vulnerabilities. There are no workarounds that address these vulnerabilities.\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "At the time of publication, these vulnerabilities affected Cisco Business 220 Series Smart Switches if they were running a vulnerable firmware release and had the web-based management interface enabled. The web-based management interface is enabled through both HTTP and HTTPS by default.\r\n\r\nDetermine the Device Configuration\r\n\r\nTo determine whether the web-based management interface is enabled through either HTTP or HTTPS, use the show running-config command on the device CLI. If both of the following lines are present in the configuration, the web-based management interface is disabled and the device is not affected:\r\n\r\n\r\nno ip http server\r\nno ip http secure server\r\n\r\nAny other output indicates that the web-based management interface is enabled on the device.\r\n\r\nIn the web-based management interface, the HTTP service and HTTPS service are configured under Security > TCP/UDP Service.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by these vulnerabilities.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The vulnerabilities are not dependent on one another. Exploitation of one of the vulnerabilities is not required to exploit the other vulnerability. In addition, a software release that is affected by one of the vulnerabilities may not be affected by the other vulnerability.\r\n\r\nDetails about the vulnerabilities are as follows:\r\n\r\nCVE-2021-34757: Cisco Business 220 Series Static Password Vulnerability\r\n\r\nA vulnerability in Cisco Business 220 Series Smart Switches firmware could allow an authenticated, physical attacker to obtain higher privileges on an affected device.\r\n\r\nThis vulnerability is due to the use of a static password in all Cisco Business 220 Series Smart Switches firmware. An attacker with Administrator privileges could exploit this vulnerability by logging in to a serial interface and accessing encoded passwords. A successful exploit could allow the attacker to obtain and reconfigure user account passwords.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nBug ID(s): CSCvy90709 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvy90709\"]\r\nCVE ID: CVE-2021-34757\r\nSecurity Impact Rating (SIR): Medium\r\nCVSS Base Score: 5.5\r\nCVSS Vector: CVSS:3.1/AV:P/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:N\r\n\r\nCVE-2021-34744: Cisco Business 220 Series Static Key Vulnerability\r\n\r\nA vulnerability in Cisco Business 220 Series Smart Switches firmware could allow an authenticated, remote attacker to access sensitive information on an affected device.\r\n\r\nThis vulnerability is due to the use of a static cryptographic key in all Cisco Business 220 Series Smart Switches firmware images. An attacker with Administrator privileges could exploit this vulnerability by logging in to the web-based management interface and accessing encrypted passwords. A successful exploit could allow the attacker to obtain sensitive login credentials for other applications.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nBug ID(s): CSCvy90713 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvy90713\"]\r\nCVE ID: CVE-2021-34744\r\nSecurity Impact Rating (SIR): Medium\r\nCVSS Base Score: 4.9\r\nCVSS Vector: CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that address these vulnerabilities.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n      Fixed Releases\r\nAt the time of publication, the release information in the following table(s) was accurate. See the Details section in the bug ID(s) at the top of this advisory for the most complete and current information.\r\n\r\nThe left column lists Cisco software releases, and the right column indicates whether a release was affected by the vulnerabilities described in this advisory and which release included the fix for these vulnerabilities.\r\n        Cisco Business 220 Series Smart Switches Firmware Release  First Fixed Release          1.2.0.6 and earlier  1.2.1.2\r\nThe Cisco Product Security Incident Response Team (PSIRT) validates only the affected and fixed release information that is documented in this advisory.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious use of the vulnerabilities that are described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "Cisco would like to thank security researcher Jasper Lievisse Adriaanse for reporting these vulnerabilities.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Business 220 Series Smart Switches Static Key and Password Vulnerabilities",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-sb-hardcoded-cred-MJCEXvX"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "CSCvy90709",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvy90709"
			},
			{
				"category": "external",
				"summary": "CSCvy90713",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCvy90713"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			}
		],
		"title": "Cisco Business 220 Series Smart Switches Static Key and Password Vulnerabilities",
		"tracking": {
			"current_release_date": "2021-10-06T16:00:00+00:00",
			"generator": {
				"date": "2024-05-10T23:09:34+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-sb-hardcoded-cred-MJCEXvX",
			"initial_release_date": "2021-10-06T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2021-10-06T15:52:43+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Small Business 220 Series Smart Plus Switches",
						"product": {
							"name": "Cisco Small Business 220 Series Smart Plus Switches ",
							"product_id": "CSAFPID-218878"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco Small Business Smart and Managed Switches",
						"product": {
							"name": "Cisco Small Business Smart and Managed Switches ",
							"product_id": "CSAFPID-278027"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2021-34744",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvy90713"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-218878",
					"CSAFPID-278027"
				]
			},
			"release_date": "2021-10-06T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-218878",
						"CSAFPID-278027"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 4.9,
						"baseSeverity": "MEDIUM",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-218878",
						"CSAFPID-278027"
					]
				}
			],
			"title": "Cisco Small Business 220 Series Hardcoded AES Key Information Disclosure Vulnerability "
		},
		{
			"cve": "CVE-2021-34757",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCvy90709"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-218878",
					"CSAFPID-278027"
				]
			},
			"release_date": "2021-10-06T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-218878",
						"CSAFPID-278027"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 5.5,
						"baseSeverity": "MEDIUM",
						"vectorString": "CVSS:3.1/AV:P/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:N",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-218878",
						"CSAFPID-278027"
					]
				}
			],
			"title": "Cisco Small Business 220 Series Privilege Escalation Vulnerability"
		}
	]
}
