{
	"document": {
		"acknowledgments": [
			{
				"summary": "CVE-2021-1288: Cisco would like to thank the U.S. National Security Agency (NSA) for reporting this vulnerability.\r\n\r\nCVE-2021-1313: This vulnerability was found during the resolution of a Cisco TAC support case."
			}
		],
		"category": "csaf_security_advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Multiple vulnerabilities in the ingress packet processing function of Cisco IOS XR Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.\r\n\r\nFor more information about these vulnerabilities, see the Details [\"#details\"] section of this advisory.\r\n\r\nCisco has released software updates that address these vulnerabilities. There are no workarounds that address these vulnerabilities.\r\n\r\n\r\n",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "These vulnerabilities affect Cisco devices if they are running an affected release of Cisco IOS XR Software.\r\n\r\nFor information about which Cisco software releases are vulnerable, see the Fixed Software [\"#fs\"] section of this advisory.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Only products listed in the Vulnerable Products [\"#vp\"] section of this advisory are known to be affected by these vulnerabilities.\r\n\r\nCisco has confirmed that these vulnerabilities do not affect the following Cisco products:\r\n\r\nIOS Software\r\nIOS XE Software\r\nNX-OS Software",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "The vulnerabilities are not dependent on one another. Exploitation of one of the vulnerabilities is not required to exploit the other vulnerability. In addition, a software release that is affected by one of the vulnerabilities may not be affected by the other vulnerability.\r\n\r\nDetails about the vulnerabilities are as follows.\r\n\r\nCVE-2021-1288: Cisco IOS XR Software Enf Broker Denial of Service Vulnerability\r\n\r\nA vulnerability in the ingress packet processing function of Cisco IOS XR Software could allow an unauthenticated, remote attacker to cause a DoS condition on an affected device.\r\n\r\nThe vulnerability is due to a logic error that occurs when an affected device processes Telnet protocol packets. An attacker could exploit this vulnerability by sending specific streams of packets to the affected device. A successful exploit could allow the attacker to cause the enf_broker process to crash, which could lead to system instability and the inability to process or forward traffic through the affected device.\r\n\r\nThis vulnerability can be exploited using specific, crafted streams of packets over either IPv4 or IPv6.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nBug ID(s): CSCuz39742 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuz39742\"]\r\nCVE ID: CVE-2021-1288\r\nSecurity Impact Rating (SIR): High\r\nCVSS Base Score: 8.6\r\nCVSS Vector: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H [\"https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&vector=CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H\"]\r\n\r\nCVE-2021-1313: Cisco IOS XR Software Enf Broker Denial of Service Vulnerability\r\n\r\nA vulnerability in the ingress packet processing function of Cisco IOS XR Software could allow an unauthenticated, remote attacker to cause a DoS condition on an affected device.\r\n\r\nThe vulnerability is due to improper resource allocation when an affected device processes either ICMP or Telnet protocol packets. An attacker could exploit this vulnerability by sending specific streams of packets to the affected device. A successful exploit could allow the attacker to cause the enf_broker process to leak system memory. Over time, this memory leak could cause the enf_broker process to crash, which could lead to system instability and the inability to process or forward traffic through the affected device.\r\n\r\nThis vulnerability can be exploited using specific, crafted streams of packets over either IPv4 or IPv6.\r\n\r\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\r\n\r\nBug ID(s): CSCuy67256 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuy67256\"]\r\nCVE ID: CVE-2021-1313\r\nSecurity Impact Rating (SIR): High\r\nCVSS Base Score: 8.6\r\nCVSS Vector: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H [\"https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&vector=CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H\"]",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "Exploitation of either of these vulnerabilities can result in a crash of the enf_broker process on an affected device. When a device has experienced a crash of the enf_broker process, the following messages may be seen in the system logs:\r\n        %OS-SYSMGR-3-ERROR : enf_broker(1) (jid 209) exited, will be respawned with a delay (slow-restart)      %OS-SYSMGR-3-ERROR : enf_broker(209) (fail count 28597) will be respawned in 120 seconds      %OS-DUMPER-7-DUMP_REQUEST : Dump request for process pkg/bin/enf_broker%OS-DUMPER-7-DUMP_ATTRIBUTE : Dump request with attribute 200 for process pkg/bin/enf_broker\r\nThese error messages indicate that the enf_broker process has crashed. However, the process may have crashed for a reason other than the exploitation of one of these vulnerabilities. Customers are advised to contact their support organization to review the error messages and determine whether the device has been compromised by an exploitation of one of these vulnerabilities.",
				"title": "Indicators of Compromise"
			},
			{
				"category": "general",
				"text": "There are no workarounds for these vulnerabilities. However, multiple mitigations are available.\r\n\r\nAs a mitigation for CVE-2021-1288, customers can disable the Telnet protocol for incoming connections. Information on how to disable Telnet can be found in the Cisco Guide to Harden Cisco IOS XR Devices. [\"https://sec.cloudapps.cisco.com/security/center/resources/increase_security_ios_xr_devices.html\"]\r\n\r\nBecause CVE-2021-1313 can be exploited when processing a stream of either Telnet or ICMP protocol packets, the following steps for mitigation should be implemented together to ensure protection against the two attack vectors:\r\n\r\nDisable the Telnet protocol for incoming connections.\r\nImplement an access control entry (ACE) to an existing interface ACL or create a new ACL that denies ICMP traffic that is inbound to a specific interface. The following input is an example of how to create an IPv4 ACL and deny ICMP traffic:\r\n\r\nP/0/0/CPU0:router(config)# ipv4 access-list <acl_name> deny icmp any any\r\n\r\n\r\nFor information on how to perform both of these mitigations, see the Cisco Guide to Harden Cisco IOS XR Devices [\"https://sec.cloudapps.cisco.com/security/center/resources/increase_security_ios_xr_devices.html\"].\r\n\r\nWhile these mitigations have been deployed and were proven successful in a test environment, customers should determine the applicability and effectiveness on their own environment and under their own use conditions. Customers should be aware that any workaround or mitigation that is implemented may negatively impact the functionality or performance of their network, based on intrinsic customer deployment scenarios and limitations. Customers should not deploy any workarounds or mitigations before first evaluating their applicability to their own environment and any impact to such environment.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "Cisco has released free software updates that address the vulnerabilities described in this advisory. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. By installing, downloading, accessing, or otherwise using such software upgrades, customers agree to follow the terms of the Cisco software license:\r\nhttps://www.cisco.com/c/en/us/products/end-user-license-agreement.html [\"https://www.cisco.com/c/en/us/products/end-user-license-agreement.html\"]\r\n\r\nAdditionally, customers may only download software for which they have a valid license, procured from Cisco directly, or through a Cisco authorized reseller or partner. In most cases this will be a maintenance upgrade to software that was previously purchased. Free security software updates do not entitle customers to a new software license, additional software feature sets, or major revision upgrades.\r\n\r\nWhen considering software upgrades [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes\"], customers are advised to regularly consult the advisories for Cisco products, which are available from the Cisco Security Advisories page [\"https://www.cisco.com/go/psirt\"], to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\n  Customers Without Service Contracts\r\nCustomers who purchase directly from Cisco but do not hold a Cisco service contract and customers who make purchases through third-party vendors but are unsuccessful in obtaining fixed software through their point of sale should obtain upgrades by contacting the Cisco TAC: https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html [\"https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html\"]\r\n\r\nCustomers should have the product serial number available and be prepared to provide the URL of this advisory as evidence of entitlement to a free upgrade.\r\n      Fixed Releases\r\nCustomers are advised to upgrade to an appropriate fixed software release as indicated in the following table(s):\r\n        Cisco IOS XR Software Release  First Fixed Release for\r\nCVE-2021-1288 (CSCuz39742)  First Fixed Release for\r\nCVE-2021-1313 (CSCuy67256)  First Fixed Release for All Vulnerabilities Described in This Advisory          5.0  5.2.6\r\n5.3.4  5.2.471\r\n5.2.6\r\n5.3.4  5.2.6\r\n5.3.4      6.0  6.0.2  Not vulnerable.  6.0.2      7.0 and later  Not vulnerable.  Not vulnerable.  Not vulnerable.\r\n1. Cisco IOS XR Software Release 5.2.47 addresses CVE-2021-1313 on Cisco Network Convergence System 4000 Series. For all other affected platforms that are running Cisco IOS XR, Cisco has fixed CVE-2021-1313 on Cisco IOS XR Software releases 5.3.4 and later.\r\n\r\nNote: Cisco IOS XR Software Release 5.3.3 does not include fixes for both CVE-2021-1288 (CSCuz39742) and CVE-2021-1313 (CSCuy67256). Customers who are running Cisco IOS XR Software Release 5.3.3 are advised either to migrate to a fixed IOS XR Software release or to apply the appropriate SMUs for their platform.\r\nCisco has released SMUs that address these vulnerabilities. The following tables provide the SMU name for each release based on platform. Although names of the SMUs include CSCuy67256 only, the SMUs contain the fixes for both CSCuz39742 and CSCuy67256.\r\n        Cisco IOS XR Software Release  Platform  SMU Name          5.1.3  ASR9K-PX  asr9k-px-5.1.3.CSCuy67256      5.3.2  ASR9K-PX  asr9k-px-5.3.2.CSCuy67256      5.3.3  ASR9K-PX  asr9k-px-5.3.3.CSCuy67256      CRS-PX  hfr-px-5.3.3.CSCuy67256",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerabilities that are described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "general",
				"text": "CVE-2021-1288: Cisco would like to thank the U.S. National Security Agency (NSA) for reporting this vulnerability.\r\n\r\nCVE-2021-1313: This vulnerability was found during the resolution of a Cisco TAC support case.",
				"title": "Source"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "psirt@cisco.com",
			"issuing_authority": "Cisco PSIRT",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS XR Software Enf Broker Denial of Service Vulnerability",
				"url": "https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-iosxr-dos-WwDdghs2"
			},
			{
				"category": "external",
				"summary": "Cisco Security Vulnerability Policy",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html"
			},
			{
				"category": "external",
				"summary": "CSCuz39742",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuz39742"
			},
			{
				"category": "external",
				"summary": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H",
				"url": "https://sec.cloudapps.cisco.com/security/center/cvssCalculator.x?version=3.1&amp;vector=CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H"
			},
			{
				"category": "external",
				"summary": "CSCuy67256",
				"url": "https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuy67256"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Guide to Harden Cisco&nbsp;IOS XR Devices.",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/increase_security_ios_xr_devices.html"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html",
				"url": "https://www.cisco.com/c/en/us/products/end-user-license-agreement.html"
			},
			{
				"category": "external",
				"summary": "considering software upgrades",
				"url": "https://sec.cloudapps.cisco.com/security/center/resources/security_vulnerability_policy.html#fixes"
			},
			{
				"category": "external",
				"summary": "Cisco&nbsp;Security Advisories page",
				"url": "https://www.cisco.com/go/psirt"
			},
			{
				"category": "external",
				"summary": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html",
				"url": "https://www.cisco.com/c/en/us/support/web/tsd-cisco-worldwide-contacts.html"
			}
		],
		"title": "Cisco IOS XR Software Enf Broker Denial of Service Vulnerability",
		"tracking": {
			"current_release_date": "2021-02-04T22:08:58+00:00",
			"generator": {
				"date": "2024-05-10T22:59:25+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-iosxr-dos-WwDdghs2",
			"initial_release_date": "2021-02-03T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2021-01-26T22:35:43+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2021-02-04T22:08:58+00:00",
					"number": "1.1.0",
					"summary": "Updated information about fixed release availability for Cisco IOS XR Software Release 5.0. Fixes for both vulnerabilities were integrated into releases 5.2.6 and 5.3.4."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco IOS XR Software",
						"product": {
							"name": "Cisco IOS XR Software ",
							"product_id": "CSAFPID-5834"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2021-1288",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCuz39742"
				},
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCuy67256"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-5834"
				]
			},
			"release_date": "2021-02-03T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-5834"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 8.6,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-5834"
					]
				}
			],
			"title": "Cisco IOS XR Software TCP Denial of Service Vulnerability"
		},
		{
			"cve": "CVE-2021-1313",
			"ids": [
				{
					"system_name": "Cisco Bug ID",
					"text": "CSCuy67256"
				}
			],
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-5834"
				]
			},
			"release_date": "2021-02-03T16:00:00+00:00",
			"remediations": [
				{
					"category": "vendor_fix",
					"details": "Cisco has released software updates that address this vulnerability.",
					"product_ids": [
						"CSAFPID-5834"
					],
					"url": "https://software.cisco.com"
				}
			],
			"scores": [
				{
					"cvss_v3": {
						"baseScore": 8.6,
						"baseSeverity": "HIGH",
						"vectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H",
						"version": "3.1"
					},
					"products": [
						"CSAFPID-5834"
					]
				}
			],
			"title": "Cisco IOS XR Software ENF_BROKER Denial of Service Vulnerability"
		}
	]
}
