{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "The Secure Shell server (SSH) implementation in Cisco IOS contains  multiple vulnerabilities that allow unauthenticated users the ability to  generate a spurious memory access error or, in certain cases, reload the  device.\r\n\r\nThe IOS SSH server is an optional service that is disabled by default,  but its use is highly recommended as a security best practice for management of  Cisco IOS devices. SSH can be configured as part of the AutoSecure feature in  the initial configuration of IOS devices, AutoSecure run after initial  configuration, or manually. SSH is enabled any time RSA keys are generated such  as when a http secure-server or trust points for digital certificates are  configured. Devices that are not configured to accept SSH connections are not  affected by these vulnerabilities.\r\n\r\nCommon Vulnerabilities and Exposures (CVE) identifier  CVE-2008-1159 [\"http://nvd.nist.gov/nvd.cfm?cvename=CVE-2008-1159\"]  has been assigned to this vulnerability.\r\n\r\nThis advisory is posted at  http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20080521-ssh [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20080521-ssh\"].",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco devices running certain 12.4-based IOS releases and configured to  be managed via SSH may be affected by this issue.\r\n\r\n The IOS secure shell server is disabled by default. To determine if  SSH is enabled, use the show ip ssh command.\r\n\r\n\r\nRouter#show ip ssh\nSSH Enabled - version 2.0 Authentication timeout: 120 secs; Authentication retries: 3\r\n\r\nThe previous output shows that SSH is enabled on this device and that  the SSH protocol major version that is being supported is 2.0. If the text \"SSH  Disabled\" is displayed, the device is not vulnerable. Possible values for the  SSH protocol version reported by IOS are:\r\n\r\n   1.5: only SSH protocol version 1 is enabled\r\n\r\n   1.99: SSH protocol version 2 with SSH protocol version 1 compatibility enabled\r\n\r\n   2.0: only SSH protocol version 2 is enabled\r\n\r\n\r\nFor more information about SSH versions in IOS, please check the  following URL:  http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gt_ssh2.html [\"http://www.cisco.com/en/US/docs/ios/12_3t/12_3t4/feature/guide/gt_ssh2.html\"].\r\n\r\n The SSH server is not available in all IOS images. Devices that do not  support SSH are not vulnerable. Please consult the table of fixed software in  the Software Version and Fixes section for the specific 12.4-based IOS releases  that are affected.\r\n\r\n To determine the software running on a Cisco product, log in to the  device and issue the show version command to display the  system banner. Cisco IOS software will identify itself as \"Internetwork  Operating System Software\" or simply \"IOS\". The image name will be displayed  between parentheses on the next line of output followed by \"Version\" and the  IOS release name. Other Cisco devices will not have the show version command or  will give different output.\r\n\r\nThe following example identifies a Cisco product running IOS release  12.4(17):\r\n\r\n\r\nCisco IOS Software, C2600 Software (C2600-ADVENTERPRISEK9-M), Version 12.4(17),\nRELEASE SOFTWARE (fc1) Technical Support: http://www.cisco.com/techsupport Copyright (c) 1986-2007 by Cisco Systems, Inc. Compiled Fri 07-Sep-07 16:05 by prod_rel_team  ROM: System Bootstrap, Version 12.2(8r) [cmong 8r], RELEASE SOFTWARE (fc1)  Router uptime is 1 week, 5 hours, 5 minutes System returned to ROM by power-on System image file is \"flash:c2600-adventerprisek9-mz.124-17.bin\"\r\n\r\nAdditional information about Cisco IOS release naming is available at  http://www.cisco.com/warp/public/620/1.html [\"http://www.cisco.com/warp/public/620/1.html\"].",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco devices that do not run IOS are not affected.\r\n\r\n Cisco IOS devices that do not have the SSH server feature enabled are  not affected.\r\n\r\nIOS-XR and IOS-XE images are not affected.\r\n\r\n The following IOS release trains are not affected:\r\n\r\n   10-based releases\r\n\r\n   11-based releases\r\n\r\n   12.0-based releases\r\n\r\n   12.1-based releases\r\n\r\n   12.2-based releases\r\n\r\n   12.3-based releases\r\n\r\n\r\nIOS releases prior to 12.4(7), 12.4(13d)JA, and 12.4(9)T are not  affected by this vulnerability.\r\n\r\nNo other Cisco products are currently known to be affected by these  vulnerabilities.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Secure shell (SSH) was developed as a secure replacement for the  telnet, ftp, rlogin, rsh, and rcp protocols, which allow for the remote access  of devices. The main difference between SSH and older protocols is that SSH  provides strong authentication, guarantees confidentiality, and uses encrypted  transactions.\r\n\r\nThe server side of the SSH implementation in Cisco IOS contains  multiple vulnerabilities that allow an unauthenticated user to generate a  spurious memory access or, in certain cases, reload the device. If the attacker  is able to reload the device, these vulnerabilities could be repeatedly  exploited to cause an extended Denial of Service (DoS) condition.\r\n\r\nA device with the SSH server enabled is vulnerable.\r\n\r\nThese vulnerabilities are documented in Cisco Bug IDs:\r\n\r\n     CSCsk42419  [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsk42419\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)\r\n\r\n     CSCsk60020  [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsk60020\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)\r\n\r\n     CSCsh51293  [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsh51293\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "If disabling the IOS SSH Server is not feasible, the following  workarounds may be useful to some customers in their environments.\r\n    Telnet\r\nTelnet is not vulnerable to the issue described in this advisory and  may be used as an insecure alternative to SSH. Telnet does not encrypt the  authentication information or data; therefore, it should only be enabled for  trusted local networks.\r\n    VTY Access Class\r\nIt is possible to limit the exposure of the Cisco device by applying a  VTY access class to allow only known, trusted hosts to connect to the device  via SSH.\r\n\r\nFor more information on restricting traffic to VTYs, please consult:  http://www.cisco.com/en/US/docs/ios/12_2/ipaddr/command/reference/1rfip1.html#wp1017389 [\"http://www.cisco.com/en/US/docs/ios/12_2/ipaddr/command/reference/1rfip1.html#wp1017389\"].\r\n\r\nThe following example permits access to VTYs from the 192.168.1.0/24  netblock and the single IP address 172.16.1.2 while denying access from  anywhere else:\r\n\r\n\r\nRouter(config)# access-list 1 permit 192.168.1.0 0.0.0.255\nRouter(config)# access-list 1 permit host 172.16.1.2 Router(config)# line vty 0 4 Router(config-line)# access-class 1 in\r\n\r\nDifferent Cisco platforms support different numbers of terminal lines.  Check your device's configuration to determine the correct number of terminal  lines for your platform.\r\n    Infrastructure ACLs (iACL)\r\nAlthough it is often difficult to block traffic transiting your  network, it is possible to identify traffic that should never be allowed to  target your infrastructure devices and block that traffic at the border of your  network. Infrastructure ACLs are considered a network security best practice  and should be considered as a long-term addition to good network security as  well as a workaround for this specific vulnerability. The ACL example shown  below should be included as part of the deployed infrastructure access-list,  which will protect all devices with IP addresses in the infrastructure IP  address range.\r\n\r\n A sample access list for devices running Cisco IOS is below:\r\n\r\n\r\n\n !--- Permit SSH services from trusted hosts destined  !--- to infrastructure addresses.   access-list 150 permit tcp TRUSTED_HOSTS MASK INFRASTRUCTURE_ADDRESSES MASK eq 22   !--- Deny SSH packets from all other sources destined to infrastructure addresses.   access-list 150 deny   tcp any INFRASTRUCTURE_ADDRESSES MASK eq 22   !--- Permit all other traffic to transit the device.   access-list 150 permit IP any any  interface serial 2/0   ip access-group 150 in\r\n\r\nThe white paper titled \"Protecting Your Core: Infrastructure Protection  Access Control Lists\" presents guidelines and recommended deployment techniques  for infrastructure protection access lists. This white paper can be obtained  here:  http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml\"].\r\n      Control Plane Policing (CoPP)\r\nThe Control Plane Policing (CoPP) feature may be used to mitigate these  vulnerabilities. In the following example, only SSH traffic from trusted hosts  and with 'receive' destination IP addresses is permitted to reach the route  processor (RP).\r\n\r\n Note: Dropping traffic from unknown or untrusted IP addresses may affect hosts with dynamically assigned IP addresses from connecting to the Cisco IOS device.\r\n\r\n\r\naccess-list 152 deny   tcp TRUSTED_ADDRESSES MASK any eq 22\n    access-list 152 permit tcp any any eq 22     !     class-map match-all COPP-KNOWN-UNDESIRABLE      match access-group 152     !     !     policy-map COPP-INPUT-POLICY      class COPP-KNOWN-UNDESIRABLE       drop     !     control-plane      service-policy input COPP-INPUT-POLICY\r\n\r\nIn the above CoPP example, the ACL entries that match the exploit  packets with the \"permit\" action result in these packets being discarded by the  policy-map \"drop\" function, while packets that match the \"deny\" action are not  affected by the policy-map drop function.\r\n\r\n CoPP is available in Cisco IOS release trains 12.0S, 12.2SX, 12.2S,  12.3T, 12.4, and 12.4T.\r\n\r\n Additional information on the configuration and use of the CoPP  feature can be found at the following URL:  http://www.cisco.com/en/US/prod/collateral/iosswrel/ps6537/ps6586/ps6642/prod_white_paper0900aecd804fa16a.html [\"http://www.cisco.com/en/US/prod/collateral/iosswrel/ps6537/ps6586/ps6642/prod_white_paper0900aecd804fa16a.html\"].",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, also consult  http://www.cisco.com/go/psirt [\"http://www.cisco.com/go/psirt\"]  and any subsequent advisories to determine exposure and a complete upgrade  solution.\r\n\r\nIn all cases, customers should exercise caution to be certain the  devices to be upgraded contain sufficient memory and that current hardware and  software configurations will continue to be supported properly by the new  release. If the information is not clear, contact the Cisco Technical  Assistance Center (\"TAC\") or your contracted maintenance provider for  assistance.\r\n\r\nEach row of the Cisco IOS software table (below) describes a release  train and the platforms or products for which it is intended. If a given  release train is vulnerable, then the earliest possible releases that contain  the fix (the \"First Fixed Release\") and the anticipated date of availability  for each are listed in the \"Rebuild\" and \"Maintenance\" columns. A device  running a release in the given train that is earlier than the release in a  specific column (less than the First Fixed Release) is known to be vulnerable.  The release should be upgraded at least to the indicated release or a later  version (greater than or equal to the First Fixed Release label).\r\n\r\nFor more information on the terms \"Rebuild\" and \"Maintenance,\" consult  the following URL: http://www.cisco.com/warp/public/620/1.html [\"http://www.cisco.com/warp/public/620/1.html\"].\r\n\r\nIOS releases prior to 12.4(7), 12.4(13d)JA, and 12.4(9)T are not  affected by this vulnerability.\r\n\r\n  Major Release\r\n\r\n Availability of Repaired Releases\r\n\r\n Affected 12.0-Based Releases\r\n\r\n First Fixed Release\r\n\r\n Recommended Release\r\n\r\nThere are no affected 12.0 based releases\r\n\r\n Affected 12.1-Based Releases\r\n\r\n First Fixed Release\r\n\r\n Recommended Release\r\n\r\nThere are no affected 12.1 based releases\r\n\r\n Affected 12.2-Based Releases\r\n\r\n First Fixed Release\r\n\r\n Recommended Release\r\n\r\nThere are no affected 12.2 based releases\r\n\r\n Affected 12.3-Based Releases\r\n\r\n First Fixed Release\r\n\r\n Recommended Release\r\n\r\nThere are no affected 12.3 based releases\r\n\r\n Affected 12.4-Based Releases\r\n\r\n First Fixed Release\r\n\r\n Recommended Release\r\n\r\n 12.4\r\n\r\n12.4(13f)\r\n\r\n12.4(16b)\r\n\r\n12.4(17a)\r\n\r\n12.4(18)\r\n\r\n12.4(18b)\r\n\r\n 12.4JA\r\n\r\nOnly 12.4(13d)JA and 12.4(13d)JA1 are vulnerable, all other 12.4JA releases are not affected.\r\n\r\n12.4(16b)JA3\r\n\r\n 12.4JK\r\n\r\nNot Vulnerable\r\n\r\n 12.4JMA\r\n\r\nNot Vulnerable\r\n\r\n 12.4JMB\r\n\r\nNot Vulnerable\r\n\r\n 12.4JMC\r\n\r\nNot Vulnerable\r\n\r\n 12.4JX\r\n\r\nNot Vulnerable\r\n\r\n 12.4MD\r\n\r\nNot Vulnerable\r\n\r\n 12.4MR\r\n\r\n12.4(16)MR2\r\n\r\n12.4(16)MR\r\n\r\n 12.4SW\r\n\r\n12.4(15)SW1\r\n\r\n12.4(15)SW1\r\n\r\n 12.4T\r\n\r\n12.4(9)T6\r\n\r\n12.4(11)T4\r\n\r\n12.4(15)T2\r\n\r\n12.4(20)T\r\n\r\n12.4(15)T5\r\n\r\n 12.4XA\r\n\r\nNot Vulnerable\r\n\r\n 12.4XB\r\n\r\nNot Vulnerable\r\n\r\n 12.4XC\r\n\r\nNot Vulnerable\r\n\r\n 12.4XD\r\n\r\nNot Vulnerable\r\n\r\n 12.4XE\r\n\r\nVulnerable; first fixed in 12.4T [\"#12_4T\"]\r\n\r\n12.4(15)T5\r\n\r\n 12.4XF\r\n\r\nVulnerable; first fixed in 12.4T [\"#12_4T\"]\r\n\r\n12.4(15)T5\r\n\r\n 12.4XG\r\n\r\nNot Vulnerable\r\n\r\n 12.4XJ\r\n\r\nVulnerable; first fixed in 12.4T [\"#12_4T\"]\r\n\r\n12.4(15)T5\r\n\r\n 12.4XK\r\n\r\nVulnerable; first fixed in 12.4T [\"#12_4T\"]\r\n\r\n12.4(15)T5\r\n\r\n 12.4XL\r\n\r\nNot Vulnerable\r\n\r\n 12.4XM\r\n\r\nNot Vulnerable\r\n\r\n 12.4XN\r\n\r\nNot Vulnerable\r\n\r\n 12.4XQ\r\n\r\nNot Vulnerable\r\n\r\n 12.4XT\r\n\r\nNot Vulnerable\r\n\r\n 12.4XV\r\n\r\nVulnerable; contact TAC\r\n\r\n 12.4XW\r\n\r\n12.4(11)XW6\r\n\r\n12.4(11)XW6\r\n\r\n 12.4XY\r\n\r\nNot Vulnerable\r\n\r\n 12.4XZ\r\n\r\nNot Vulnerable",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "Cisco is releasing this IOS advisory out of our normal twice yearly  cycle due to an increase in customer support cases linked to this bug. Cisco  PSIRT has not received any reports of malicious exploitation.\r\n\r\nThis vulnerability was discovered by Cisco internal testing and  customer service requests.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS Secure Shell Denial of Service Vulnerabilities",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20080521-ssh"
			}
		],
		"title": "Cisco IOS Secure Shell Denial of Service Vulnerabilities",
		"tracking": {
			"current_release_date": "2008-05-21T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:06:33+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20080521-ssh",
			"initial_release_date": "2008-05-21T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2008-05-21T16:00:00+00:00",
					"number": "1.1.0",
					"summary": "Content changes in these sections: Summary, Products Confirmed\n\t\t\t\tNot Vulnerable, and Exploitation and Public Announcements."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"cve": "CVE-2008-1159",
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Cisco IOS Secure Shell Denial of Service Vulnerabilities",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20080521-ssh"
				}
			],
			"remediations": [
				{
					"category": "workaround",
					"details": "If disabling the IOS SSH Server is not feasible, the following  workarounds may be useful to some customers in their environments.\r\n    Telnet\r\nTelnet is not vulnerable to the issue described in this advisory and  may be used as an insecure alternative to SSH. Telnet does not encrypt the  authentication information or data; therefore, it should only be enabled for  trusted local networks.\r\n    VTY Access Class\r\nIt is possible to limit the exposure of the Cisco device by applying a  VTY access class to allow only known, trusted hosts to connect to the device  via SSH.\r\n\r\nFor more information on restricting traffic to VTYs, please consult:  http://www.cisco.com/en/US/docs/ios/12_2/ipaddr/command/reference/1rfip1.html#wp1017389 [\"http://www.cisco.com/en/US/docs/ios/12_2/ipaddr/command/reference/1rfip1.html#wp1017389\"].\r\n\r\nThe following example permits access to VTYs from the 192.168.1.0/24  netblock and the single IP address 172.16.1.2 while denying access from  anywhere else:\r\n\r\n\r\nRouter(config)# access-list 1 permit 192.168.1.0 0.0.0.255\nRouter(config)# access-list 1 permit host 172.16.1.2 Router(config)# line vty 0 4 Router(config-line)# access-class 1 in\r\n\r\nDifferent Cisco platforms support different numbers of terminal lines.  Check your device's configuration to determine the correct number of terminal  lines for your platform.\r\n    Infrastructure ACLs (iACL)\r\nAlthough it is often difficult to block traffic transiting your  network, it is possible to identify traffic that should never be allowed to  target your infrastructure devices and block that traffic at the border of your  network. Infrastructure ACLs are considered a network security best practice  and should be considered as a long-term addition to good network security as  well as a workaround for this specific vulnerability. The ACL example shown  below should be included as part of the deployed infrastructure access-list,  which will protect all devices with IP addresses in the infrastructure IP  address range.\r\n\r\n A sample access list for devices running Cisco IOS is below:\r\n\r\n\r\n\n !--- Permit SSH services from trusted hosts destined  !--- to infrastructure addresses.   access-list 150 permit tcp TRUSTED_HOSTS MASK INFRASTRUCTURE_ADDRESSES MASK eq 22   !--- Deny SSH packets from all other sources destined to infrastructure addresses.   access-list 150 deny   tcp any INFRASTRUCTURE_ADDRESSES MASK eq 22   !--- Permit all other traffic to transit the device.   access-list 150 permit IP any any  interface serial 2/0   ip access-group 150 in\r\n\r\nThe white paper titled \"Protecting Your Core: Infrastructure Protection  Access Control Lists\" presents guidelines and recommended deployment techniques  for infrastructure protection access lists. This white paper can be obtained  here:  http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml [\"http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801a1a55.shtml\"].\r\n      Control Plane Policing (CoPP)\r\nThe Control Plane Policing (CoPP) feature may be used to mitigate these  vulnerabilities. In the following example, only SSH traffic from trusted hosts  and with 'receive' destination IP addresses is permitted to reach the route  processor (RP).\r\n\r\n Note: Dropping traffic from unknown or untrusted IP addresses may affect hosts with dynamically assigned IP addresses from connecting to the Cisco IOS device.\r\n\r\n\r\naccess-list 152 deny   tcp TRUSTED_ADDRESSES MASK any eq 22\n    access-list 152 permit tcp any any eq 22     !     class-map match-all COPP-KNOWN-UNDESIRABLE      match access-group 152     !     !     policy-map COPP-INPUT-POLICY      class COPP-KNOWN-UNDESIRABLE       drop     !     control-plane      service-policy input COPP-INPUT-POLICY\r\n\r\nIn the above CoPP example, the ACL entries that match the exploit  packets with the \"permit\" action result in these packets being discarded by the  policy-map \"drop\" function, while packets that match the \"deny\" action are not  affected by the policy-map drop function.\r\n\r\n CoPP is available in Cisco IOS release trains 12.0S, 12.2SX, 12.2S,  12.3T, 12.4, and 12.4T.\r\n\r\n Additional information on the configuration and use of the CoPP  feature can be found at the following URL:  http://www.cisco.com/en/US/prod/collateral/iosswrel/ps6537/ps6586/ps6642/prod_white_paper0900aecd804fa16a.html [\"http://www.cisco.com/en/US/prod/collateral/iosswrel/ps6537/ps6586/ps6642/prod_white_paper0900aecd804fa16a.html\"]."
				}
			],
			"title": "Cisco IOS SSH Server Improper Memory Access Denial of Service Vulnerability"
		}
	]
}
