{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Content Services Switch Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20010131-arrowpoint-cli-fs"
			}
		],
		"title": "Cisco Content Services Switch Vulnerability",
		"tracking": {
			"current_release_date": "2001-01-31T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:10:44+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20010131-arrowpoint-cli-fs",
			"initial_release_date": "2001-01-31T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2001-01-31T16:00:00+00:00",
					"number": "1.2.0",
					"summary": "The Software Versions and Fixes section was changed from :\n\t\t\t\t\"CSCdt08730 is resolved in revision 4.01(12s), and revision 3.10 (71s) of Cisco\n\t\t\t\tWebNS software. The file system information disclosure vulnerabilities are\n\t\t\t\tscheduled to be fixed, but are currently unresolved. Workarounds are\n\t\t\t\trecommended in the interim. This notice will be updated when the\n\t\t\t\tvulnerabilities are resolved, or monthly until the vulnerabilities are\n\t\t\t\tresolved.\"  \n\t\t\t to:  \n\t\t\t \"CSCdt08730 is resolved in revision 4.01(12s), and revision\n\t\t\t\t3.10 (71s) of Cisco WebNS software. The file system information disclosure\n\t\t\t\tvulnerabilities are resolved in revision 4.01(23s) and revision 4.10(13s).\"\n\t\t\t\t \n\t\t\t The status of this notice was changed from INTERIM to FINAL,\n\t\t\t\tand the wording under the Status of This Notice section was changed from: \"This\n\t\t\t\tis an interim notice. Although Cisco cannot guarantee the accuracy of all\n\t\t\t\tstatements in this notice, all of the facts have been checked to the best of\n\t\t\t\tour ability. Cisco anticipates issuing updated versions of this notice as the\n\t\t\t\tsoftware is updated. Cisco will update this notice by 2001-MAR-01.\"  \n\t\t\t to:  \n\t\t\t \"This is an final notice. Although Cisco cannot guarantee the\n\t\t\t\taccuracy of all statements in this notice, all of the facts have been checked\n\t\t\t\tto the best of our ability. Cisco does not anticipate issuing updated versions\n\t\t\t\tof this notice unless there is some material change in the facts. Should there\n\t\t\t\tbe a significant change in the facts, Cisco may update this notice.\""
				}
			],
			"status": "final",
			"version": "1.2.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Content Services Switch Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20010131-arrowpoint-cli-fs"
				}
			],
			"title": "Cisco Content Services Switch Contains Multiple Vulnerabilities"
		}
	]
}
