{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the EAP-FAST authentication module of Cisco Secure Access Control Server (ACS) versions 4.0 through 4.2.1.15 could allow an unauthenticated, remote attacker to execute arbitrary commands on the Cisco Secure ACS server. This vulnerability is only present when Cisco Secure ACS is configured as a RADIUS server.\n\r\n\n\r\nThe vulnerability is due to improper parsing of user identities used for EAP-FAST authentication. An attacker could exploit this vulnerability by sending crafted EAP-FAST packets to an affected device. An exploit could allow the attacker to execute arbitrary commands on the Cisco Secure ACS server and take full control of the affected server.\n\r\n\n\r\nThere are no workarounds for this vulnerability.\n\r\n\n\r\nCisco has released software updates that address this vulnerability. This advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130828-acs[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130828-acs\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "\n",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "Cisco Secure ACS for Windows versions 4.0 through 4.2.1.15 are affected by this vulnerability when configured as a RADIUS server with EAP-FAST authentication.\n\r\nCisco Secure ACS, when configured as TACACS+ server only, does not support the EAP-FAST authentication method, and is not vulnerable.\n\r\n\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco Secure Access Control Server Express, Cisco Secure Access Control Server View, and Cisco Secure Access Control System are not affected by this vulnerability. \n\r\nNo other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco Secure ACS operates as a centralized RADIUS and TACACS+ server, combining user authentication, user and administrator device access control, and policy control into a centralized identity networking solution.\n\r\n\n\r\nA vulnerability in the EAP-FAST authentication module of Cisco Secure Access Control Server (ACS) versions 4.0 through 4.2.1.15 could allow an unauthenticated, remote attacker to execute arbitrary commands on the Cisco Secure ACS server. This vulnerability is only present when Cisco Secure ACS is configured as a RADIUS server.\n\r\n\n\r\nThe vulnerability is due to improper parsing of user identities used for EAP-FAST authentication. An attacker could exploit this vulnerability by sending crafted EAP-FAST packets to an affected device. An exploit could allow the attacker to execute arbitrary commands on the Cisco Secure ACS server and take full control of the affected server.\n\r\n\n\r\nCommands are executed in the context of the System user for Cisco Secure ACS authentication service running on Microsoft Windows.\n\r\n\n\r\nCisco Secure ACS uses the standard RADIUS UDP port 1812 or 1645 for EAP-FAST authentication. \n\r\n\n\r\nThis vulnerability has been documented in Cisco bug ID CSCui57636[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCui57636\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) for the Cisco Secure ACS and has been assigned the Common Vulnerabilities and Exposures (CVE) ID CVE-2013-3466.\r\n\n\r\n\r\n\n\r\n",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds for this vulnerability.\r\n",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Notices archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers. \n\r\n\n\r\nThis vulnerability is first fixed in Cisco Secure ACS for Windows release 4.2.1.15.11.\n\r\n\n\r\nCisco Secure ACS for Windows can be downloaded from the Software Center on Cisco.com by visiting http://www.cisco.com/cisco/software/navigator.html[\"http://www.cisco.com/cisco/software/navigator.html\"] and navigating to Products > Security > Access Control and Policy > Policy and Access Management > Cisco Secure Access Control Server for Windows\r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \r\n\r\nThis vulnerability was reported to Cisco by Brad Antoniewicz from McAfee and Foundstone Professional Services. Cisco would like to thank Mr. Antoniewicz for reporting this vulnerability to us and for working with us towards coordinated disclosure of the vulnerability.\r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Secure Access Control Server Remote Command Execution Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130828-acs"
			}
		],
		"title": "Cisco Secure Access Control Server Remote Command Execution Vulnerability",
		"tracking": {
			"current_release_date": "2013-08-28T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:23:44+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20130828-acs",
			"initial_release_date": "2013-08-28T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2013-08-28T15:34:51+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Secure Access Control Server (ACS) for Windows",
						"product": {
							"name": "Cisco Secure Access Control Server (ACS) for Windows ",
							"product_id": "CSAFPID-2077"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2013-3466",
			"notes": [
				{
					"category": "other",
					"text": "CSCui57636",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-2077"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Secure Access Control Server Remote Command Execution Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130828-acs"
				}
			],
			"release_date": "2013-08-28T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for this vulnerability.\r\n"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 10,
						"vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-2077"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 10,
						"vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-2077"
					]
				}
			],
			"title": "Cisco Secure Access Control Server Remote Command Execution Vulnerability"
		}
	]
}
