{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "This is the Cisco response to research performed by Mr. Philipp Schmidt and Mr. Jens Steube from the Hashcat Project [\"http://hashcat.net/oclhashcat-plus/\"] on the weakness of Type 4 passwords on Cisco IOS and Cisco IOS XE devices. Mr. Schmidt and Mr. Steube reported this issue to the Cisco PSIRT on March 12, 2013.\r\n\r\nCisco would like to thank Mr. Schmidt and Mr. Steube for sharing their research with Cisco and working toward a coordinated disclosure of this issue.\r\n\r\nThis Cisco Security Response is available at https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130318-type4 [\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130318-type4\"]\r\n\r\nAdditional Information\r\nA limited number of Cisco IOS and Cisco IOS XE releases based  on the Cisco IOS 15 code base include support for a new algorithm to  hash user-provided plaintext passwords. This algorithm is called Type 4, and a password hashed using this algorithm is referred to as a Type 4 password.  The Type 4 algorithm was designed to be a stronger alternative to the  existing Type 5 and Type 7 algorithms to increase the resiliency of  passwords used for the enable secret password and username username secret password commands against brute-force attacks.\r\n  The design called for using Password-Based Key Derivation Function  version 2 (PBKDF2), as described in RFC 2898 section 5.2 [\"http://tools.ietf.org/html/rfc2898#section-5.2\"], with the  following input values:\r\n\r\nHash algorithm = SHA-256\r\nPassword = the user-provided plaintext password\r\nSalt = 80 bits (generated by calling a cryptographically secure random number generator)\r\nIteration count = 1,000 (one thousand)\r\n\r\nDue to an implementation issue, the Type 4 password algorithm does not use PBKDF2 and does not  use a salt, but instead performs a single iteration of SHA-256 over the  user-provided plaintext password. This approach causes a Type 4  password to be less resilient to brute-force attacks than a Type 5  password of equivalent complexity.\r\n\r\nThe following issues were also introduced because of the implementation of Type 4 passwords:\r\n\r\nA device running a Cisco IOS or IOS XE release with support for      Type 4 passwords lost the capability to create a Type 5 password from a      user-provided plaintext password\r\nBackward compatibility problems may arise when downgrading from a      device running a Cisco IOS or IOS XE release with Type 4 password      support and Type 4 passwords configured to a Cisco IOS or Cisco IOS XE      release that does not support Type 4 passwords. Depending on the      specific device configuration, the administrator may not be able to log      in to the device or to change into privileged EXEC mode, requiring a      password recovery process to be performed.\r\n\r\nAll the preceding issues apply only to devices running Cisco IOS  or Cisco IOS XE releases with support for Type 4 passwords, and only to  the \"enable secret <password>\" and \"username <username>  secret <password>\" commands. No other Cisco IOS or IOS XE  features use this algorithm to hash passwords or keys. For example,  these issues do not affect Open Shortest Path First (OSPF), Border  Gateway Protocol (BGP), Routing Information Protocol (RIP), any other  routing protocol keys, or pre-shared keys for IPsec.\r\n\r\nThese issues do not apply to devices running a Cisco IOS or Cisco IOS XE release without support for Type 4 passwords.\r\n\r\nThis issue is documented in Cisco Bug ID CSCue95644 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCue95644\"] (registered [\"https://tools.cisco.com/RPF/register/register.do\"] customers only).\r\n    Determining Whether a Cisco IOS or Cisco IOS XE Release Supports Type 4 Passwords\r\nAdministrators can use the following procedure to determine whether  the Cisco IOS or Cisco IOS XE release running on a given device includes  support for Type 4 passwords:\r\n\r\n  1) Log in to the device and execute the show version | include IOS command:\r\n\r\n\r\nrouter#show version | include IOS\r\nCisco IOS Software, 1841 Software (C1841-ADVENTERPRISEK9-M), Version 15.3(1)T, RELEASE SOFTWARE (fc1)\r\nrouter#\r\nIf the version number starts with \"15\" proceed to the next step. Otherwise, the Cisco IOS or Cisco IOS XE release running on the device does not include support for Type 4 passwords.\r\n\r\n2) While logged in to the device as a privileged user, enter configuration mode and execute an enable secret ? command:\r\nrouter#configure terminal\r\nEnter configuration commands, one per line.  End with CNTL/Z.\r\nrouter#(config)#enable secret ?\r\n  0      Specifies an UNENCRYPTED password will follow\r\n  4      Specifies an SHA256 ENCRYPTED secret will follow\r\n  5      Specifies a MD5 ENCRYPTED secret will follow\r\n  LINE   The UNENCRYPTED (cleartext) 'enable' secret\r\n  level  Set exec level password\r\n\r\nrouter(config)#\r\nIn the preceding example, the line \"4   Specifies an SHA256 ENCRYPTED secret will follow\" indicates the Cisco IOS or Cisco IOS XE release running on the device does supports Type 4 passwords.\r\nrouter#conf t\r\nEnter configuration commands, one per line.  End with CNTL/Z.\r\nrouter#(config)#enable secret ?\r\n  0      Specifies an UNENCRYPTED password will follow\r\n  5      Specifies a MD5 ENCRYPTED secret will follow\r\n  LINE   The UNENCRYPTED (cleartext) 'enable' secret\r\n  level  Set exec level password\r\n\r\nrouter(config)#\r\nIn the preceding example, there is no \"4   Specifies an SHA256 ENCRYPTED secret will follow\" in the help output of the enable secret command. This output indicates the Cisco IOS or Cisco IOS XE release running on this device does not support Type 4 passwords.\r\nDetermining Whether a Device Has Any Type 4 Passwords Configured  A device running a Cisco IOS or Cisco IOS XE release with support for  Type 4 passwords may not actually have any Type 4 passwords in the  device configuration. A device that was upgraded from a Cisco IOS or  Cisco IOS XE release without support for Type 4 passwords to a Cisco IOS  or Cisco IOS XE release that does support Type 4 passwords may contain  an enable secret password command and zero or more username username secret password commands that have Type 5 passwords because they were configured before the upgrade.\r\n\r\nThe following command can be used to determine whether any Type 4 passwords are present on the device configuration:\r\nshow running-config | include ^(enable secret 4|username.*secret.4)\r\nThe following example shows a device without any Type 4 passwords configured:\r\nrouter#show running-config | include ^(enable secret 4|username.*secret.4)\r\nrouter#\r\nThe following example shows a device with Type 4  passwords configured for both the \"enable secret <password>\" and  the \"username <username> secret <password>\" commands. The presence of a Type 4 password is indicated by the number 4 that immediately follows the secret keyword:\r\nrouter#show running-config | include ^(enable secret 4|username.*secret.4)\r\nenable secret 4 ohKCwRDiX5YiRkTbLspqXvQkxiL91lDUlt.JzPd33RY\r\nusername demo secret 4 ohKCwRDiX5YiRkTbLspqXvQkxiL91lDUlt.JzPd33RY\r\nrouter#\r\n  Behavior of a Cisco IOS or Cisco IOS XE Release with Support for Type 4 Passwords  A device running a Cisco IOS or Cisco IOS XE release with support for Type 4 passwords will exhibit the following behavior:\r\n\r\n1) Configuring an enable secret password or username username secret password command (with password being a plaintext password) will cause a Type 4 password to be generated:\r\nrouter#configure terminal\r\nEnter configuration commands, one per line.  End with CNTL/Z.\r\nrouter(config)#enable secret Th1z#1s+53kri7\r\nrouter(config)#username demo secret Th1z#1s+53kri7\r\nrouter(config)#do show running-config | include ^(enable|username)\r\nenable secret 4 ohKCwRDiX5YiRkTbLspqXvQkxiL91lDUlt.JzPd33RY\r\nusername demo secret 4 ohKCwRDiX5YiRkTbLspqXvQkxiL91lDUlt.JzPd33RY\r\nrouter(config)#\r\nNote: There is no way to supply a plaintext password as an argument to either the enable secret password or username username secret password and indicate that a Type 5 password should be generated. The only way to configure either an enable secret password or username username secret password with a Type 5 password is using the enable secret 5 password or username username secret 5 password commands, where password is a previously generated Type 5 password.\r\n\r\n2) Configuring an enable secret 5 password or username username secret 5 password (where password  is a previously generated Type 5 password) will result in a warning,  but the password will be correctly parsed, added to the configuration,  and fully functional. The generated warning can safely be ignored. An  example follows:\r\nrouter#configure terminal\r\nEnter configuration commands, one per line.  End with CNTL/Z.\r\nrouter(config)#enable secret 5 $1$YXEj$Fr7OC1Jh62xJRb/rdIm9d0\r\n Warning: The CLI will be deprecated soon\r\n 'enable secret 5 $1$YXEj$Fr7OC1Jh62xJRb/rdIm9d0'\r\n Please move to 'enable secret <password>' CLI\r\nrouter(config)#username demo secret 5 $1$Gd0I$VJkZkCRG1d1FvY7we7dzM.\r\n Warning: MD5 encryption will be deprecated soon.Please move to SHA256 encryption.\r\nrouter(config)#do show running-config | include ^(enable|username)\r\nenable secret 5 $1$YXEj$Fr7OC1Jh62xJRb/rdIm9d0\r\nusername demo secret 5 $1$Gd0I$VJkZkCRG1d1FvY7we7dzM.\r\nrouter(config)#\r\n3) If the device was upgraded from a previous Cisco IOS or Cisco IOS XE release without support for Type 4 passwords, and the configuration included the commands enable secret 5 password or  username username secret 5 password, those Type 5 passwords will be parsed, added to the configuration, and fully functional. There  is no automatic conversion of existing Type 5 passwords to Type 4  passwords after upgrading a device to a Cisco IOS or Cisco IOS XE  release that has support for Type 4 passwords.\r\nReplacing a Type 4 Password with a Type 5 Password  Customers running a Cisco IOS or Cisco IOS XE release with support for  Type 4 passwords and currently using Type 4 passwords on their device  configuration may want to replace those Type 4 passwords with Type 5  passwords. Reasons include the following:\r\n\r\nPreparation for a device downgrade to a Cisco IOS or Cisco IOS XE release that does not support Type 4 passwords\r\nCompatibility with network management systems or other tools      that cannot handle a device configuration that includes Type 4 passwords\r\nAn organizational security policy that dictates the use of Type 5 passwords\r\nConcerns about the resiliency of Type 4 passwords versus Type 5 passwords against brute-force attacks\r\n  As mentioned previously, a Cisco IOS or Cisco IOS XE release with support for Type 4 passwords does not allow the generation of a Type 5 password from a plaintext password on the device itself.  Customers who need to replace a Type 4 password with a Type 5 password  must generate the Type 5 password outside the device and then copy the  Type 5 password to the device configuration.\r\n\r\nThere are two options to generate a Type 5 password:\r\n\r\nUsing another device running a Cisco IOS or Cisco IOS XE release without Type 4 support\r\nUsing the openssl command-line tool (part of the OpenSSL Project)\r\n  In either case, administrators will need access to the plaintext version of the password to generate the Type 5 password.\r\nUsing Another Device to Generate a Type 5 Password  1) Either the enable secret password or the username username secret password  command can be used to generate a Type 5 password from a plaintext  password. The administrator must log in to the device using credentials  that allow the administrator to go into configuration mode and execute  the chosen command. The following example shows the username username secret password command and the string Th1z#1s+53kri7 as the plaintext password:\r\nrouter#configure terminal\r\nEnter configuration commands, one per line.  End with CNTL/Z.\r\nrouter(config)#username demo secret Th1z#1s+53kri7\r\nrouter(config)#do show running-config | include username demo.*secret 5\r\nusername demo secret 5 $1$M/wf$iqBnv/g3GuVUsCpWcDFS20\r\nrouter(config)#no username demo\r\nrouter(config)#\r\n2) Copy the resulting Type 5 password (which is $1$M/wf$iqBnv/g3GuVUsCpWcDFS20 in the preceding example).\r\nUsing the openssl Tool to Generate a Type 5 Password  1) The openssl tool can generate a Type 5 password when using a specific set of command-line arguments, as follows:\r\nopenssl passwd -salt `openssl rand -base64 3` -1 PLAINTEXT_PASSWORD\r\nAdministrators must replace the string PLAINTEXT_PASSWORD with the appropriate plaintext password. The following example uses the string Th1z#1s+53kri7 as the plaintext password:\r\nhostname$ openssl passwd -salt `openssl rand -base64 3` -1 Th1z#1s+53kri7\r\n$1$dxVt$FSJmj1O6JUZdbUjxZkIuD.\r\n2) Copy the resulting Type 5 password (which is $1$dxVt$FSJmj1O6JUZdbUjxZkIuD. in the preceding example).\r\n\r\nNote: Depending on the characters in the plaintext password, you may need to enclose it between quotes.\r\nCopying the Type 5 Password to the Targeted Device  Paste the previously generated Type 5 password into the appropriate command, either enable secret 5 password or username username secret 5 password. Remember to specify the type of encryption by adding the number 5 after the secret keyword in both commands. Otherwise, the provided password will be interpreted as a plaintext password.\r\n\r\nThe following example uses the Type 5 password generated on another device as the enable secret password, and the Type 5 password generated by openssl becomes the user password for the user named demo:\r\nrouter#configure terminal\r\nEnter configuration commands, one per line.  End with CNTL/Z.\r\nrouter(config)#username demo secret 5 $1$dxVt$FSJmj1O6JUZdbUjxZkIuD.\r\n Warning: MD5 encryption will be deprecated soon.Please move to SHA256 encryption.\r\nrouter(config)#enable secret 5 $1$M/wf$iqBnv/g3GuVUsCpWcDFS20\r\n Warning: The CLI will be deprecated soon\r\n 'enable secret 5 $1$M/wf$iqBnv/g3GuVUsCpWcDFS20'\r\n Please move to 'enable secret <password>' CLI\r\nrouter(config)#\r\n\r\nNotes\r\n\r\nA deprecation warning will be generated when using a Type 5 password for either the enable secret 5 command or the username username secret 5 password command. This warning can be safely ignored.\r\nIf the deprecation warning for either the enable secret 5 command or the username username secret 5 password command does not occur, the device is not interpreting the provided password as a Type 5 password. Make sure the number 5 is included after the secret keyword in either command.\r\n  The Future of Type 4 Passwords on Cisco IOS and Cisco IOS XE  Because of the issues discussed in this Security Response, Cisco is  taking the following actions for future Cisco IOS and Cisco IOS XE  releases:\r\n\r\nType 4 passwords will be deprecated: Future Cisco IOS and Cisco      IOS XE releases will not generate Type 4 passwords. However, to maintain      backward compatibility, existing Type 4 passwords will be parsed and      accepted. Customers will need to manually remove the existing Type 4      passwords from their configuration.\r\nThe enable secret password and username username secret password      commands will revert to their original behavior: Both commands, when      provided with a plaintext password, will generate a Type 5 password.      This will be the same behavior as before the introduction of Type 4      passwords. This step is being taken to preserve backward compatibility.\r\nType 5 passwords will not be deprecated: This will be done to      preserve backward compatibility. The deprecation warning for Type 5      passwords will be removed.\r\nA new password type will be introduced: This new password type      will implement the original design intended for Type 4 passwords, which      is PBKDF2 with SHA-256, an 80-bit salt, and 1,000 iterations. The exact      type is yet to be determined.\r\nNew command-line interface commands will be introduced: The new      commands will allow Cisco customers to configure the new password type      for both enable secret password and username username secret password.      This will allow Cisco customers to gradually migrate to the new      password type, while allowing them to use the existing syntax to      preserve backward compatibility. The exact syntax for the new commands      is yet to be determined.\r\n  Affected Cisco IOS and Cisco IOS XE Releases  The following table lists the Cisco IOS and Cisco IOS XE releases affected by this issue as of March 22, 2013:\r\n\r\n                              Affected 15.0-Based Cisco IOS and Cisco IOS XE Releases              Affected Cisco IOS and Cisco IOS XE Versions                                  15.0EA              15.0(2)EA                                  15.0EB              15.0(2)EB                                  15.0EC              15.0(2)EC                                  15.0ED              15.0(2)ED                                  15.0EX              15.0(1)EX, 15.0(1)EX1, 15.0(2)EX, 15.0(2)EX1                                  15.0EY              15.0(2)EY, 15.0(2)EY1                                  15.0EZ              15.0(1)EZ, 15.0(2)EZ                                  15.0MR              15.0(1)MR, 15.0(2)MR                                  15.0MRA              15.0(1)MRA                                  15.0S              15.0(1)S, 15.0(1)S1, 15.0(1)S10, 15.0(1)S2, 15.0(1)S3a, 15.0(1)S4, 15.0(1)S4a, 15.0(1)S5, 15.0(1)S6                                  15.0SE              15.0(2)SE, 15.0(2)SE1, 15.0(2)SE2, 15.0(2)SE3, 15.0(2)SE4                                  Affected 15.1-Based Cisco IOS and Cisco IOS XE Releases              Affected Cisco IOS and Cisco IOS XE Versions                                  15.1EY              15.1(2)EY, 15.1(2)EY1, 15.1(2)EY1a, 15.1(2)EY2, 15.1(2)EY2a, 15.1(2)EY3, 15.1(2)EY4                                  15.1GC              15.1(4)GC, 15.1(4)GC1                                  15.1M              15.1(4)M10, 15.1(4)M4, 15.1(4)M5, 15.1(4)M6, 15.1(4)M7, 15.1(4)M8                                  15.1MR              15.1(1)MR, 15.1(1)MR1, 15.1(1)MR2, 15.1(1)MR3, 15.1(1)MR4, 15.1(1)MR5, 15.1(1)MR6, 15.1(3)MR                                  15.1MRA              15.1(3)MRA, 15.1(3)MRA1                                  15.1S              15.1(1)S, 15.1(1)S1, 15.1(1)S2, 15.1(2)S, 15.1(2)S1,              15.1(2)S2, 15.1(3)S, 15.1(3)S0a, 15.1(3)S1, 15.1(3)S2, 15.1(3)S3,              15.1(3)S4, 15.1(3)S5, 15.1(3)S6                                  15.1SA              15.1(1)SA, 15.1(1)SA1, 15.1(1)SA2                                  15.1SG              15.1(1)SG, 15.1(1)SG1, 15.1(1)SG2, 15.1(2)SG, 15.1(2)SG1                                  15.1SNG              15.1(2)SNG                                  15.1SNH              15.1(2)SNH, 15.1(2)SNH1                                  15.1SNI              15.1(2)SNI                                  15.1SVA              15.1(3)SVA                                  15.1SVB              15.1(3)SVB, 15.1(3)SVB1                                  15.1SVC              15.1(3)SVC                                  15.1XB              15.1(4)XB8, 15.1(4)XB8a                                  Affected 15.2-Based Cisco IOS and Cisco IOS XE Releases              Affected Cisco IOS and Cisco IOS XE Versions                                  15.2E              15.2(1)E, 15.2(2)E                                  15.2GC              15.2(2)GC, 15.2(3)GC, 15.2(3)GC1                                  15.2GCA              15.2(3)GCA, 15.2(3r)GCA                                  15.2JA              15.2(4)JA                                  15.2M              15.2(4)M, 15.2(4)M1, 15.2(4)M10, 15.2(4)M2, 15.2(4)M3, 15.2(4)M4, 15.2(4)M5, 15.2(4)M6, 15.2(4)M7, 15.2(4)M8, 15.2(4)M9                                  15.2S              15.2(1)S, 15.2(1)S0a, 15.2(1)S1, 15.2(1)S2, 15.2(2)S,              15.2(2)S0a, 15.2(2)S0b, 15.2(2)S0c, 15.2(2)S0d, 15.2(2)S1, 15.2(2)S2,              15.2(4)S, 15.2(4)S0c, 15.2(4)S0xb, 15.2(4)S1, 15.2(4)S1c, 15.2(4)S2,              15.2(4)S2t, 15.2(4)S3, 15.2(4)S4, 15.2(4)S5, 15.2(4)S6                                  15.2SA              15.2(1)SA, 15.2(2)SA                                  15.2SB              15.2(1)SB, 15.2(1)SB1, 15.2(1)SB2, 15.2(1)SB3, 15.2(1)SB4                                  15.2SC              15.2(1)SC, 15.2(1)SC1                                  15.2SNG              15.2(2)SNG                                  15.2SNH              15.2(2)SNH, 15.2(2)SNH1                                  15.2SNI              15.2(2)SNI                                  15.2T              15.2(2)T1, 15.2(2)T2, 15.2(2)T3, 15.2(2)T4, 15.2(3)T1, 15.2(3)T2, 15.2(3)T3, 15.2(3)T4                                  15.2XB              15.2(4)XB10, 15.2(4)XB11                                  Affected 15.3-Based Cisco IOS and Cisco IOS XE Releases              Affected Cisco IOS and Cisco IOS XE Versions                                  15.3T              15.3(1)T, 15.3(1)T1, 15.3(1)T2, 15.3(1)T3, 15.3(1)T4, 15.3(2)T, 15.3(2)T1, 15.3(2)T2                                  15.3S              15.3(1)S, 15.3(2)S, 15.3(3)S                                  Affected 15.4-Based Cisco IOS and Cisco IOS XE Releases              Affected Cisco IOS and Cisco IOS XE Versions                                  15.4S              15.4(1)S\r\n\r\nCisco Security Procedures\r\nComplete information on reporting security vulnerabilities in Cisco  products, obtaining assistance with security incidents, and registering to  receive security information from Cisco, is available on Cisco's worldwide  website at  http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"].  This includes instructions for press inquiries regarding Cisco security  notices. All Cisco security advisories are available at  http://www.cisco.com/go/psirt [\"http://www.cisco.com/go/psirt\"].",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA standalone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy and may lack important information or contain factual errors. The information in this document is intended for end users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS and Cisco IOS XE Type 4 Passwords Issue",
				"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130318-type4"
			}
		],
		"title": "Cisco IOS and Cisco IOS XE Type 4 Passwords Issue",
		"tracking": {
			"current_release_date": "2015-04-07T19:54:00+00:00",
			"generator": {
				"date": "2022-07-15T02:17:54+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20130318-type4",
			"initial_release_date": "2013-03-18T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2015-04-07T19:54:38+00:00",
					"number": "1.2.0",
					"summary": "Corrected reference to PBKDF2 on RFC-2898."
				}
			],
			"status": "final",
			"version": "1.2.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Cisco IOS and Cisco IOS XE Type 4 Passwords Issue",
					"url": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130318-type4"
				}
			],
			"release_date": "2013-03-18T16:00:00+00:00",
			"title": "Cisco IOS and Cisco IOS XE Type 4 Passwords Issue"
		}
	]
}
