{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "A vulnerability in the Zone-Based Firewall (ZBFW) component of Cisco IOS Software could allow an unauthenticated, remote attacker to cause an affected device to hang or reload.    The vulnerability is due to improper processing of specific HTTP packets when the device is configured for either Cisco IOS Content Filtering or HTTP application layer gateway (ALG) inspection. An attacker could exploit this vulnerability by sending specific HTTP packets through an affected device. An exploit could allow the attacker to cause an affected device to hang or reload.\r\n\r\nCisco has released software updates that address this vulnerability.\r\n\r\nWorkarounds that mitigate this vulnerability are not available.\r\n\r\nThis advisory is available at the following link:\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130925-cce [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130925-cce\"]\r\nNote: The September 25, 2013, Cisco IOS Software Security Advisory bundled publication includes eight Cisco Security Advisories. All advisories address vulnerabilities in Cisco IOS Software. Each Cisco IOS Software Security Advisory lists the Cisco IOS Software releases that correct the vulnerability or vulnerabilities detailed in the advisory as well as the Cisco IOS Software releases that correct all Cisco IOS Software vulnerabilities in the September 2013 bundled publication.\r\n\r\nIndividual publication links are in \"Cisco Event Response: Semiannual Cisco IOS Software Security Advisory Bundled Publication\" at the following link:\r\n\r\nhttp://www.cisco.com/web/about/security/intelligence/Cisco_ERP_sep13.html [\"http://www.cisco.com/web/about/security/intelligence/Cisco_ERP_sep13.html\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco devices that are running affected Cisco IOS Software versions are vulnerable when HTTP ALG inspection or Cisco IOS Content Filtering is configured under the ZBFW.\r\n\r\nTo verify whether the HTTP ALG inspection under the ZBFW is configured on a device use the show running-config command.  If the service policy that is attached to any zone contains a policy map that contains the command service-policy http name then the device is configured for HTTP ALG. The following is the output from the show running-config command executed on a device running Cisco IOS Software that has the HTTP ALG inspection enabled under the ZBFW configuration:\r\nios-fw#show running-config\r\n  < output removed for brevity >    policy-map type inspect in->out   class type inspect filtered-hosts    inspect    service-policy http http_bad   class class-default    drop  !  zone security inside  zone security outside  zone-pair security in-to-out source inside destination outside   service-policy type inspect in->out\r\n\r\n< output removed for brevity >\r\nios-fw#\r\n\r\n\r\n  To verify whether Cisco IOS Content Filtering under the ZBFW is configured on a device use the show policy-map type inspect zone-pair urlfilter | include URL Filtering privileged EXEC command and check for output.  A blank line indicates that the feature is not enabled.  Output with URL Filtering is in indicates the device is configured with Cisco IOS Content Filtering under ZBFW.  The following is the output from the show policy-map type inspect zone-pair urlfilter | include URL Filtering command executed on a device running Cisco IOS Software that has Cisco IOS Content Filtering enabled under the ZBFW configuration:\r\nios-fw#show policy-map type inspect zone-pair urlfilter | include URL Filtering\r\n        URL Filtering is in\r\nios-fw#\r\nNote: Cisco IOS Content Filtering using ip inspect and ip urlfilter commands are not affected.\r\nTo determine the Cisco IOS Software release that is running on a Cisco product, administrators can log in to the device and issue the show version command to display the system banner. The system banner confirms that the device is running Cisco IOS Software by displaying text similar to \"Cisco Internetwork Operating System Software\" or \"Cisco IOS Software.\" The image name displays in parentheses, followed by \"Version\" and the Cisco IOS Software release name. Other Cisco devices do not have the show version command or may provide different output.\r\n\r\nThe following example identifies a Cisco product that is running Cisco IOS Software Release 15.0(1)M1 with an installed image name of C3900-UNIVERSALK9-M:\r\n\r\nRouter> show version\r\nCisco IOS Software, C3900 Software (C3900-UNIVERSALK9-M), Version 15.0(1)M1, RELEASE SOFTWARE (fc1)\r\nTechnical Support: http://www.cisco.com/techsupport\r\nCopyright (c) 1986-2009 by Cisco Systems, Inc.\r\nCompiled Wed 02-Dec-09 17:17 by prod_rel_team\r\n!--- output truncated\r\nAdditional information about Cisco IOS Software release naming conventions is available in \"White Paper: Cisco IOS and NX-OS Software Reference Guide\" at http://www.cisco.com/web/about/security/intelligence/ios-ref.html [\"http://www.cisco.com/web/about/security/intelligence/ios-ref.html\"].",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "Cisco IOS XR Software is not affected by this vulnerability.\r\n\r\nCisco IOS XE Software is not affected by this vulnerability.\r\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "A vulnerability in the Zone-Based Firewall (ZFW) component of Cisco IOS Software could allow an unauthenticated, remote attacker to cause an affected device to hang or reload.\r\n\r\nThe vulnerability is due to improper processing of specific HTTP packets when the device is configured for content filtering or HTTP application layer gateway inspection. An attacker could exploit this vulnerability by sending specific HTTP packets through an affected device. An exploit could allow the attacker to cause an affected device to hang or reload.\r\nOnly transit traffic can trigger this vulnerability; HTTP traffic destined to a vulnerable device cannot trigger this vulnerability.\r\n\r\nIn devices that meet the vulnerable configuration criteria, valid HTTP packets could trigger this vulnerability.   This vulnerability can only be exploited with IPv4 traffic.  IPv6 traffic cannot be used to exploit this vulnerability.\r\n\r\nThis vulnerability has been documented in Cisco Bug ID CSCtx56174 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCtx56174\"] (registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned the Common Vulnerabilities and Exposures (CVE) ID CVE-2013-5476.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "Workarounds that mitigate this vulnerability are not available.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Notices archive at http://www.cisco.com/go/psirt [\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution.\r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers.\r\nCisco IOS Software\r\nEach row of the following Cisco IOS Software table corresponds to a Cisco IOS Software train. If a particular train is vulnerable, the earliest releases that contain the fix are listed in the First Fixed Release column. The First Fixed Release for All Advisories in the September 2013 Bundled Publication column lists the earliest possible releases that correct all the published vulnerabilities in the Cisco IOS Software Security Advisory bundled publication. Cisco recommends upgrading to the latest available release where possible.\r\n\r\nThe Cisco IOS Software Checker allows customers to search for Cisco Security Advisories that address specific Cisco IOS Software releases. This tool is available on the Cisco Security (SIO) portal at http://tools.cisco.com/security/center/selectIOSVersion.x [\"http://tools.cisco.com/security/center/selectIOSVersion.x\"]\r\n                               Major Release                   Availability of Repaired Releases                                  Affected 12.0-Based Releases              First Fixed Release              First Fixed Release for All Advisories in the September 2013 Cisco IOS Software Security Advisory Bundled Publication                                  There are no affected 12.0 based releases                                  Affected 12.2-Based Releases              First Fixed Release              First Fixed Release for All Advisories in the September 2013 Cisco IOS Software Security Advisory Bundled Publication                                  There are no affected 12.2 based releases                                  Affected 12.3-Based Releases              First Fixed Release              First Fixed Release for All Advisories in the September 2013 Cisco IOS Software Security Advisory Bundled Publication                                  There are no affected 12.3 based releases                                  Affected 12.4-Based Releases              First Fixed Release              First Fixed Release for All Advisories in the September 2013 Cisco IOS Software Security Advisory Bundled Publication                                  There are no affected 12.4 based releases                                  Affected 15.0-Based Releases              First Fixed Release              First Fixed Release for All Advisories in the September 2013 Cisco IOS Software Security Advisory Bundled Publication                                  There are no affected 15.0 based releases                                  Affected 15.1-Based Releases              First Fixed Release              First Fixed Release for All Advisories in the September 2013 Cisco IOS Software Security Advisory Bundled Publication                                   15.1EY              Not vulnerable\r\n              Vulnerable; First fixed in Release 15.2S [\"#15_2S\"]\r\n                                   15.1GC              Vulnerable; First fixed in Release 15.1M [\"#15_1M\"]\r\nReleases up to and including 15.1(2)GC2 are not vulnerable.\r\n              Vulnerable; First fixed in Release 15.1M [\"#15_1M\"]\r\n                                   15.1M              Releases including and prior to 15.1(4)M1 are not vulnerable. First fixed in 15.1(4)M6.\r\n              15.1(4)M7\r\n                                   15.1MR              Not vulnerable\r\n              Vulnerable; contact your support organization per the instructions in Obtaining Fixed Software [\"#fixes\"] section of this advisory.\r\n                                   15.1MRA              Not vulnerable\r\n              15.1(3)MRA2\r\n                                   15.1S              Not vulnerable\r\nCisco IOS XE devices: Please see Cisco IOS XE Software Availability [\"#iosxe\"]\r\n              15.1(3)S6\r\nCisco IOS XE devices: Please see Cisco IOS XE Software Availability [\"#iosxe\"]                                    15.1SG              Not vulnerable\r\nCisco IOS XE devices: Please see Cisco IOS XE Software Availability [\"#iosxe\"]\r\n              15.1(2)SG1\r\nCisco IOS XE devices: Please see Cisco IOS XE Software Availability [\"#iosxe\"]                                    15.1SNG              Not vulnerable\r\n              Vulnerable; contact your support organization per the instructions in Obtaining Fixed Software [\"#fixes\"] section of this advisory.\r\n                                   15.1SNH              Not vulnerable\r\n              Vulnerable; contact your support organization per the instructions in Obtaining Fixed Software [\"#fixes\"] section of this advisory.\r\n                                   15.1SNI              Not vulnerable\r\n              Vulnerable; contact your support organization per the instructions in Obtaining Fixed Software [\"#fixes\"] section of this advisory.\r\n                                   15.1SVD              Not vulnerable\r\n              Not vulnerable\r\n                                   15.1SVE              Not vulnerable\r\n              Not vulnerable\r\n                                   15.1SVF              Not vulnerable\r\n              Not vulnerable\r\n                                   15.1SY              Not vulnerable\r\n                            15.1(1)SY2; Available on 28-OCT-13\r\n15.1(2)SY                                     15.1T              Not vulnerable\r\n              Vulnerable; First fixed in Release 15.1M [\"#15_1M\"]\r\n                                   15.1XO              Not vulnerable\r\n              Not vulnerable\r\n                                  Affected 15.2-Based Releases              First Fixed Release              First Fixed Release for All Advisories in the September 2013 Cisco IOS Software Security Advisory Bundled Publication                                   15.2E              Not vulnerable\r\n              Not vulnerable\r\n                                   15.2GC              15.2(4)GC\r\n              Vulnerable; migrate to any release in 15.4T\r\n                                   15.2JA              Not vulnerable\r\n              15.2(4)JA1\r\n                                   15.2JAX              Not vulnerable\r\n              Vulnerable; contact your support organization per the instructions in Obtaining Fixed Software [\"#fixes\"] section of this advisory.\r\n                                   15.2JB              Not vulnerable\r\n              15.2(2)JB2\r\n                                   15.2JN              Not vulnerable\r\n              Not vulnerable\r\n                                   15.2M              Not vulnerable\r\n              15.2(4)M4\r\n                                   15.2S              Not vulnerable\r\nCisco IOS XE devices: Please see Cisco IOS XE Software Availability [\"#iosxe\"]\r\n                            15.2(4)S4\r\nCisco IOS XE devices: Please see Cisco IOS XE Software Availability [\"#iosxe\"]                                    15.2SA              Not vulnerable\r\n              15.2(2)SA\r\n                                   15.2SNG              Not vulnerable\r\n              Vulnerable; contact your support organization per the instructions in Obtaining Fixed Software [\"#fixes\"] section of this advisory.\r\n                                   15.2SNH              Not vulnerable\r\n              Vulnerable; contact your support organization per the instructions in Obtaining Fixed Software [\"#fixes\"] section of this advisory.\r\n                                   15.2SNI              Not vulnerable\r\n              Vulnerable; First fixed in Release 15.3S [\"#15_3S\"]\r\n                                   15.2T              15.2(1)T4\r\n15.2(3)T4\r\n              15.2(3)T4\r\n                                  Affected 15.3-Based Releases              First Fixed Release              First Fixed Release for All Advisories in the September 2013 Cisco IOS Software Security Advisory Bundled Publication                                  There are no affected 15.3 based releases                    Cisco IOS XE Software  Cisco IOS XE Software is not affected by the vulnerability disclosed in this advisory.  Cisco IOS XR Software  Cisco IOS XR Software is not affected by any of the vulnerabilities that are disclosed in the September 2013 Cisco IOS Software Security Advisory Bundled Publication.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory.\r\n\r\nThis vulnerability was discovered when handling customer service requests.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco IOS Software Zone-Based Firewall and Content Filtering Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130925-cce"
			}
		],
		"title": "Cisco IOS Software Zone-Based Firewall and Content Filtering Vulnerability",
		"tracking": {
			"current_release_date": "2013-09-25T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:23:31+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20130925-cce",
			"initial_release_date": "2013-09-25T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2013-09-24T16:23:43+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"branches": [
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "15.1(4)XB6",
										"product": {
											"name": "15.1(4)XB6",
											"product_id": "CSAFPID-111884"
										}
									},
									{
										"category": "service_pack",
										"name": "15.1(4)XB7",
										"product": {
											"name": "15.1(4)XB7",
											"product_id": "CSAFPID-114012"
										}
									},
									{
										"category": "service_pack",
										"name": "15.1(4)XB8",
										"product": {
											"name": "15.1(4)XB8",
											"product_id": "CSAFPID-115982"
										}
									},
									{
										"category": "service_pack",
										"name": "15.1(4)XB8a",
										"product": {
											"name": "15.1(4)XB8a",
											"product_id": "CSAFPID-116254"
										}
									}
								],
								"category": "product_version",
								"name": "15.1XB"
							},
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "15.1(4)M3",
										"product": {
											"name": "15.1(4)M3",
											"product_id": "CSAFPID-105332"
										}
									},
									{
										"category": "service_pack",
										"name": "15.1(4)M2",
										"product": {
											"name": "15.1(4)M2",
											"product_id": "CSAFPID-107858"
										}
									},
									{
										"category": "service_pack",
										"name": "15.1(4)M5",
										"product": {
											"name": "15.1(4)M5",
											"product_id": "CSAFPID-108308"
										}
									},
									{
										"category": "service_pack",
										"name": "15.1(4)M4",
										"product": {
											"name": "15.1(4)M4",
											"product_id": "CSAFPID-108614"
										}
									},
									{
										"category": "service_pack",
										"name": "15.1(4)M3a",
										"product": {
											"name": "15.1(4)M3a",
											"product_id": "CSAFPID-114167"
										}
									}
								],
								"category": "product_version",
								"name": "15.1M"
							},
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "15.1(4)GC",
										"product": {
											"name": "15.1(4)GC",
											"product_id": "CSAFPID-185352"
										}
									},
									{
										"category": "service_pack",
										"name": "15.1(4)GC1",
										"product": {
											"name": "15.1(4)GC1",
											"product_id": "CSAFPID-187826"
										}
									}
								],
								"category": "product_version",
								"name": "15.1GC"
							},
							{
								"branches": [
									{
										"category": "service_pack",
										"name": "15.2(1)GC",
										"product": {
											"name": "15.2(1)GC",
											"product_id": "CSAFPID-109702"
										}
									},
									{
										"category": "service_pack",
										"name": "15.2(1)GC1",
										"product": {
											"name": "15.2(1)GC1",
											"product_id": "CSAFPID-113019"
										}
									},
									{
										"category": "service_pack",
										"name": "15.2(1)GC2",
										"product": {
											"name": "15.2(1)GC2",
											"product_id": "CSAFPID-113967"
										}
									},
									{
										"category": "service_pack",
										"name": "15.2(2)GC",
										"product": {
											"name": "15.2(2)GC",
											"product_id": "CSAFPID-116219"
										}
									},
									{
										"category": "service_pack",
										"name": "15.2(3)GC",
										"product": {
											"name": "15.2(3)GC",
											"product_id": "CSAFPID-116726"
										}
									},
									{
										"category": "service_pack",
										"name": "15.2(3)GC1",
										"product": {
											"name": "15.2(3)GC1",
											"product_id": "CSAFPID-189765"
										}
									}
								],
								"category": "product_version",
								"name": "15.2GC"
							}
						],
						"category": "product_family",
						"name": "IOS"
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2013-5476",
			"notes": [
				{
					"category": "other",
					"text": "CSCtx56174",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-105332",
					"CSAFPID-107858",
					"CSAFPID-108308",
					"CSAFPID-108614",
					"CSAFPID-109702",
					"CSAFPID-111884",
					"CSAFPID-113019",
					"CSAFPID-113967",
					"CSAFPID-114012",
					"CSAFPID-114167",
					"CSAFPID-115982",
					"CSAFPID-116219",
					"CSAFPID-116254",
					"CSAFPID-116726",
					"CSAFPID-185352",
					"CSAFPID-187826",
					"CSAFPID-189765"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco IOS Software Zone-Based Firewall and Content Filtering Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130925-cce"
				}
			],
			"release_date": "2013-09-25T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "Workarounds that mitigate this vulnerability are not available."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-105332",
						"CSAFPID-107858",
						"CSAFPID-108308",
						"CSAFPID-108614",
						"CSAFPID-109702",
						"CSAFPID-111884",
						"CSAFPID-113019",
						"CSAFPID-113967",
						"CSAFPID-114012",
						"CSAFPID-114167",
						"CSAFPID-115982",
						"CSAFPID-116219",
						"CSAFPID-116254",
						"CSAFPID-116726",
						"CSAFPID-185352",
						"CSAFPID-187826",
						"CSAFPID-189765"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.8,
						"vectorString": "AV:N/AC:L/Au:N/C:N/I:N/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-105332",
						"CSAFPID-107858",
						"CSAFPID-108308",
						"CSAFPID-108614",
						"CSAFPID-109702",
						"CSAFPID-111884",
						"CSAFPID-113019",
						"CSAFPID-113967",
						"CSAFPID-114012",
						"CSAFPID-114167",
						"CSAFPID-115982",
						"CSAFPID-116219",
						"CSAFPID-116254",
						"CSAFPID-116726",
						"CSAFPID-185352",
						"CSAFPID-187826",
						"CSAFPID-189765"
					]
				}
			],
			"title": "Cisco IOS Software Zone-Based Firewall and Content Filtering Vulnerability"
		}
	]
}
