{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Cisco Wide Area Application Services (WAAS) Mobile contains a vulnerability that could allow an unauthenticated, remote attacker to execute arbitrary code on the Cisco WAAS Mobile server with the privileges of the Microsoft Internet Information Services (IIS) web server.\n\r\n\n\r\nCisco has released software updates that address this vulnerability.\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20131106-waasm[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20131106-waasm\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "Cisco WAAS Mobile server versions prior to 3.5.5 are affected by this vulnerability.\n\r\n\n\r\nThe software version of a Cisco WAAS Mobile server can be determined by first accessing the web administration interface. The software version number is located on the right side of the header.\n\r\n\n\r\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "The following products running Cisco WAAS Software are not affected by this vulnerability:\n\r\n\r\n    Cisco WAAS\r\n    Cisco WAAS Express\r\n\r\nNote: this vulnerability does not affect the Cisco WAAS Mobile software component installed on the clients.\r\n\r\n\r\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco WAAS Mobile extends Cisco WAAS software application acceleration benefits to teleworkers, small and home office workers, and mobile employees who travel outside the branch office.\n\r\n\n\r\nA vulnerability in the web management interface of Cisco WAAS Mobile server could allow an unauthenticated, remote attacker to execute arbitrary code on the affected system.\n\r\n\n\r\nThe vulnerability is due to insufficient validation of user-supplied data in the body of an HTTP POST request. An attacker could exploit this vulnerability by crafting an HTTP POST request  for content upload that would result in an uncontrolled directory traversal. An exploit could allow the attacker to execute arbitrary code on the WAAS Mobile server with the privileges of the IIS web server.\n\r\n\n\r\nNote: The vulnerable component belongs to the web management interface; however, in a deployment where more than one Cisco WAAS Mobile server is used then all the servers are vulnerable, not just the one performing the Manager role and hosting the web management interface.\n\r\nNote: This vulnerability does not affect the software component installed on the clients. \n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCuh69773[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuh69773\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned Common Vulnerabilities and Exposure (CVE) ID CVE-2013-5554",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds that mitigate this vulnerability.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "This vulnerability has been fixed in Cisco WAAS Mobile version 3.5.5 and later.\n\r\n\n\r\nWhen considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Notices archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers. \r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any public announcements or malicious use of the vulnerability that is described in this advisory. \r\n\r\nThis vulnerability was reported to Cisco by Andrea Micalizzi a.k.a. rgod, working with HP's Zero Day Initiative.\r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco WAAS Mobile Remote Code Execution Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20131106-waasm"
			}
		],
		"title": "Cisco WAAS Mobile Remote Code Execution Vulnerability",
		"tracking": {
			"current_release_date": "2013-11-06T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:23:50+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20131106-waasm",
			"initial_release_date": "2013-11-06T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2013-11-06T13:41:28+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				}
			],
			"status": "final",
			"version": "1.0.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Wide Area Application Services (WAAS) Mobile",
						"product": {
							"name": "Cisco Wide Area Application Services (WAAS) Mobile ",
							"product_id": "CSAFPID-194883"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2013-5554",
			"notes": [
				{
					"category": "other",
					"text": "CSCuh69773",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-194883"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco WAAS Mobile Remote Code Execution Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20131106-waasm"
				}
			],
			"release_date": "2013-11-06T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds that mitigate this vulnerability."
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 7.5,
						"vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-194883"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 7.5,
						"vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:P/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-194883"
					]
				}
			],
			"title": "Cisco WAAS Mobile remote code execution vulnerability"
		}
	]
}
