{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Cisco Prime LAN Management Solution (LMS) Virtual Appliance\r\ncontains a vulnerability that could allow an unauthenticated, remote\r\nattacker to execute arbitrary commands with the privileges of the root user. The\r\nvulnerability is due to improper validation of authentication and\r\nauthorization commands sent to certain TCP ports. An attacker\r\ncould exploit this vulnerability by connecting to the affected system\r\nand sending arbitrary commands.\n\r\n\n\r\nCisco has released software updates that address this vulnerability.  Workarounds that mitigate these vulnerabilities are available.\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130109-lms[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130109-lms\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "The following versions of Linux-based Cisco Prime LMS Virtual Appliance\r\nare vulnerable:\n\r\n\n\r\n\r\n    \r\n        \r\n            Cisco Prime LMS Virtual Appliance Version              \r\n                          Affected \r\n        \r\n        \r\n            4.1\n\r\n            \r\n            Yes \r\n        \r\n        \r\n            4.2 \r\n            Yes\r\n        \r\n        \r\n            4.2.1 \r\n            Yes \r\n        \r\n        \r\n            4.2.2 \r\n            Yes\r\n        \r\n        \r\n            4.2.3 \r\n            No \r\n        \r\n    \r\n\r\n\n\r\nNote: Only\r\nLinux-Based Cisco Prime LMS Virtual Appliances are affected by this vulnerability. Cisco Prime LMS\r\nrunning on Windows or Solaris is not affected.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "The following products are not affected by this vulnerability:\n\r\n\r\n    Cisco Prime LMS for Windows\r\n    Cisco Prime LMS for Solaris\r\n    CiscoWorks LMS running on any supported operating systems\r\n\r\n\n\r\nNo other Cisco products are currently known to be affected by this vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco Prime LAN Management Solution (LMS) is an integrated suite of management functions\r\nthat simplifies the configuration, administration, monitoring, and\r\ntroubleshooting of a network. Cisco Prime LMS software is supported over Windows and Solaris or distributed in Virtual Appliance mode (also known as soft appliance mode).\n\r\n\n\r\nCisco Prime LMS Virtual Appliance is a bundle of a Linux-based operating system (OS) and the LMS application that is preinstalled. This software is distributed in a single Open Virtual Archive (OVA) file that can be instantiated directly on a supported VMware virtualization environment.\n\r\n\n\r\nLinux-based Cisco Prime LAN Management Solution (LMS) Virtual Appliance contains a vulnerability that could allow an unauthenticated, remote attacker to execute arbitrary commands with the privilege of the root user. The vulnerability is due to improper validation of authentication and authorization commands by the remote shell server (rshd) running on the affected system. An attacker could exploit this vulnerability by accessing the remote shell (rsh) service of the affected system and sending arbitrary commands.\n\r\n\n\r\nNote: Only Linux-based Cisco Prime LMS Virtual Appliances are affected by this vulnerability. Cisco Prime LMS running on Windows or Solaris is not affected.\n\r\n\n\r\nThis vulnerability can be exploited over TCP port 514.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCuc79779[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuc79779\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned CVE ID CVE-2012-6392.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "The workaround for this vulnerability requires the administrator to edit the securetty file stored in the /etc/ directory on the affected system and remove the rsh service command line.\n\r\n\n\r\nMitigations that can be deployed on Cisco devices in a network are\r\navailable in the Cisco Applied Intelligence companion document for this\r\nadvisory: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=27920[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=27920\"]",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "The following table provides software upgrade information to mitigate the vulnerability described in this security\r\nadvisory:\n\r\n\n\r\n\r\n\r\n\r\n    \r\n        \r\n            Cisco Prime LMS Virtual Appliance Version\n\r\n            \r\n             Patch Name\n\r\n            \r\n        \r\n        \r\n            4.1 \r\n            lms4.1-lnx-CSCuc79779-0.zip\n\r\n            \r\n        \r\n        \r\n            4.2\n\r\n            \r\n            lms4.2-lnx-CSCuc79779-0.zip\n\r\n            \r\n        \r\n        \r\n            4.2.1\n\r\n            \r\n            lms4.2.1-lnx-CSCuc79779-0.zip\n\r\n            \r\n        \r\n        \r\n            4.2.2\n\r\n            \r\n            lms4.2.2-lnx-CSCuc79779-0.zip \r\n        \r\n    \r\n\r\n\r\nWhen considering software upgrades, customers are advised to consult the Cisco Security Advisories and Responses archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \r\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers. \r\n",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco Product Security Incident Response Team (PSIRT) is not aware of any malicious use of the vulnerability that is described in this advisory. Functional code that demonstrates an exploit of this vulnerability is available as a part of the Metasploit framework.\n\r\n\n\r\nThe vulnerability was discovered during the resolution of a support case.\r\n",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Prime LAN Management Solution Command Execution Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130109-lms"
			}
		],
		"title": "Cisco Prime LAN Management Solution Command Execution Vulnerability",
		"tracking": {
			"current_release_date": "2013-01-23T20:31:00+00:00",
			"generator": {
				"date": "2022-07-15T00:20:31+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20130109-lms",
			"initial_release_date": "2013-01-09T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2013-01-09T15:12:09+00:00",
					"number": "1.0.0",
					"summary": "Initial public release"
				},
				{
					"date": "2013-01-23T20:31:22+00:00",
					"number": "1.1.0",
					"summary": "Updated Summary, Details, Workaround, Exploitation and Public Announcements sections"
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Prime LAN Management Solution (LMS)",
						"product": {
							"name": "Cisco Prime LAN Management Solution (LMS) ",
							"product_id": "CSAFPID-188426"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"cve": "CVE-2012-6392",
			"notes": [
				{
					"category": "other",
					"text": "CSCuc79779",
					"title": "Cisco Bug IDs"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-188426"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Prime LAN Management Solution Command Execution Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130109-lms"
				}
			],
			"release_date": "2012-11-28T14:04:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "The workaround for this vulnerability requires the administrator to edit the securetty file stored in the /etc/ directory on the affected system and remove the rsh service command line.\n\r\n\n\r\nMitigations that can be deployed on Cisco devices in a network are\r\navailable in the Cisco Applied Intelligence companion document for this\r\nadvisory: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=27920[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=27920\"]"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 10,
						"vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-188426"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 10,
						"vectorString": "AV:N/AC:L/Au:N/C:C/I:C/A:C/E:F/RL:OF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-188426"
					]
				}
			],
			"title": "Cisco Prime LAN Management Solution Command Execution Vulnerability"
		}
	]
}
