{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Cisco Unified Communications Manager (Unified CM) contains multiple vulnerabilities that could be used together to allow an unauthenticated, remote attacker to gather user credentials, escalate privileges, and execute commands to gain full control of the vulnerable system. A successful attack could allow an unauthenticated attacker to access, create or modify information in Cisco Unified CM. \n\r\n\n\r\nOn June 6, 2013, a French security firm, Lexfo, delivered a public presentation on VoIP security that included a demonstration of multiple vulnerabilities used to compromise Cisco Unified CM. During the presentation, the researchers demonstrated a multistaged attack that chained a number of vulnerabilities, which resulted in a complete compromise of the Cisco Unified CM server. The attack chain used the following types of vulnerabilities:\r\n\r\n    Blind Structured Query Language (SQL) injection\r\n    Command injection\r\n    Privilege escalation\r\n\r\nCisco PSIRT greatly appreciates the opportunity to work with researchers on security vulnerabilities and welcomes the opportunity to review and assist in product reports.\n\r\n\n\r\nCisco has released a Cisco Options Package (COP) file that addresses three of the vulnerabilities documented in this advisory. Cisco is currently investigating the remaining vulnerabilities. Workarounds that mitigate these vulnerabilities are not available.\n\r\n\n\r\nThis advisory is available at the following link:\n\r\nhttp://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130717-cucm[\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130717-cucm\"]",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "The following products are affected by the vulnerabilities that are described in this advisory:\r\n\r\n    Cisco Unified Communications Manager 7.1(x)\r\n    Cisco Unified Communications Manager 8.5(x)\r\n    Cisco Unified Communications Manager 8.6(x)\r\n    Cisco Unified Communications Manager 9.0(x)\r\n    Cisco Unified Communications Manager 9.1(x)\r\n\r\nNote: Cisco Unified CM version 8.0 reached the End of Software Maintenance on October 23, 2012. Customers using Cisco Unified CM 8.0(x) versions should contact their Cisco support team for assistance in upgrading to a supported version of Cisco Unified CM.\n\r\n\n\r\nCisco Unified CM is the only product confirmed to be vulnerable to the documented attack. Additional voice products may be affected by one or more of the individual vulnerabilities that are described in this advisory. The following products are being investigated but have not yet been confirmed as vulnerable:\r\n\r\n    Cisco Emergency Responder\r\n    Cisco Unified Contact Center Express\r\n    Cisco Unified Customer Voice Portal\r\n    Cisco Unified Presence Server/Cisco IM and Presence Service\r\n    Cisco Unity Connection\r\n",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by these vulnerabilities.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco Unified CM is the call processing component of the Cisco IP Telephony solution that extends enterprise telephony features and functions to packet telephony network devices, such as IP phones, media processing devices, VoIP gateways, and multimedia applications. \n\r\n\n\r\nBlind Structured Query Language Injection Vulnerabilities\n\r\n\n\r\nCisco Unified CM and associated products may contain one or more of the following blind SQL injection vulnerabilities. The vulnerabilities may be exploited from an authenticated or unauthenticated context depending on the particular vulnerability.\n\r\n\n\r\nSQL injection vulnerabilities are due to a failure to perform proper validation of user-supplied requests prior to being used to form an SQL query. An attacker could exploit this behavior by injecting SQL commands. An exploit could allow the attacker to disclose or modify arbitrary information in the database.\n\r\n\n\r\nThe first of the identified vulnerabilities could be exploited by an unauthenticated, remote attacker. An exploit could allow the attacker to use metadata to recreate encrypted information in the database. This metadata could be used to reconstruct encrypted credentials.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCuh01051[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuh01051\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned Common Vulnerabilities and Exposures (CVE) ID CVE-2013-3404. This vulnerability applies to Cisco Unified CM versions 9.1(1a) and prior.\n\r\n\n\r\nThe second vulnerability could be exploited by an authenticated, remote attacker. An exploit could allow the attacker to modify or insert additional data into certain tables in the database.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCuh81766[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuh81766\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned CVE ID CVE-2013-3412. This vulnerability applies to Cisco Unified CM versions 9.1(2) and prior.\n\r\n\n\r\nThese vulnerabilities can be exploited over the default management ports, TCP ports 8080 or 8443. \n\r\n\n\r\nHard-Coded Encryption Key\n\r\n\n\r\nCisco Unified Communications Manager (Unified CM) contains  a hard-coded encryption key used for the encryption of sensitive data stored within the database, and securing computer telephony integration (CTI) communications.\n\r\n\n\r\nThe issue is due to the use of a static symmetric encryption key in all Cisco Unified CM versions. An attacker could exploit this issue by using the secret key to decrypt sensitive data including user credentials. An exploit could allow the attacker to decrypt sensitive system information such as user credentials gained when using other attacks. This issue is documented in Cisco bug ID CSCsc69187[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsc69187\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only). This issue applies to Cisco Unified CM versions 9.1(2) and prior.\n\r\n\n\r\nCisco Unified Presence Server/IM & Presence Service versions 9.1(2) and prior are also affected by this issue. This issue is documented in Cisco bug ID CSCui01756[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCui01756\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only).\n\r\n\n\r\nCommand Injection Vulnerability\n\r\n\n\r\nA vulnerability in Cisco Unified Communications Manager (Unified CM) could allow an authenticated, remote attacker to execute commands on the underlying operating system with the privileges of the database user.\n\r\n\n\r\nThe vulnerability is due to improper validation of user-supplied input. An attacker could exploit this vulnerability by submitting malicious input to the affected function.\n\r\n\n\r\nThis vulnerability is documented in Cisco bug ID CSCuh73440[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuh73440\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned CVE ID CVE-2013-3402. This vulnerability applies to Cisco Unified CM versions 9.1(2) and prior.\n\r\n\n\r\nPrivilege Escalation Vulnerability\n\r\n\n\r\nVulnerabilities in Cisco Unified Communications Manager could allow an authenticated, local attacker to escalate privileges on the system.\n\r\n\n\r\nThe vulnerabilities are due to improper file permissions, environment variables and relative paths in a privileged system script or binary. An attacker could exploit these vulnerabilities by modifying certain system scripts. This could allow the attacker to gain complete control of the affected system.\n\r\n\n\r\nThis first two privilege escalation vulnerabilities are documented in Cisco bug ID CSCuh73454[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuh73454\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and CSCuh87042[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCuh87042\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and have been assigned CVE ID CVE-2013-3403. \n\r\n\n\r\nA third privilege escalation vulnerability is documented in Cisco bug ID CSCui02242[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCui02242\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned CVE ID CVE-2013-3434.\n\r\n\n\r\nA fourth privilege escalation vulnerability is documented in Cisco bug ID CSCui02276[\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCui02276\"] (registered[\"http://tools.cisco.com/RPF/register/register.do\"] customers only) and has been assigned CVE ID CVE-2013-3433.\n\r\n\n\r\nThese vulnerabilities apply to Cisco Unified CM versions 9.1(1a) and prior.",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds for the vulnerabilities described in this document.\n\r\n\n\r\nAdditional workaround details are available in the companion Applied Mitigation Bulletin (AMB) at the following location: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846\"]",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, customers are advised to consult the Cisco Security Advisories, Responses, and Notices archive at http://www.cisco.com/go/psirt[\"http://www.cisco.com/go/psirt\"] and review subsequent advisories to determine exposure and a complete upgrade solution. \n\r\n\n\r\nIn all cases, customers should ensure that the devices to be upgraded contain sufficient memory and  confirm that current hardware and software configurations will continue to be supported properly by the new release. If the information is not clear, customers are advised to contact the Cisco Technical Assistance Center (TAC) or their contracted maintenance providers. \n\r\n\n\r\nThere are no Cisco Unified CM versions currently available that contain software fixes for the vulnerabilities described in this advisory. This advisory will be updated as fixed software is made available. In the interim, Cisco has released a Cisco Options Package (COP) file that addresses the following vulnerabilities: CSCuh01051, CSCuh87042 and CSCuh73454.\n\r\n\n\r\nCustomers can download and install the COP file as a solution for the previous vulnerabilities while awaiting fixed software versions. \n\r\n\n\r\nThis package will install on the following system versions:\r\n\r\n    7.1.3\r\n    7.1.5\r\n    8.5.1\r\n    8.6.2\r\n    9.1.1\r\n\r\nThe COP file, cmterm-CSCuh01051-2.cop.sgn, is located in the Utilities section of the software downloads page[\"http://software.cisco.com/download/navigator.html?a=a&i=rpm\"] for each of the versions in the preceding list. For instance, the file for 9.1(x) versions would be located by navigating the following path on the software downloads page:\n\r\n\n\r\nProducts -> Voice and Unified Communications -> IP Telephony -> Unified Communications Platform -> Cisco Unified Communications Manager -> Cisco Unified Communications Manager Version 9.1 -> Unified Communications Manager / CallManager / Cisco Unity Connection Utilities-COP-Files\n\r\n\n\r\nThe COP file mitigates the initial attack vector (CSCuh01051) and reduces the documented attack surface. Application of the COP file is highly recommended for all affected Cisco Unified CM product versions.",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy[http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The blind SQL injection vulnerability (CSCuh01051) was initially reported to Cisco by Emerging Defense, LLC.\n\r\n\n\r\nThese vulnerabilities were demonstrated during the SSTIC 2013 IT security conference in Rennes, France on June 6, 2013, by a French security firm, Lexfo. The Cisco Product Security Incident Response Team (PSIRT) is not aware of any malicious use of the vulnerabilities that are described in this advisory.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.\r\n",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "external",
				"summary": "Identifying and Mitigating Exploitation of the Multiple Vulnerabilities in Cisco Unified Communications Manager",
				"url": "http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846"
			},
			{
				"category": "self",
				"summary": "Multiple Vulnerabilities in Cisco Unified Communications Manager",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130717-cucm"
			}
		],
		"title": "Multiple Vulnerabilities in Cisco Unified Communications Manager",
		"tracking": {
			"current_release_date": "2013-07-17T18:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:23:31+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20130717-cucm",
			"initial_release_date": "2013-07-17T16:00:00+00:00",
			"revision_history": [
				{
					"date": "2013-07-17T14:10:23+00:00",
					"number": "1.0.0",
					"summary": "Initial public release."
				},
				{
					"date": "2013-07-17T18:00:16+00:00",
					"number": "1.1.0",
					"summary": "Corrected CVSS score to correct the remediation level for privilege escalation vulnerabilities CSCuh73454 and CSCuh87042 (CVE-2013-3403). Two minor wording corrections for clarity."
				}
			],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {
		"branches": [
			{
				"branches": [
					{
						"category": "product_family",
						"name": "Cisco Unified Presence Server",
						"product": {
							"name": "Cisco Unified Presence Server ",
							"product_id": "CSAFPID-7333"
						}
					},
					{
						"category": "product_family",
						"name": "Cisco Unified Communications Manager",
						"product": {
							"name": "Cisco Unified Communications Manager ",
							"product_id": "CSAFPID-88444"
						}
					}
				],
				"category": "vendor",
				"name": "Cisco"
			}
		]
	},
	"vulnerabilities": [
		{
			"notes": [
				{
					"category": "other",
					"text": "CSCsc69187,CSCui01756",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-88444",
					"CSAFPID-7333"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified Communications Manager",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130717-cucm"
				}
			],
			"release_date": "2013-07-17T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for the vulnerabilities described in this document.\n\r\n\n\r\nAdditional workaround details are available in the companion Applied Mitigation Bulletin (AMB) at the following location: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846\"]"
				}
			],
			"title": "Cisco Unified Communications Manager CCMEncryption Contains Static Key"
		},
		{
			"cve": "CVE-2013-3402",
			"notes": [
				{
					"category": "other",
					"text": "CSCuh73440",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-88444"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified Communications Manager",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130717-cucm"
				}
			],
			"release_date": "2013-07-17T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for the vulnerabilities described in this document.\n\r\n\n\r\nAdditional workaround details are available in the companion Applied Mitigation Bulletin (AMB) at the following location: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846\"]"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 6.5,
						"vectorString": "AV:N/AC:L/Au:S/C:P/I:P/A:P/E:POC/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 6.5,
						"vectorString": "AV:N/AC:L/Au:S/C:P/I:P/A:P/E:POC/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				}
			],
			"title": "Cisco Unified Communications Manager Command Injection Vulnerability"
		},
		{
			"cve": "CVE-2013-3404",
			"notes": [
				{
					"category": "other",
					"text": "CSCuh01051",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-88444"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified Communications Manager",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130717-cucm"
				}
			],
			"release_date": "2013-07-17T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for the vulnerabilities described in this document.\n\r\n\n\r\nAdditional workaround details are available in the companion Applied Mitigation Bulletin (AMB) at the following location: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846\"]"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 6.4,
						"vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:N/E:F/RL:TF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 6.4,
						"vectorString": "AV:N/AC:L/Au:N/C:P/I:P/A:N/E:F/RL:TF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				}
			],
			"title": "Cisco Unified Communications Manager Blind SQL Injection Vulnerability"
		},
		{
			"cve": "CVE-2013-3412",
			"notes": [
				{
					"category": "other",
					"text": "CSCuh81766",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-88444"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified Communications Manager",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130717-cucm"
				}
			],
			"release_date": "2013-07-17T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for the vulnerabilities described in this document.\n\r\n\n\r\nAdditional workaround details are available in the companion Applied Mitigation Bulletin (AMB) at the following location: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846\"]"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 5.5,
						"vectorString": "AV:N/AC:L/Au:S/C:P/I:P/A:N/E:F/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 5.5,
						"vectorString": "AV:N/AC:L/Au:S/C:P/I:P/A:N/E:F/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				}
			],
			"title": "Cisco Unified Communications Manager Blind Structured Query Language Injection Vulnerabilities"
		},
		{
			"cve": "CVE-2013-3434",
			"notes": [
				{
					"category": "other",
					"text": "CSCui02242",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-88444"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified Communications Manager",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130717-cucm"
				}
			],
			"release_date": "2013-07-17T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for the vulnerabilities described in this document.\n\r\n\n\r\nAdditional workaround details are available in the companion Applied Mitigation Bulletin (AMB) at the following location: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846\"]"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 6.8,
						"vectorString": "AV:L/AC:L/Au:S/C:C/I:C/A:C/E:POC/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 6.8,
						"vectorString": "AV:L/AC:L/Au:S/C:C/I:C/A:C/E:POC/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				}
			],
			"title": "Cisco Unified Communications Manager Privilege Escalation Vulnerability"
		},
		{
			"cve": "CVE-2013-3433",
			"notes": [
				{
					"category": "other",
					"text": "CSCui02276",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-88444"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified Communications Manager",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130717-cucm"
				}
			],
			"release_date": "2013-07-17T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for the vulnerabilities described in this document.\n\r\n\n\r\nAdditional workaround details are available in the companion Applied Mitigation Bulletin (AMB) at the following location: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846\"]"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 6.8,
						"vectorString": "AV:L/AC:L/Au:S/C:C/I:C/A:C/E:POC/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 6.8,
						"vectorString": "AV:L/AC:L/Au:S/C:C/I:C/A:C/E:POC/RL:U/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				}
			],
			"title": "Cisco Unified Communications Manager Privilege Escalation Vulnerability"
		},
		{
			"cve": "CVE-2013-3403",
			"notes": [
				{
					"category": "other",
					"text": "CSCuh73454,CSCuh87042",
					"title": "Cisco Bug IDs"
				},
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {
				"known_affected": [
					"CSAFPID-88444"
				]
			},
			"references": [
				{
					"category": "self",
					"summary": "Multiple Vulnerabilities in Cisco Unified Communications Manager",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20130717-cucm"
				}
			],
			"release_date": "2013-07-17T16:00:00+00:00",
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for the vulnerabilities described in this document.\n\r\n\n\r\nAdditional workaround details are available in the companion Applied Mitigation Bulletin (AMB) at the following location: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846[\"http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=29846\"]"
				}
			],
			"scores": [
				{
					"cvss_v2": {
						"baseScore": 6.8,
						"vectorString": "AV:L/AC:L/Au:S/C:C/I:C/A:C/E:POC/RL:TF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				},
				{
					"cvss_v2": {
						"baseScore": 6.8,
						"vectorString": "AV:L/AC:L/Au:S/C:C/I:C/A:C/E:POC/RL:TF/RC:C",
						"version": "2.0"
					},
					"products": [
						"CSAFPID-88444"
					]
				}
			],
			"title": "Cisco Unified Communications Manager Privilege Escalation Vulnerability"
		}
	]
}
