{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "Cisco Catalyst 6500 series systems that are running certain versions of Cisco Internetwork Operating System (IOS) are vulnerable to an attack from a Multi Protocol Label Switching (MPLS) packet. Only the systems that are running in Hybrid Mode (Catalyst OS (CatOS) software on the Supervisor Engine and IOS Software on the Multilayer Switch Feature Card (MSFC)) or running with Cisco IOS Software Modularity are affected.\r\n\r\nMPLS packets can only be sent from the local network segment.\r\n\r\nThis advisory is posted at http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20070228-mpls [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20070228-mpls\"].",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "The following products are affected by this vulnerability:\r\n\r\nCisco Catalyst 6500 systems that run 12.2(18)SXF4 with Cisco IOS Software Modularity are affected.\r\n\r\nImages that support Cisco IOS Software Modularity have a \"-vz\" suffix in their image name.\r\n\r\nThe following is a conclusive list of all image names that are running with Cisco IOS Software Modularity and are affected by this vulnerability.\r\n\r\n- s72033-adventerprisek9_wan-vz.122-18.SXF4.bin\r\n- s72033-advipservicesk9_wan-vz.122-18.SXF4.bin\r\n- s72033-entservicesk9_wan-vz.122-18.SXF4.bin\r\n- s72033-ipservices_wan-vz.122-18.SXF4.bin\r\n- s72033-ipservicesk9_wan-vz.122-18.SXF4.bin\r\n- s72033-ipservicesk9-vz.122-18.SXF4.bin\r\n\r\nCisco Catalyst 6000, 6500 and Cisco 7600 series systems with an MSFC2 or MSFC3 that run in Hybrid Mode are affected.\r\n\r\nIn Hybrid Mode, Catalyst OS (CatOS) software runs on the Supervisor Engine and IOS runs on the MSFC. It is different from the Native Mode in which IOS runs both on the Supervisor Engine and MSFC\r\n\r\nThis vulnerability affects MSFC2, MSFC2a and MSFC3 that run certain images in Hybrid mode.\r\n\r\nIn Hybrid Mode, IOS images that run on MSFC start with \"c6msfc2\", \"c6msfc2a\" or \"c6msfc3\". Several image names that run on MSFC in hybrid mode are provided below for reference:\r\n\r\n- c6msfc2a-adventerprisek9_wan-mz.122-18.SXF\r\n- c6msfc3-jsv-mz.122-14.SX2",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "These products are not vulnerable:\r\n\r\nSystems that are running in Native Mode without Cisco IOS Software Modularity are not affected.\r\nSystems without an MSFC2, MSFC2a or MSFC3 are not affected\r\n  No other Cisco products are currently known to be affected by these vulnerabilities.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco IOS Software Modularity combines subsystems into individual  processes and enhances the Cisco IOS Software memory architecture to provide  process-level fault isolation and subsystem \"In Service Software Upgrade\"  (ISSU) capability. These enhancements are delivered in Cisco IOS Software for  the Catalyst 6500 Series Supervisor Engine 720 and Supervisor Engine 32. Cisco  IOS Software Modularity was first delivered as an option in a Cisco IOS  Software Release 12.2(18)SXF4. More information on Modular IOS can be found at  the following URL:\r\n\r\n  http://www.cisco.com/en/US/prod/collateral/switches/ps5718/ps708/prod_bulletin0900aecd80313e15.html [\"http://www.cisco.com/en/US/prod/collateral/switches/ps5718/ps708/prod_bulletin0900aecd80313e15.html\"]\r\n\r\n Not all 12.2(18)SXF4 images support Modular IOS. Only the images with  a \"-vz\" in the image name support Modular IOS and are affected by this  vulnerability. A conclusive list of all affected image names that support Cisco  IOS Software Modularity is provided in the Affected Products section.\r\n\r\n In Hybrid Mode, a CatOS image is used as the system software to run  the Supervisor Engine on the Catalyst systems. If an MSFC is installed, a  separate IOS Software image is used in order to run the MSFC. CatOS provides  the Layer 2 (L2) switching functionality. The Cisco IOS on the MSFC provides  the Layer 3 (L3) routing functionality. It differs from the Native Mode, in  which a single Cisco IOS Software image is used as the system software to run  both the Supervisor Engine and MSFC on the Catalyst systems. IOS software that  runs on MSFC in Hybrid Mode is also affected by this vulnerability. More  information about the differences between Hybrid and Native Modes can be found  at the following URL:\r\n\r\n  http://www.cisco.com/en/US/prod/collateral/switches/ps5718/ps708/prod_white_paper09186a00800c8441.html [\"http://www.cisco.com/en/US/prod/collateral/switches/ps5718/ps708/prod_white_paper09186a00800c8441.html\"]\r\n\r\n MPLS packets received by a Route Processor (MSFC) Layer 3 interface  can potentially trigger this vulnerability. The system in question does not  need to be configured for MPLS to be vulnerable. MPLS packets can only be sent  from the local network segment, limiting the scope of the exploitation.\r\n\r\n This issue is documented in bug IDs  CSCsd37415 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsd37415\"]  (  registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)  and  CSCef90002 [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCef90002\"]  (  registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)  .",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "There are no workarounds for this vulnerability.\r\n\r\nAdditional mitigations that can be deployed on Cisco devices within the  network are available in the Cisco Applied Mitigation Bulletin companion  document for this advisory:  http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070228-mpls [\"http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070228-mpls\"]",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, also consult  http://www.cisco.com/go/psirt [\"http://www.cisco.com/go/psirt\"]  and any subsequent advisories to determine exposure and a complete upgrade  solution.\r\n\r\n  In all cases, customers should exercise caution to be  certain the devices to be upgraded contain sufficient memory and that current  hardware and software configurations will continue to be supported properly by  the new release. If the information is not clear, contact the Cisco Technical  Assistance Center (TAC) or your contracted maintenance provider for assistance.\r\n\r\nEach row of the Cisco IOS software table (below) describes a release  train and the platforms or products for which it is intended. If a given  release train is vulnerable, then the earliest possible releases that contain  the fix (the \"First Fixed Release\") and the anticipated date of availability  for each are listed in the \"Rebuild\" and \"Maintenance\" columns. A device  running a release in the given train that is earlier than the release in a  specific column (less than the First Fixed Release) is known to be vulnerable.  The release should be upgraded at least to the indicated release or a later  version (greater than or equal to the First Fixed Release label).\r\n\r\nFor more information on the terms \"Rebuild\" and \"Maintenance,\" consult  the following URL: http://www.cisco.com/web/about/security/intelligence/ios-ref.html [\"http://www.cisco.com/web/about/security/intelligence/ios-ref.html\"].\r\n\r\nTrains\r\n\r\nAvailability of Fixed Releases\r\n\r\nRebuild\r\n\r\nMaintenance\r\n\r\n12.1E\r\n\r\nNot vulnerable\r\n\r\n12.2SXA\r\n\r\nVulnerable. Migrate to 12.2(17d)SXB5 or later\r\n\r\n12.2SXB\r\n\r\n12.2(17d)SXB5\r\n\r\n12.2SXD\r\n\r\n12.2(18)SXD3\r\n\r\n12.2SXE\r\n\r\nNot vulnerable\r\n\r\n12.2SXF (*)\r\n\r\n12.2(18)SXF5\r\n\r\n\r\n\r\n* Only 12.2(18)SXF4 with IOS Software Modularity is affected. 12.2SXF  releases that run in Hybrid Mode are not affected. Please see the Affected  Products section for more information.\r\n\r\nA special patch for 12.2(18)SXF4 with Cisco IOS Software Modularity is  also available.\r\n\r\n Patch Name: MA0045\r\n\r\n Image Name: s72033-AMA0045-patch.122-18.SXF4\r\n\r\nThe above patch can be downloaded from the Cisco IOS Software  Modularity Patch Navigator at  http://tools.cisco.com/swdf/ionpn/jsp/main.jsp [\"http://tools.cisco.com/swdf/ionpn/jsp/main.jsp\"]",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious use of the vulnerability described in this advisory.\r\n\r\nThis vulnerability was reported by a customer.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "self",
				"summary": "Cisco Catalyst 6000, 6500 and Cisco 7600 Series MPLS Packet Vulnerability",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20070228-mpls"
			}
		],
		"title": "Cisco Catalyst 6000, 6500 and Cisco 7600 Series MPLS Packet Vulnerability",
		"tracking": {
			"current_release_date": "2007-02-28T00:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:05:15+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20070228-mpls",
			"initial_release_date": "2007-02-28T00:00:00+00:00",
			"revision_history": [],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"cve": "CVE-2007-1258",
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Cisco Catalyst 6000, 6500 and Cisco 7600 Series MPLS Packet Vulnerability",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20070228-mpls"
				}
			],
			"remediations": [
				{
					"category": "workaround",
					"details": "There are no workarounds for this vulnerability.\r\n\r\nAdditional mitigations that can be deployed on Cisco devices within the  network are available in the Cisco Applied Mitigation Bulletin companion  document for this advisory:  http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070228-mpls [\"http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070228-mpls\"]"
				}
			],
			"title": "DO NOT PUBLISH Until 2/28 -- Cisco Catalyst MPLS Packet Handling Remote Denial of Service Vulnerability"
		}
	]
}
