{
	"document": {
		"category": "Cisco Security Advisory",
		"csaf_version": "2.0",
		"notes": [
			{
				"category": "summary",
				"text": "The Intrusion Prevention System (IPS) feature set of Cisco IOS®  contains several vulnerabilities. These include:\r\n\r\n   Fragmented IP packets may be used to evade signature inspection.\r\n\r\n   IPS signatures utilizing the regular expression feature of the ATOMIC.TCP signature engine may cause a router to crash resulting in a denial of service.\r\n\r\n\r\nThere are mitigations and workarounds for these vulnerabilities. Cisco  has made free software available to address these vulnerabilities for affected  customers.\r\n\r\nThis advisory is posted at  http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20070213-iosips [\"http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20070213-iosips\"].",
				"title": "Summary"
			},
			{
				"category": "general",
				"text": "[\"#@\"]",
				"title": "Affected Products"
			},
			{
				"category": "general",
				"text": "The following Cisco IOS release trains with the IPS feature set enabled  are vulnerable to the fragmented packet evasion vulnerability:\r\n\r\n   12.3T, except versions 12.3(2)T, 12.3(4)T, and 12.3(7)T\r\n\r\n   12.4\r\n\r\n   12.4T\r\n\r\n   12.4XE\r\n\r\n\r\nThe following Cisco IOS release trains with the IPS feature set enabled  are vulnerable to the ATOMIC.TCP regular expression denial of service  vulnerability:\r\n\r\n   12.3T, except versions 12.3(2)T, 12.3(4)T, and 12.3(7)T\r\n\r\n   12.3XQ, 12.3XR, 12.3XS, 12.3XW, 12.3XX, 12.3XY\r\n\r\n   12.3YA, 12.3YD, 12.3YG, 12.3YH, 12.3YI, 12.3YJ, 12.3YK, 12.3YM, 12.3YQ, 12.3YS, 12.3YT, 12.3YX, 12.3YZ\r\n\r\n   12.4\r\n\r\n   12.4MR\r\n\r\n   12.4T\r\n\r\n   12.4XA, 12.4XB\r\n\r\n\r\nTo determine if the IPS feature set is active on an IOS device, use the  show ip ips configuration command. This command will  list the interfaces configured to use IPS inspection. You will then need to  further check the status of each interface to confirm if they are enabled or  not.\r\n\r\n\r\nrouter#show ip ips configuration\nConfigured Config Locations: -none- Last signature default load time: 18:46:50 UTC Jan 5 2007 Last signature delta load time: -none- Last event action (SEAP) load time: -none- IPS Auto Update is not currently configured IPS fail closed is disabled Fastpath ips is enabled Quick run mode is enabled Event notification through syslog is enabled Event notification through SDEE is enabled Total Active Signatures: 85 Total Inactive Signatures: 61 IPS Rule Configuration  IPS name test IPS Category CLI is not configured Interface Configuration  Interface FastEthernet0/0   Inbound IPS rule is test   Outgoing IPS rule is not set  router#show ip interface FastEthernet0/0 FastEthernet0/0 is up, line protocol is up\r\n\r\nIn the above example, interface FastEthernet0/0 is configured to use  IPS and is shown to be enabled.",
				"title": "Vulnerable Products"
			},
			{
				"category": "general",
				"text": "No other Cisco products are currently known to be affected by this  vulnerability.",
				"title": "Products Confirmed Not Vulnerable"
			},
			{
				"category": "general",
				"text": "Cisco IOS Intrusion Prevention System (IPS) is an inline, deep-packet  inspection-based feature that enables Cisco IOS software to mitigate network  attacks. Cisco IOS IPS enables the network to defend itself with the  intelligence to identify, classify, and stop or block certain malicious or  damaging traffic in real time. The IOS IPS feature set contains multiple  vulnerabilities. Only IOS images containing the IPS feature set are affected by  these vulnerabilities.\r\n    Fragmented Packet Evasion Vulnerability\r\nSome of the IPS signatures utilize regular expressions. Due to a  vulnerability, an attacker can evade those IPS signatures by sending malicious  network traffic as IP fragments. This may result in potential malicious traffic  bypassing signature inspection and possibly allow the exploitation of protected  systems. IPS signatures which do not utilize regular expressions are not  affected by this vulnerability. All IP protocols (e.g. TCP, UDP, ICMP) are  affected by this vulnerability. There is a mitigation for this vulnerability.  This vulnerability is documented in Cisco Bug ID   CSCsg15598  [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsg15598\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)         .\r\n    ATOMIC.TCP Regular Expression Denial of Service Vulnerability\r\nCertain network traffic can trigger IPS signatures which use the  regular expression feature of the ATOMIC.TCP signature engine which may cause  the IOS IPS device to crash. This may cause a denial of service resulting in  disruption network traffic. Signature 3123.0 (Netbus Pro Traffic) has been  demonstrated to trigger this vulnerability. There is a workaround for this  vulnerability. This vulnerability is documented in Cisco Bug ID    CSCsa53334  [\"https://bst.cloudapps.cisco.com/bugsearch/bug/ CSCsa53334\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)         .\r\n    Vulnerability Scoring Details\r\nCisco is providing scores for the vulnerabilities in this advisory  based on the Common Vulnerability Scoring System (CVSS).\r\n\r\nCisco will provide a base and temporal score. Customers can then  compute environmental scores to assist in determining the impact of the  vulnerability in individual networks.\r\n\r\nCisco PSIRT will set the bias in all cases to normal. Customers are  encouraged to apply the bias parameter when determining the environmental  impact of a particular vulnerability.\r\n\r\nCVSS is a standards based scoring method that conveys vulnerability  severity and helps determine urgency and priority of response.\r\n\r\nCisco has provided an FAQ to answer additional questions regarding CVSS  at  http://www.cisco.com/web/about/security/intelligence/cvss-qandas.html [\"http://www.cisco.com/web/about/security/intelligence/cvss-qandas.html\"].\r\n\r\nCisco has also provided a CVSS calculator to help compute the  environmental impact for individual networks at  http://tools.cisco.com/security/center/cvssCalculator.x [\"http://tools.cisco.com/security/center/cvssCalculator.x\"].\r\n\r\n   CSCsg15598  [\"https://bst.cloudapps.cisco.com/bugsearch/bug/CSCsg15598\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)          - DYIDS:  Fragmentation prevents signature recognition\r\n\r\n Calculate the environmental score of  CSCsg15598 [\"http://tools.cisco.com/security/center/cvssCalculator.x?target=new&vector=AV:R/AC:L/Au:NR/C:P/I:P/A:N/B:N/E:F/RL:O/RC:C\"]\r\n\r\n CVSS Base Score - 4.7\r\n\r\n Access Vector\r\n\r\n Access Complexity\r\n\r\n Authentication\r\n\r\n Confidentiality Impact\r\n\r\n Integrity Impact\r\n\r\n Availability Impact\r\n\r\n Impact Bias\r\n\r\n Remote\r\n\r\n Low\r\n\r\n Not Required\r\n\r\n Partial\r\n\r\n Partial\r\n\r\n None\r\n\r\n Normal\r\n\r\n CVSS Temporal Score - 3.9\r\n\r\n Exploitability\r\n\r\n Remediation Level\r\n\r\n Report Confidence\r\n\r\n Functional\r\n\r\n Official Fix\r\n\r\n Confirmed\r\n\r\n\r\n\r\n    CSCsa53334   [\"https://bst.cloudapps.cisco.com/bugsearch/bug/ CSCsa53334\"]            ( registered [\"http://tools.cisco.com/RPF/register/register.do\"] customers only)          - bus error in  single_pkt_regex\r\n\r\n Calculate the environmental score of    CSCsa53334  [\"http://tools.cisco.com/security/center/cvssCalculator.x?target=new&vector=AV:R/AC:L/Au:NR/C:N/I:N/A:C/B:N/E:F/RL:O/RC:C\"]\r\n\r\n CVSS Base Score - 3.3\r\n\r\n Access Vector\r\n\r\n Access Complexity\r\n\r\n Authentication\r\n\r\n Confidentiality Impact\r\n\r\n Integrity Impact\r\n\r\n Availability Impact\r\n\r\n Impact Bias\r\n\r\n Remote\r\n\r\n Low\r\n\r\n Not Required\r\n\r\n None\r\n\r\n None\r\n\r\n Complete\r\n\r\n Normal\r\n\r\n CVSS Temporal Score - 2.7\r\n\r\n Exploitability\r\n\r\n Remediation Level\r\n\r\n Report Confidence\r\n\r\n Functional\r\n\r\n Official Fix\r\n\r\n Confirmed",
				"title": "Details"
			},
			{
				"category": "general",
				"text": "The effectiveness of any mitigation or fix is dependent on specific  customer situations such as product mix, network topology, traffic behavior,  and organizational mission. Due to the variety of affected products and  releases, customers should consult with their service provider or support  organization to ensure any applied mitigation or fix is the most appropriate  for use in the intended network before it is deployed.\r\n\r\nAdditional mitigations that can be deployed on Cisco devices within the  network are available in the Cisco Applied Mitigation Bulletin companion document for  this advisory:  http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070213-iosips [\"http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070213-iosips\"]\r\n      Fragmented Packet Evasion Vulnerability\r\nThere is a mitigation for the fragmented packet evasion vulnerability.  The fragments keyword of IOS transit Access Control Lists  (ACL) can be used to prohibit fragmented IP packets from transiting an IOS  device. More information about filtering IP fragments can be found here:\r\n\r\n   http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml#frag [\"/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml#frag\"]\r\n\r\n\r\nBlocking IP fragments may have adverse affects on some protocols (like  HTTP, FTP and Kerberos/Active Directory), so this workaround should be used  with caution.\r\n\r\n\r\naccess-list 100 deny tcp any 10.1.1.0 0.0.0.255 fragments\naccess-list 100 deny udp any 10.1.1.0 0.0.0.255 fragments\r\n     ATOMIC.TCP Regular Expression Denial of Service Vulnerability\r\nThere is a workaround for the ATOMIC.TCP regular expression denial of  service vulnerability by deleting IPS signature 3123.0 from the IOS IPS  Signature Definition File (SDF). Disabling signature 3123.0 is alone not  sufficient for the workaround to be effective. The following commands will  delete signature 3123.0 from an IOS IPS device.\r\n\r\n\r\nrouter#configure terminal\nrouter(config)#ip ips signature 3123 delete %IPS Signature 3123:0 is marked for deletion %IPS The signature will be deleted when signatures are reloaded or saved router(config)#interface FastEthernet0/0 router(config)#no ip ips test in      router(config)#ip ips test in router(config)#exit\r\n\r\nIn the above example, signature 3123.0 is first deleted from the  Signature Definition File, then the IPS instance running on interface  FastEthernet0/0 is stopped and started to reinitialize the IPS state to reflect  the signature deletion. If the IPS feature set is configured on multiple  interfaces, then these steps must be completed for each affected interface.\r\n\r\nTo determine if signature 3123 is active, use the show ip  ips signature command.\r\n\r\n\r\nrouter#show ip ips signatures | include 3123\n3123:0      N   A      MED     0      0     0   100    30 FA  N    S46\r\n\r\nIn the command output above, the N after 3123.0  indicates that the signature is present in the configuration but not enabled.  Once the signature has been deleted, rerunning the show ip ips  signature command shows:\r\n\r\n\r\nrouter#show ip ips signatures | include 3123\n3123:0      N*   A      MED     0      0     0   100    30 FA  N    S46\r\n\r\nIn the command output above, the N* after 3123.0  indicates that the signature has been deleted from the configuration. The IPS  feature set must be restarted on each interface configured for IPS to complete  the workaround. Once completed, the output of the show ip ips  signature command will show:\r\n\r\n\r\nrouter#show ip ips signatures | include 3123\n router#\r\n\r\nThis vulnerability may affect any IPS signature using the regular  expression functionality of the ATOMIC.TCP engine. Currently, Cisco only ships  one signature configured this way (3123.0). If custom signatures have been  added to an IOS IPS device configured use the ATOMIC.TCP engine with a regular  expression, these signatures must also be deleted from the IPS configuration to  ensure the effectiveness of the workaround.",
				"title": "Workarounds"
			},
			{
				"category": "general",
				"text": "When considering software upgrades, also consult  http://www.cisco.com/go/psirt [\"http://www.cisco.com/go/psirt\"]  and any subsequent advisories to determine exposure and a complete upgrade  solution.\r\n\r\nIn all cases, customers should exercise caution to be certain the  devices to be upgraded contain sufficient memory and that current hardware and  software configurations will continue to be supported properly by the new  release. If the information is not clear, contact the Cisco Technical  Assistance Center (\"TAC\") or your contracted maintenance provider for  assistance.\r\n\r\nEach row of the Cisco IOS software table (below) describes a release  train and the platforms or products for which it is intended. If a given  release train is vulnerable, then the earliest possible releases that contain  the fix (the \"First Fixed Release\") and the anticipated date of availability  for each are listed in the \"Rebuild\" and \"Maintenance\" columns. A device  running a release in the given train that is earlier than the release in a  specific column (less than the First Fixed Release) is known to be vulnerable.  The release should be upgraded at least to the indicated release or a later  version (greater than or equal to the First Fixed Release label).\r\n\r\nFor more information on the terms \"Rebuild\" and \"Maintenance,\" consult  the following URL: http://www.cisco.com/warp/public/620/1.html [\"http://www.cisco.com/warp/public/620/1.html\"]\r\n\r\nMajor Release\r\n\r\nAvailability of Repaired Releases\r\n\r\n Affected 12.3-Based Release\r\n\r\n Rebuild\r\n\r\n Maintenance\r\n\r\n12.3T\r\n\r\n All 12.3(2)T, 12.3(4)T, and 12.3(7)T releases are not  vulnerable\r\n\r\n All 12.3(8)T releases are vulnerable\r\n\r\n12.3(11)T10\r\n\r\n12.3(14)T7\r\n\r\n Limited platform support is available: contact TAC\r\n\r\n Please migrate to 12.4(12) or later\r\n\r\n12.3XQ\r\n\r\nVulnerable; migrate to 12.4(12) or later\r\n\r\n12.3XR\r\n\r\nVulnerable; contact TAC\r\n\r\n12.3XS\r\n\r\nVulnerable; migrate to 12.4(12) or later\r\n\r\n12.3XW\r\n\r\nVulnerable; migrate to 12.3(11)YF or later\r\n\r\n12.3XX\r\n\r\nVulnerable; migrate to 12.4(12) or later\r\n\r\n12.3XY\r\n\r\nVulnerable; migrate to 12.4(12) or later\r\n\r\n12.3YA\r\n\r\nVulnerable; contact TAC\r\n\r\n12.3YD\r\n\r\nVulnerable; migrate to 12.4(2)T3 or later\r\n\r\n12.3YG\r\n\r\nVulnerable; migrate to 12.4(2)T3 or later\r\n\r\n12.3YH\r\n\r\nVulnerable; migrate to 12.4(2)T3 or later\r\n\r\n12.3YI\r\n\r\nVulnerable; migrate to 12.4(2)T3 or later\r\n\r\n12.3YJ\r\n\r\nVulnerable; migrate to 12.3(14)YQ8 or later\r\n\r\n12.3YK\r\n\r\nVulnerable; migrate to 12.4(4)T or later\r\n\r\n12.3YM\r\n\r\n12.3(14)YM5\r\n\r\n12.3YQ\r\n\r\n12.3(14)YQ8\r\n\r\n12.3YS\r\n\r\nVulnerable; migrate to 12.4(4)T or later\r\n\r\n12.3YT\r\n\r\nVulnerable; migrate to 12.4(4)T or later\r\n\r\n12.3YX\r\n\r\n12.3(14)YX3\r\n\r\n12.3YZ\r\n\r\n12.3(11)YZ\r\n\r\n Affected 12.4-Based Release\r\n\r\n Rebuild\r\n\r\n Maintenance\r\n\r\n12.4\r\n\r\n12.4(1c)\r\n\r\n12.4(3b)\r\n\r\n12.4(5)\r\n\r\n 12.4(7e); available 26-Mar-07\r\n\r\n All 12.4(8) releases are vulnerable\r\n\r\n12.4(10b)\r\n\r\n12.4(12)\r\n\r\n12.4MR\r\n\r\n12.4(6)MR1\r\n\r\n12.4T\r\n\r\n12.4(2)T3\r\n\r\n12.4(4)T\r\n\r\n12.4(6)T\r\n\r\n 12.4(9)T3; available 9-Apr-07\r\n\r\n 12.4(11)T1\r\n\r\n12.4XA\r\n\r\n12.4(2)XA2\r\n\r\n12.4XB\r\n\r\n12.4(2)XB3\r\n\r\n12.4XE\r\n\r\n Vulnerable; contact TAC",
				"title": "Fixed Software"
			},
			{
				"category": "general",
				"text": "To learn about Cisco security vulnerability disclosure policies and publications, see the Security Vulnerability Policy [\"http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html\"]. This document also contains instructions for obtaining fixed software and receiving security vulnerability information from Cisco.",
				"title": "Vulnerability Policy"
			},
			{
				"category": "general",
				"text": "The Cisco PSIRT is not aware of any public announcements or malicious  use of the vulnerabilities described in this advisory.\r\n\r\nThe fragmented packet evasion vulnerability was discovered internally  by Cisco.\r\n\r\nThe ATOMIC.TCP regular expression denial of service vulnerability was  reported to Cisco by a customer.",
				"title": "Exploitation and Public Announcements"
			},
			{
				"category": "legal_disclaimer",
				"text": "THIS DOCUMENT IS PROVIDED ON AN \"AS IS\" BASIS AND DOES NOT IMPLY ANY KIND OF GUARANTEE OR WARRANTY, INCLUDING THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR USE. YOUR USE OF THE INFORMATION ON THE DOCUMENT OR MATERIALS LINKED FROM THE DOCUMENT IS AT YOUR OWN RISK. CISCO RESERVES THE RIGHT TO CHANGE OR UPDATE THIS DOCUMENT AT ANY TIME.\r\n\r\nA stand-alone copy or paraphrase of the text of this document that omits the distribution URL is an uncontrolled copy, and may lack important information or contain factual errors. The information in this document is intended for end-users of Cisco products.",
				"title": "Legal Disclaimer"
			}
		],
		"publisher": {
			"category": "vendor",
			"contact_details": "Emergency Support:\r\n+1 877 228 7302 (toll-free within North America)\r\n+1 408 525 6532 (International direct-dial)\r\nNon-emergency Support:\r\nEmail: psirt@cisco.com\r\nSupport requests that are received via e-mail are typically acknowledged within 48 hours.",
			"issuing_authority": "Cisco product security incident response is the responsibility of the Cisco Product Security Incident Response Team (PSIRT). The Cisco PSIRT is a dedicated, global team that manages the receipt, investigation, and public reporting of security vulnerability information that is related to Cisco products and networks. The on-call Cisco PSIRT works 24x7 with Cisco customers, independent security researchers, consultants, industry organizations, and other vendors to identify possible security issues with Cisco products and networks.\r\nMore information can be found in Cisco Security Vulnerability Policy available at http://www.cisco.com/web/about/security/psirt/security_vulnerability_policy.html",
			"name": "Cisco",
			"namespace": "https://wwww.cisco.com"
		},
		"references": [
			{
				"category": "external",
				"summary": "Identifying and Mitigating Exploitation of Multiple IOS IPS Vulnerabilities",
				"url": "http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070213-iosips"
			},
			{
				"category": "self",
				"summary": "Multiple IOS IPS Vulnerabilities",
				"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20070213-iosips"
			}
		],
		"title": "Multiple IOS IPS Vulnerabilities",
		"tracking": {
			"current_release_date": "2007-02-13T16:00:00+00:00",
			"generator": {
				"date": "2022-07-15T00:05:29+00:00",
				"engine": {
					"name": "TVCE"
				}
			},
			"id": "cisco-sa-20070213-iosips",
			"initial_release_date": "2007-02-13T16:00:00+00:00",
			"revision_history": [],
			"status": "final",
			"version": "1.1.0"
		}
	},
	"product_tree": {},
	"vulnerabilities": [
		{
			"cve": "CVE-2007-0917",
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Multiple IOS IPS Vulnerabilities",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20070213-iosips"
				}
			],
			"remediations": [
				{
					"category": "workaround",
					"details": "The effectiveness of any mitigation or fix is dependent on specific  customer situations such as product mix, network topology, traffic behavior,  and organizational mission. Due to the variety of affected products and  releases, customers should consult with their service provider or support  organization to ensure any applied mitigation or fix is the most appropriate  for use in the intended network before it is deployed.\r\n\r\nAdditional mitigations that can be deployed on Cisco devices within the  network are available in the Cisco Applied Mitigation Bulletin companion document for  this advisory:  http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070213-iosips [\"http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070213-iosips\"]\r\n      Fragmented Packet Evasion Vulnerability\r\nThere is a mitigation for the fragmented packet evasion vulnerability.  The fragments keyword of IOS transit Access Control Lists  (ACL) can be used to prohibit fragmented IP packets from transiting an IOS  device. More information about filtering IP fragments can be found here:\r\n\r\n   http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml#frag [\"/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml#frag\"]\r\n\r\n\r\nBlocking IP fragments may have adverse affects on some protocols (like  HTTP, FTP and Kerberos/Active Directory), so this workaround should be used  with caution.\r\n\r\n\r\naccess-list 100 deny tcp any 10.1.1.0 0.0.0.255 fragments\naccess-list 100 deny udp any 10.1.1.0 0.0.0.255 fragments\r\n     ATOMIC.TCP Regular Expression Denial of Service Vulnerability\r\nThere is a workaround for the ATOMIC.TCP regular expression denial of  service vulnerability by deleting IPS signature 3123.0 from the IOS IPS  Signature Definition File (SDF). Disabling signature 3123.0 is alone not  sufficient for the workaround to be effective. The following commands will  delete signature 3123.0 from an IOS IPS device.\r\n\r\n\r\nrouter#configure terminal\nrouter(config)#ip ips signature 3123 delete %IPS Signature 3123:0 is marked for deletion %IPS The signature will be deleted when signatures are reloaded or saved router(config)#interface FastEthernet0/0 router(config)#no ip ips test in      router(config)#ip ips test in router(config)#exit\r\n\r\nIn the above example, signature 3123.0 is first deleted from the  Signature Definition File, then the IPS instance running on interface  FastEthernet0/0 is stopped and started to reinitialize the IPS state to reflect  the signature deletion. If the IPS feature set is configured on multiple  interfaces, then these steps must be completed for each affected interface.\r\n\r\nTo determine if signature 3123 is active, use the show ip  ips signature command.\r\n\r\n\r\nrouter#show ip ips signatures | include 3123\n3123:0      N   A      MED     0      0     0   100    30 FA  N    S46\r\n\r\nIn the command output above, the N after 3123.0  indicates that the signature is present in the configuration but not enabled.  Once the signature has been deleted, rerunning the show ip ips  signature command shows:\r\n\r\n\r\nrouter#show ip ips signatures | include 3123\n3123:0      N*   A      MED     0      0     0   100    30 FA  N    S46\r\n\r\nIn the command output above, the N* after 3123.0  indicates that the signature has been deleted from the configuration. The IPS  feature set must be restarted on each interface configured for IPS to complete  the workaround. Once completed, the output of the show ip ips  signature command will show:\r\n\r\n\r\nrouter#show ip ips signatures | include 3123\n router#\r\n\r\nThis vulnerability may affect any IPS signature using the regular  expression functionality of the ATOMIC.TCP engine. Currently, Cisco only ships  one signature configured this way (3123.0). If custom signatures have been  added to an IOS IPS device configured use the ATOMIC.TCP engine with a regular  expression, these signatures must also be deleted from the IPS configuration to  ensure the effectiveness of the workaround."
				}
			],
			"title": "DO NOT PUBLISH UNTIL PSIRT DOES \n\nCisco IOS Fragmented Packet IPS Detection Bypass Vulnerability"
		},
		{
			"cve": "CVE-2007-0918",
			"notes": [
				{
					"category": "other",
					"text": "Complete.",
					"title": "Affected Product Comprehensiveness"
				}
			],
			"product_status": {},
			"references": [
				{
					"category": "self",
					"summary": "Multiple IOS IPS Vulnerabilities",
					"url": "http://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20070213-iosips"
				}
			],
			"remediations": [
				{
					"category": "workaround",
					"details": "The effectiveness of any mitigation or fix is dependent on specific  customer situations such as product mix, network topology, traffic behavior,  and organizational mission. Due to the variety of affected products and  releases, customers should consult with their service provider or support  organization to ensure any applied mitigation or fix is the most appropriate  for use in the intended network before it is deployed.\r\n\r\nAdditional mitigations that can be deployed on Cisco devices within the  network are available in the Cisco Applied Mitigation Bulletin companion document for  this advisory:  http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070213-iosips [\"http://tools.cisco.com/security/center/content/CiscoAppliedMitigationBulletin/cisco-amb-20070213-iosips\"]\r\n      Fragmented Packet Evasion Vulnerability\r\nThere is a mitigation for the fragmented packet evasion vulnerability.  The fragments keyword of IOS transit Access Control Lists  (ACL) can be used to prohibit fragmented IP packets from transiting an IOS  device. More information about filtering IP fragments can be found here:\r\n\r\n   http://www.cisco.com/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml#frag [\"/en/US/tech/tk648/tk361/technologies_white_paper09186a00801afc76.shtml#frag\"]\r\n\r\n\r\nBlocking IP fragments may have adverse affects on some protocols (like  HTTP, FTP and Kerberos/Active Directory), so this workaround should be used  with caution.\r\n\r\n\r\naccess-list 100 deny tcp any 10.1.1.0 0.0.0.255 fragments\naccess-list 100 deny udp any 10.1.1.0 0.0.0.255 fragments\r\n     ATOMIC.TCP Regular Expression Denial of Service Vulnerability\r\nThere is a workaround for the ATOMIC.TCP regular expression denial of  service vulnerability by deleting IPS signature 3123.0 from the IOS IPS  Signature Definition File (SDF). Disabling signature 3123.0 is alone not  sufficient for the workaround to be effective. The following commands will  delete signature 3123.0 from an IOS IPS device.\r\n\r\n\r\nrouter#configure terminal\nrouter(config)#ip ips signature 3123 delete %IPS Signature 3123:0 is marked for deletion %IPS The signature will be deleted when signatures are reloaded or saved router(config)#interface FastEthernet0/0 router(config)#no ip ips test in      router(config)#ip ips test in router(config)#exit\r\n\r\nIn the above example, signature 3123.0 is first deleted from the  Signature Definition File, then the IPS instance running on interface  FastEthernet0/0 is stopped and started to reinitialize the IPS state to reflect  the signature deletion. If the IPS feature set is configured on multiple  interfaces, then these steps must be completed for each affected interface.\r\n\r\nTo determine if signature 3123 is active, use the show ip  ips signature command.\r\n\r\n\r\nrouter#show ip ips signatures | include 3123\n3123:0      N   A      MED     0      0     0   100    30 FA  N    S46\r\n\r\nIn the command output above, the N after 3123.0  indicates that the signature is present in the configuration but not enabled.  Once the signature has been deleted, rerunning the show ip ips  signature command shows:\r\n\r\n\r\nrouter#show ip ips signatures | include 3123\n3123:0      N*   A      MED     0      0     0   100    30 FA  N    S46\r\n\r\nIn the command output above, the N* after 3123.0  indicates that the signature has been deleted from the configuration. The IPS  feature set must be restarted on each interface configured for IPS to complete  the workaround. Once completed, the output of the show ip ips  signature command will show:\r\n\r\n\r\nrouter#show ip ips signatures | include 3123\n router#\r\n\r\nThis vulnerability may affect any IPS signature using the regular  expression functionality of the ATOMIC.TCP engine. Currently, Cisco only ships  one signature configured this way (3123.0). If custom signatures have been  added to an IOS IPS device configured use the ATOMIC.TCP engine with a regular  expression, these signatures must also be deleted from the IPS configuration to  ensure the effectiveness of the workaround."
				}
			],
			"title": "DO NOT PUBLISH UNTIL PSIRT DOES (Projected date = Feb 13)  \n\nCisco IOS ATOMIC.TCP Signature Engine Regular Expression Denial of Service Vulnerability"
		}
	]
}
